[
  {
    "Review Date": "11/06/2024",
    "Reviewer Role": "Account Executive (Hybrid)",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "- Syncs up well with our CRM (Hubspot) with good break down of attainment.\n- Ability to add notes for forecast submissions.\n- We use a Hybrid Model, and I think the layout facilitates the 2-pronged forecast very well. It's clear.\n- Great data on your performance as a rep and deal velocity / avg size etc.",
    "dislike": "- At times there is a bit of a delay when changing deal details for them to appear in my forecast.",
    "problems solved": "- Kluster solves the problem of calculating my own forecast from my CRM which is a cumbersome task.\n- By syncing with our CRM it avoids having to do any manul input (even if at times that sync is little slow).\n- It's hard to understand the granular info on your performance as a rep just from the CRM, but Kluster does this on our behalf and makes it super clear.\n- We have a blend of new business and growth deals that contribute to our target, forecasting for both on CRM would not be as clear as it currently is on Kluster."
  },
  {
    "Review Date": "11/04/2024",
    "Reviewer Role": "Senior Account Executive",
    "Company Size": "Enterprise(> 1000 emp.)",
    "like": "Kluster provides insight on my monthly target attainment. It also allows me to track my development, with many different aspects taken into account (win-rate, sales-cycle duration, average deal-size, to name a few).",
    "dislike": "I would love for Kluster to be more customizable in terms of dashboards to view my statistics. It is good now, I also like the improvement since I started using Kluster. With our setup, we use color-schemes to code how urgent it is to work on certain deals. I don't know exactly what the colors in Kluster mean, but would love to have a guide on that, and the layout in general. Maybe some help to understand inside the dashboards.",
    "problems solved": "It gives an overview of how im trailing towards my monthly target, and solves the problem of not having tangible goals for improving in my career, by providing specific numbers on my performance. Also helps me balance my efforts, since I work with both new clients, and upselling of existing clients."
  },
  {
    "Review Date": "11/05/2024",
    "Reviewer Role": "Senior Account Executive",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Incredible in-app support via live chat!!\nKluster vision and the breakdown of key sales metrics such as avg. deal size, time to close and sales cycle analysis is really useful for accurately forcasting future attainment and required pipeline coverage.",
    "dislike": "Some teething problems with access and slow loading speeds at certain times. Some bugs resulting in missing deals or incorrect values",
    "problems solved": "Forecasting was previously a pain, now it's really simple for users to see an overview of all open deals, track their potential and quickly spot deals that are stalling.\nTime spent forcasting has been cut in half, allowing more time to analyse previous performance and set steps to improve performance using the key metrics available on Kluster."
  },
  {
    "Review Date": "11/04/2024",
    "Reviewer Role": "Angel Investor",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "We moved to Kluster to help solve our issues with forecasting, which we were previously doing in an alternative platform. Now we have a standardised and clear view of the full teams forecast, manual and AI. The calls we are making are 95-98% accurate, the platform has been brilliant.",
    "dislike": "Software can be a little bloated with so many views, but when build what you want it is great.",
    "problems solved": "It's helping us with our forecasting and accuracy in forecasting on a monthly and quarterly view. It is also helping with pacing for month or quarter."
  },
  {
    "Review Date": "11/23/2024",
    "Reviewer Role": "Senior Business Developer",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster has improved my sales forecasting and target attainment with clear and actionable insights into key metrics like win-rate, average deal size, sales cycle duration. Helps make data-driven decisions and plan strategically. The in-app support is excellent, and the visual representation of performance and trends, along with useful filtering tools, makes it easy to track progress and stay focused on key goals. Overall, Kluster is insightful, user-friendly and with great support!",
    "dislike": "Might be due to implementation, but the breakdown of FC isn't as we have it internally, so not sure if it's a limitation of the product. Slow loading speeds at certain times. Some syncing bugs resulting in missing deals or incorrect values.",
    "problems solved": "Sales forecasting and tsrget attaintment."
  },
  {
    "Review Date": "11/04/2024",
    "Reviewer Role": "Senior Sales Manager",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "It's automation in taking into consideration historic sales performance to determine what we need pipeline wise to hit future goals",
    "dislike": "nothing comes to mind, every sales team should use it to be better at forecasting",
    "problems solved": "Forecasting is challenging, many things affect our ability to forecast effectively. But Kluster and its AI tool are routinely on the money when it comes to telling us how long deals will take, what the health of the deal is and how much pipeline we need to close what we need to hit targets."
  },
  {
    "Review Date": "11/27/2024",
    "Reviewer Role": "SMB Account Executive",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "It is easy to use and it gives us good analysis and different charts to evaluate our work.",
    "dislike": "Takes a bit too much time to sync with Hubspot, the layout is not great also.",
    "problems solved": "To speed up my forecast and help visualise my deals in a clear way."
  },
  {
    "Review Date": "11/12/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Great insights if I know where to find them. The emojis are helpful for eyeballing things.",
    "dislike": "Lenses are confusing, and I just really have a tough time tracking down the data I'm looking for. I feel like everything takes more clicks than should be necessary.",
    "problems solved": "Finding forecast data in one place is helpful, but again - the UI makes it tough to find what I'm looking for, and it can be easy to mistakenly look at data under the wrong lens."
  },
  {
    "Review Date": "11/06/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Enterprise(> 1000 emp.)",
    "like": "In a very easily structured dashboard, you have all key metrics and numbers at a glance.",
    "dislike": "Forecasting tool is easy to use and intuitive. If I really had to give a suggestion, I would let the user leave the forecasting dashboard once the submission has been done, as of now I alwasy feel that something went wrong with the submission and I click multiple times on the submission button :-)",
    "problems solved": "Above all forecasting and quarterly data collection for business review"
  },
  {
    "Review Date": "11/05/2024",
    "Reviewer Role": "Sales and Business Development - EMEA",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Dashboard features, pipeline and the ability to push and pull data to and from CRM",
    "dislike": "Often issues with integrations and data from i.e. HubSpot.",
    "problems solved": "Pipeline management and easy pushing of data to and from hubspot"
  },
  {
    "Review Date": "11/12/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The accuracty for the calls it is able to make. It is brilliant for segmenting our different divisions and regions and gives us clear view an extremely accurate forecast roll-up. We can make calls many future months in advance.",
    "dislike": "A lot of bloat, but might be useful if we had further adoption outstanding the forecasting.",
    "problems solved": "We are using kluster to help with forecasting."
  },
  {
    "Review Date": "02/29/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Enterprise(> 1000 emp.)",
    "like": "Kluster is quite perceptive and gives usable insights, providing easy access and practical applicability. The filtering tools enables me, as a user, to have access to a detailed examination of data points.\n\nThe visual representation of performance and trends is impressive, which supports prompt directional advice for the sales department. This function keeps my targets in prominent view, fostering an environment conducive to reaching our goals.\n\nMy capability of forecasting accurately as increased a lot since I started using Kluster's insights. Having visibility into the forecast and obtaining immediate insights on your sales pipeline enables proactive strategizing for the necessary actions each quarter to achieve your targets, ensuring that every quarter is optimally planned for success.",
    "dislike": "Not necessarily a bad thing but for me, as a user, sometimes it is a bit  overwhelming.",
    "problems solved": "Helping me to better keep track of my pipeline and forecasting. Knowing exactly where I should focus my attention and having that right in front of me and well organized is a most."
  },
  {
    "Review Date": "02/27/2024",
    "Reviewer Role": "RevOps Analyst",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Kluster excels at providing insightful data that is not only accessible but also readily actionable. The platform allows for an in-depth exploration of specific data points, thanks to its robust filtering capabilities. This feature is immensely beneficial as it enables us to hone in on precise information relevant to our needs.\n\nMoreover, the ability to set and monitor targets is a game-changer. It offers a clear, at-a-glance view of our current standing, facilitating effective and immediate guidance for our Sales team. This feature ensures that our objectives are always in focus, enhancing our team's ability to achieve them.\n\nAdditionally, Kluster's capability to track performance over time is invaluable. It offers a comprehensive overview of our progress, helping us to identify whether we are on the right path towards our goals or if there are emerging challenges that require our attention. This longitudinal data is critical for strategic planning, as it empowers us to make informed decisions based on trends and patterns in our performance.\n\nThe support we are receiving is great, they are very reactive and always find ways to make things work.",
    "dislike": "As a Saas we are using different products and ARR as a financial metric.\nSometimes is not that easy to manage those two and get all the insights that this tool allow but we managed to find some work around",
    "problems solved": "Kluster is giving me the insights I'm looking for to drive my sales strategy and make sure the team is on track to achieve the objective.\nI'm also using it to look at specific countries, type of companies or sales performance over time"
  },
  {
    "Review Date": "02/27/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster is an invaluable tool for Account Executives seeking data-driven insights and forecasts for sales performance. Its real-time data aggregation and customizable dashboards provide a clear view of KPIs, making it easy to monitor team progress and assess sales strategies.",
    "dislike": "One area where Kluster could improve is in the flexibility of its forecasting module. While it generates forecasts effectively, it could benefit from more advanced predictive modeling options, allowing for better customization and adaptation to unique business needs, especially in dynamic markets.",
    "problems solved": "Kluster is effectively solving the problem of sales performance analysis and forecasting. By providing real-time data aggregation and customizable dashboards, it helps me and my sales team keep a close eye on our KPIs, track individual and team progress, and evaluate the effectiveness of our sales strategies. This benefit is crucial because it enables us to make data-driven decisions and adjustments, ultimately leading to improved sales outcomes and goal achievement. Additionally, while there is room for improvement in its forecasting module, Kluster still helps us anticipate potential trends and challenges in our sales pipeline, giving us an edge in adapting to market dynamics. In summary, Kluster's ability to tackle these problems positively impacts our sales performance and decision-making processes."
  },
  {
    "Review Date": "02/29/2024",
    "Reviewer Role": "Senior Account Executive",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "It's easy to see my progress towards my monthly target and separate between sales led growth and organic. Also it's a good reminder to see the deals that are overdue and gives me a reminder to follow up.",
    "dislike": "You can't see the deals that have been closed, it would be great if you also could see each deal that have ended up in closed won to better track what deals you've been working on. Also the UX is sometimes a bit complicated and I think irt would be great if you could adjust the dahsboard overview a bit more.",
    "problems solved": "Helping me keep track of my pipeline and how I work towards my target. It also reminds me of deals that are overdue or supposed to be closed in the current month, which helps me focus on the most relevant deals."
  },
  {
    "Review Date": "11/12/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The visuals make it easy to navigate and see what you need to see.",
    "dislike": "Feels like there are too many dashboards when realistically you only use 2 or 3 on a regular basis.",
    "problems solved": "Kluster is giving us forecasting trends and patterns that we can't get manually."
  },
  {
    "Review Date": "11/12/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Forecasting simplicity is key to Kuster success",
    "dislike": "Feels quite kluky as a software - works fine but UI/UX is klunky.",
    "problems solved": "It helps bring all forecast history and provide more accuracte forecast than what is just in pipeline. Also help identify pipeline trends in simple format."
  },
  {
    "Review Date": "11/04/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I like the pipeline news feed and the fact that gives you insights on what actions to take.",
    "dislike": "Sometimes it is a bit slow in projecting data from CRM.",
    "problems solved": "I am able to easily scroll through my pipeline and understand the stage of each deal in detail."
  },
  {
    "Review Date": "02/27/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster has been a great addition to our toolkit at Pleo, offering insightful sales analytics and reliable forecasting. The platform is user-friendly, which has allowed me to quickly adapt and move from Hubspot forecasting to Kluster.\n\nThere's a bit of a snag when it comes to the HubSpot integration, though—it's generally smooth but can hit a few bumps with data sync now and again. Nothing that can't be managed, but worth a mention for those looking for seamless integration.\n\nAll in all, Kluster meets our high expectations with only a minor hiccup along the way. A solid choice for any sales teams.",
    "dislike": "It would be advantageous to have visibility of my upside deals on the front page, in addition to those in commit.",
    "problems solved": "Makes forecasting easier"
  },
  {
    "Review Date": "11/27/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Very clean pipeline management and overview of deals\n\nGives lots of insights into trends that would otherwise be very tough or very manual to track",
    "dislike": "Can take some time to sync with hubspot and update deal information",
    "problems solved": "Pipeline managment and visibilty for both reps and managers\n\ngives me greater insights on why I lose and win and when it happens"
  },
  {
    "Review Date": "02/27/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Being able to see your forecast and get real-time insights on your funnel allows you to actively plan what needs to be done each quarter to hit your numbers. Having data back up how you performed in the past allows you to get a better understanding of what is needed to win each quarter.",
    "dislike": "The least helpful would be some false data, but that is not on the kluster end. That would be the data flow form Salesforce and catching all of the right data.",
    "problems solved": "Accurate forecasting for myself and the team to get a better picture of where we might finish. Making the team more productive in finding ways to create and close more pipeline."
  },
  {
    "Review Date": "02/27/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Clarity. Easy to understand and navigate. Clear structure in the menu to get me where I want.\nReal insights shown in all necessary views.\nI feel that we managed to improve greatly on both our data quality as well as the ability to read and understand data.\nAlso, it enables individual contributors to understand what they are good at and where they need to inves more time and effort.\nGreat to have a tool like Kluster next to your CRM and draw clear conclusions so you can make educated decisions backed by data.\nUsing Kluster on a daily basis as a sales manager has definitely helped me and my team.",
    "dislike": "Sometimes it can be overwhelming. When I have time I surf around and find pages that I need to understand first. But I believe it s good to have much information than anything missing",
    "problems solved": "It adds to the data and conclusions that we can draw from our CRM. Kluster offers much more insights and a better experience when it comes to forecasting as a manager and IC."
  },
  {
    "Review Date": "03/26/2024",
    "Reviewer Role": "Account Executive",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The way i can forecast and my manager can see it without asking me, also it suggest me everything that i would close and have a lot of information about my deals",
    "dislike": "Sometime is slow to update the info that is changed in hubspot and i have to go to change manually. But this is not always",
    "problems solved": "We used to forecast in many tools, and now i only have to do it in one.\nWe have to forecast in hubspot and in an excel, since we start using Kluster this changed. Only one forecast in one place"
  },
  {
    "Review Date": "02/28/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster allows me to keep track of my monthly targets which inlcude, pipeline build, meetings booked  and closed won. It's the ultimate way to organise your monthly targets adn remind your self of where you are. It's so so simple to use and the onboarding and implementation process was easy thanks to their custom success team.",
    "dislike": "I haven't found any downsides of Kluster as of yet.",
    "problems solved": "Kluster solves my problem of keeping my targets in a centralised location - one click and I can view all my targets like pipeline build and closed won. This benefits me as it gives me an easy way to keep track of my performance."
  },
  {
    "Review Date": "03/05/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "My leadership team requires that I submit a weekly forecast, and I use Kluster to provide them the information they're looking for.  The \"superforecast\" portion of the tool is very easy to use and helps me stay organized for the month and the quarter, while communicating effectively with my leadership team.",
    "dislike": "There is a short amount of lag time between updates made in my CRM to reflect in Kluster.  I wish it was instantaneous, but it isn't really that big of a deal.",
    "problems solved": "Prioritization, Organization, and effectively communicating with my leadership team.  I'm able to prioritize my daily activity by working backwards from my open pipeline."
  },
  {
    "Review Date": "02/27/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Its simplicity, once you get to grips with adopting the platform, it becomes an area to spend time understanding opportunities open for the month, quarter and across the year.\n\nI like the fact you can start to play around with Kluster appropriate to your own market and previous closing percentages",
    "dislike": "Nothing comes to mind, perhaps there is a scope for further training when they update the platform, overall very happy",
    "problems solved": "Forecasting and understanding expected close for how you work, i.e. commission basis or closing dates\n\nIt is a tool also to understand your market and how you are growing in specific areas of your own sales process"
  },
  {
    "Review Date": "02/27/2024",
    "Reviewer Role": "Account Executive",
    "Company Size": "Enterprise(> 1000 emp.)",
    "like": "Easy to look at stats in comparison, liked the plodding and moving pipeline graphics. Really helps to understand performance over time!",
    "dislike": "Sometimes it is hard to understand what each graphic represents.  There is a lot to learn, but with the right training, you're able to navigate quite easily.",
    "problems solved": "Using Kluster we have broken down guess work, and what is great is that we can identify where to focus our attention in the forthcoming weeks and months, to save time and increase efficiency."
  },
  {
    "Review Date": "02/29/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Having used Kluster for 6+ months now, as an admin user, I am extremely happy with the product. The UX is incredibely user friendly and does not require much upskilling when introducing new AEs to it - and with the excellent customer support we get from our CSM, we are incredibly well supported when we need assistance. Our CSM goes above and beyond and provides data insights that have been invaluable to our team & meakes my job as an admin much easier.",
    "dislike": "Some teething problems with our CRM integration, but other than that - no complaints.",
    "problems solved": "Keeping up to date on team's forecasts and identifying gaps in our sales processes - flagging what deals need more attention & what deal stages are leading to the most leakages in our pipe."
  },
  {
    "Review Date": "02/27/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The ability for users to customise Kluster to meet their specific sales targets. I am able to tailor Kluster month-to-month to ensure I am able to hit my own sales targets.",
    "dislike": "The downside is the wait time to pull in data from Salesforce. Not a big deal as only 15 minutes! but when you need to move quickly can be a hindrance.",
    "problems solved": "is a versatile platform that offers a range of tools and features for sales. The main benefit of using Kluster is the ability to compare and analyse data/ trends in previous months to enable me to give much more accurate forecasts. This is key in allowing me to succeed in my job role. I have used tools before that do NOT provide the same valuable insight that Kluster does."
  },
  {
    "Review Date": "02/27/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Super easy to use! The graphs are amazing and really insightful to help me forecast better to my manager. I am able to drill into where I am most likely to lose a deal and why, which helps me learn moving forward to prevent this from occuring.\n\nOur CS manager is amazing, always on hand to help build out new graphs or explain new features if required. She also regularly shares insight on my deals on pipeline.",
    "dislike": "So far, I have no complaints at all. It does exactly what I need it to do.",
    "problems solved": "I used to find it hard to forecast accurately. However, now with the data backing my forecasts, I am finding that I am more accurate and with what I am reporting to my manager and the business."
  },
  {
    "Review Date": "11/06/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Enterprise(> 1000 emp.)",
    "like": "Easy to understand dashboards with good insights and a quick way to understand the status of the sales pipelines.",
    "dislike": "Not always easy to find the right dashboard.",
    "problems solved": "Understanding where our teams are tracking towards sales goals (ARR) easily broken down per product lines."
  },
  {
    "Review Date": "02/27/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I love the full line of sight into quarter by quarter progress. It allows me to stay up to date as an IC on where I am tracking and how my peers are also doing against their goals. It took almost no time to know how to use and I'd recommend Kluster to any sales org.",
    "dislike": "The only pain point is it only goes back 1 quarter automatically without having to manually input the calendar dates of Q1 for example. It would be best if it tracked 4 quarters back at all times for ease of historical success/quota attainment.",
    "problems solved": "Keeping up to date on forecast, tracking towards goals, being able to see where my peers are at, and managing my pipeline in one easy to use tool."
  },
  {
    "Review Date": "02/29/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I have been using Kluster in my role at Pleo as an Account Executive and its been very helpful with having a clear overview of how I am doing for the month and what still needs to be done. It has been a key tool to help me grow in my role here. I especially like the emoji icons we can add to deals.",
    "dislike": "So far there hasn't been anything that stood out",
    "problems solved": "It provides clear forecasts for myself and my team and shows us where we need to push deals through and in what areas. I provides vital tools for us to understand where we are for the month and how far we are from reaching targets and goals for the month."
  },
  {
    "Review Date": "02/27/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "-Easy visualisation of deals, deal stages, stagnation.\n-AI driven predictions.\n-Our account managers have been very supportive and the onboarding process has been very clear.\n-It's a powerful tool in terms of how it can integrate with your CRM.",
    "dislike": "-So far, there's nothing I dislike and the Kluster team have been very supportive with all our queries.",
    "problems solved": "It's helping me and my team forecast for the current and the coming months, and to easily visualise to what extent we're on track to reach our quarterly targets."
  },
  {
    "Review Date": "02/27/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The insights it gives you about each deal are particuarlly interesting and useful. For example it will let you know the average deal time to close. It will let you know if a particular deal is behind or ahead this average and also put it relative to that particular account and historical deals associated with that account.",
    "dislike": "Syncing with Salesforce could be better. Seems to be a few issues and syncing is not instant.",
    "problems solved": "Better more precise forecasting with useful insights that take into account historical data and current data allowing me to target deals with a better chance of closing and using my time more effectively."
  },
  {
    "Review Date": "02/29/2024",
    "Reviewer Role": "Account Manager",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I love how Kluster synchs with Hubspot to give me a great visibility on all of the deals I am working on. I can also look at my performance in past months to compare to how I am currently doing.",
    "dislike": "There is not much that I dislike, only the loading time could be improved and should become faster.",
    "problems solved": "Getting me a clear overview of deals and my pipeline!"
  },
  {
    "Review Date": "02/27/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster has a relatively easy to use interface and makes it mostly simple to understand how to forecast pipeline.",
    "dislike": "I don't like that some fields are not customizable. For example, there is a \"superforecast\" field that would be great it if could be relabeled to something different. I don't like having to use another tool to forecast. I'd rather that it happend within Salesforce",
    "problems solved": "I have been asked by my team to use Kluster. I think I could likely forecast my deals easily within Salesforce because I typically don't work a high volume of deals. However, it's much nicer to use Kluster than a spreadsheet."
  },
  {
    "Review Date": "02/27/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Enterprise(> 1000 emp.)",
    "like": "Kluster is great for visibility over your sales pipeline. As a business development manager i use this to understand deal velocity, and pipeline added so I can effectively manage my opportunities to hit target\n\n-Great for visibility\n- Understand deal stage and opportunity age\n- Understand how much pipeline is added and how this will help future months\n- Great for deal insights across the team to understand the most effective ratio of number of opportunities and deal size",
    "dislike": "- Can sometime take a little time to update when info is entered into salesforce",
    "problems solved": "- Sales efficeny\n- sales forcasting\n-sales reporting"
  },
  {
    "Review Date": "02/29/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Their team are fantastic - always available and super helpful. Very knowledgeable about the tool and can always advise on approaches and best practise.\n\nThe tool is simple to set up and mantain - loving all the additional self serve features which are coming out over time.\n\nThe pre-populated, SaaS specific dashboards are what made Kluster a no brainer for us over other tools - made setting up so much easier and more effective.\n\nNow fully embedded into our monthly forecasting and reporting cadences.",
    "dislike": "Building your own bespoke charts requires getting help from a CSM, but to be honest they're so responsive that it's not really an issue.",
    "problems solved": "Deeper, faster insights into our pipeline and revenue performance, plus making the team's individual SaaS metrics easily available.\n\nAlso simplified forecasting for us and took us out of spreadsheets."
  },
  {
    "Review Date": "02/27/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I verry much like to have an easy overview of my piplie and to easaly mange to move the to different statges by drag and drop",
    "dislike": "We do not have the rith set up I guees, but we are measured bu billing date and not on the deals stage closed won. This mean that even if I have close a deal in February, I do not bill them in March, due to that it doesn't reflect my forecast correctely",
    "problems solved": "helping me to easy move deals into different stages instead of excel sheets I used before. Very much easier."
  },
  {
    "Review Date": "02/27/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "clear overview over new business and growth deals. it is easy to fill in new information and sharing it with my manager. really good way to keep the pipeline in mind for weekly checkins.",
    "dislike": "So far my only complaint is that they don't have slack pushes.",
    "problems solved": "Keeping the focus on deal closing probabilities and helps to keep the pipeline clean."
  },
  {
    "Review Date": "02/27/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I have been able to gain actionable insights into my teams strengths and weaknesses, I have not only being able to predict outcomes but control them using the various Kluster lenses",
    "dislike": "The UI is sometimes hard to navigate, due to the amount of data points.",
    "problems solved": "I have been able to forecast within 5% for the last 2 quarters using Kluster"
  },
  {
    "Review Date": "02/27/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "It's simple and clear, navigation is simple and it's all easy to understand",
    "dislike": "The hubspot integration can sometimes be slow however, it's a very minor issue",
    "problems solved": "It allows us to view the teams performance and forcasting in a much more simple way than other platforms, we know exactly where we stand and use this in our meetings weekly."
  },
  {
    "Review Date": "02/29/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I enjoy the forcasting feature. Especially the late win suggested forcast. It allows me a more accurate estimation of my deals that are foing to close.",
    "dislike": "It does not take into account the current market climate, and the last months trends are not more heavily weighted.",
    "problems solved": "Forcasting my pipeline for my VP and management"
  },
  {
    "Review Date": "02/27/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I like the synchronisation with Hubspot and the easy overview of Kluster.",
    "dislike": "While the functionality is robust, the learning curve might be steep for new users, especially those who are not as tech-savvy. It would be beneficial if Kluster could simplify their interfaces or provide more interactive guides and tutorials to help users onboard and utilise the full range of features more efficiently. I also wish the Hubspot sync would be faster.",
    "problems solved": "It takles the problem to accurately forecast in sales. I helps with easy forecasting for my role as an AE"
  },
  {
    "Review Date": "03/04/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I like the forecasting that Kluster provides more than any other aspect. It allows me to see all of my opportunities at any given time to give me insight into my own deals and more importantly share that information with my leadership.",
    "dislike": "I dislike the syncing with salesforce as it seems like it takes 10 minutes or so to fully sync.",
    "problems solved": "The problems Kluster is solving for me is showing me which deals are at risk, what I should win, and how much total pipeline I've built overall."
  },
  {
    "Review Date": "02/27/2024",
    "Reviewer Role": "Account Executive",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Ease of use to keep track of your pipeline. Many features that I use often since I need to update my manager my deals each week.",
    "dislike": "Kluster does not have a detailled weakness that I can recall.",
    "problems solved": "Kluster gives me visibility of the deals I have on my pipeline to provide accurate forecasting."
  },
  {
    "Review Date": "03/26/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "You can go in depth and understand areas to improve as a sales rep, from deal stages to pipeline generation to giving more accurate forecast.",
    "dislike": "It can sometimes be a little too excessive with the amount of information as there is so much, but I believe it is all just a matter of getting used to.",
    "problems solved": "More accutare forecasting and understanding which deals are stalled. This helps me to understand which deals to focus on first."
  },
  {
    "Review Date": "10/16/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster offers an unparalleled advantage by providing a comprehensive overview of your entire pipeline, offering a detailed insight into the intricate stages of each deal. Understanding the precise count of deals at various stages is a pivotal aspect, enabling a clear understanding of the pipeline's health. This visibility allows you to identify bottlenecks where deals may be stagnating or facing obstacles, and equally crucial, pinpoint deals that have the potential to slip away. Addressing these potential drawbacks in a proactive manner is of paramount importance to keep the pipeline flowing smoothly and maintain a positive momentum.\n\nWhat truly sets Kluster apart is the attention to detail in addressing both positive and negative aspects of your deals. The sophisticated dashboard is a standout feature, presenting a visual representation of your committed and best-case deals. This dashboard not only offers clarity but also allows for easy customization and interaction. The ability to mark these deals with icons and swiftly move them back and forth within the dashboard further enhances the user experience, enabling seamless and real-time management of your sales pipeline. The power to swiftly adapt and respond to changes, backed by this intuitive interface, is a testament to Kluster's commitment to facilitating efficient and effective pipeline management.",
    "dislike": "Thus far, our experience with Kluster has been overwhelmingly positive, with no major concerns to report. The only minor inconvenience we've encountered is a slight overlap in functionalities with some of the other forecasting tools currently in our toolkit. While this doesn't diminish Kluster's effectiveness, it does prompt us to reevaluate our existing array of tools and streamline our processes.\n\nAs we conduct this evaluation and potentially trim down our toolset for optimal efficiency, we can foresee a scenario where Kluster will increasingly become our go-to solution for managing and analyzing crucial aspects of our operations. Its robust features and user-friendly interface make it a promising candidate for centralizing our forecasting efforts. By consolidating our tools and utilizing Kluster's comprehensive capabilities, we anticipate a more streamlined and cohesive approach to our forecasting and decision-making processes, thereby maximizing the value and potential that Kluster offers.",
    "problems solved": "The seamless integration of our CRM (Hubspot) functionality and simplified forecasting analytics has drastically enhanced our operational processes. Since integrating Kluster into our workflows, our precision in forecasting has notably improved, leading to greater efficiency in our forecasting procedures, revenue planning, and strategic team sessions."
  },
  {
    "Review Date": "03/07/2024",
    "Reviewer Role": "Miembro",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Emojis to have control of your deals (signed, KYC completed, etc) and facility to change the deal status",
    "dislike": "It is not within Hubspot and it's not updated at the same moment",
    "problems solved": "More accurate forecast - I can predict better my monthly results"
  },
  {
    "Review Date": "02/27/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Data at my finger tips. Removes the chore of creating my own dashboards and reports on my CRM to extract the data that I am looking for.",
    "dislike": "It is sometimes difficult for me to click out of a chart that I zoomed in to see more details. I am most probably the problem rather than the platform.",
    "problems solved": "It's always a challenge trying to correlate data to improve your forecast accuracy. Kluster helps you to do so by providing useful trends and historical data."
  },
  {
    "Review Date": "03/13/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "- Easy to use\n- Straight forward\n- Integration with Hubspot",
    "dislike": "- Sometimes there can be a slight delay with updating deal currencies.",
    "problems solved": "- Keeping track of my sales pipeline\n- Allowing me to more accurately forecast"
  },
  {
    "Review Date": "02/27/2024",
    "Reviewer Role": "SMB Sales Manager Iberia & UKI",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I really like how I can check the numbers and the performance of my team. It is simple to use and very intuitive.",
    "dislike": "Sometimes I feel there is too many reports and I find them difficult to understand.",
    "problems solved": "Forecasting and analyzing sales performance"
  },
  {
    "Review Date": "02/27/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I think is very intuitive, easy to navigate, offers a lot of information and insights.",
    "dislike": "It is a bit slow sometimes to integrate with hubspot.",
    "problems solved": "Solving the weekly forecasting process, it is quite easy now."
  },
  {
    "Review Date": "03/09/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "It's simple to use, the dashboard is really intuitive.",
    "dislike": "It lacks automations at the moment, such as automatically bringing opportunities that are in certain stages into weighted pipeline. This is on the roadmap though I believe.",
    "problems solved": "Kluster solves all of my sales forecasting needs at the end of every week. It is easy to use and saves a lot of time vs a manual process."
  },
  {
    "Review Date": "02/27/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The different lenses we can create at different levels",
    "dislike": "Its difficult to amend something when an error has been made in set up (need to go through a third person)",
    "problems solved": "Forecasting internally"
  },
  {
    "Review Date": "02/29/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "bing able to track and submit forecasts to my manager and keep track of my deals.",
    "dislike": "the insights on deals at risk could be a bit more intuitive. We have a 6 month sales cycle, and seeing everything registering as at risk can cause undue stress. Maybe during integration it can be customised to deal cycle?",
    "problems solved": "being able to have oversight of my whole pipeline"
  },
  {
    "Review Date": "02/29/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I like the easy monthly overview, and how I can navigate through different months and quarters",
    "dislike": "Not always 100% accurate data, but I am not sure if that is a Kluster issue.\nI do also get a bit confised about the forecasting , for eksample if commit and best case should be calculated togetehr",
    "problems solved": "I can easily get access to my sales numbers."
  },
  {
    "Review Date": "03/06/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Ease of use, integration with SFDC, support of team, saves me time",
    "dislike": "Not as easy to customize on our own, but our CSM is very responsive to our requests",
    "problems solved": "Providing a single place to surface up performance across vectors and timeframes, as well as support our forecasting efforts, highlight chokepoints in our sales velocity by rep, stage, or deal."
  },
  {
    "Review Date": "03/05/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Tracking of conversion rates, deal velocity, avg. deal cycle, avg. deal size is very transparent and forecasting is more efficiency and easier than previously.",
    "dislike": "I only find the syncronization and the general UI as a downside, but nothing that shakes the ground beneath me.",
    "problems solved": "Kluster increases my forecasting accuracy by centralizing my pipelines, deals and forecasting to one platform."
  },
  {
    "Review Date": "02/27/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I started using Kluster quite recently and its exceptional data visualization ensures that crucial insights are effortlessly grasped at a glance. The intuitive dashboards make navigating through data a breeze, empowering users to easily make informed decisions.",
    "dislike": "Nothing so far- I started recently using the platform; hence I still have to learn more about the product.",
    "problems solved": "Avoid manual reporting from Salesforce."
  },
  {
    "Review Date": "03/08/2024",
    "Reviewer Role": "Account Manager",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "It offers clarity on sales analytics and makes forecasting easy and intuitive. Really helps me to keep track of my deals and data. It inegrated very well with our CRM.",
    "dislike": "There's not much, maybe one point would be that I would love to see more customizable dashboards.",
    "problems solved": "- Sales forecasting\n- SaaS Metrics\n- great Overview"
  },
  {
    "Review Date": "02/27/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Being able to see all the different reports and visually being able to compare stats.\n\nVery easy to use",
    "dislike": "Can be a bit slow to update at times upon entering new data",
    "problems solved": "Helping me manage pipeline through each month/quarter and it solved a problem as I was never able to have a full insight of my pipeline before kluster."
  },
  {
    "Review Date": "02/27/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The analysis Kluster offers of historical deals/performance allows me to plan future performance and PG efforts",
    "dislike": "The UI can sometimes be confusing, although this has improved recently and there support team are always on hand to tackle questions",
    "problems solved": "Enabling accurate forecasting based on historic performace and specific deal activity - it's helping us to forecast much more accurately"
  },
  {
    "Review Date": "10/12/2023",
    "Reviewer Role": "Business Owner",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "As a senior AE, I like that Kluster's dashboard is very user friendly and easy to see key metrics of my pipeline. It's straightforward for me to submit my number up and add a couple of key notes about a potential oppourtunity.",
    "dislike": "So far, nothing. The only inconvenice is that Kluster solves for areas that overlap with other forcasting tools we are using. Once we trim down our tools, I can see us relying more on Kluster and less on other tools.",
    "problems solved": "Sales Forcasting and Oppoutunity Analytics."
  },
  {
    "Review Date": "02/27/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Really useful data and breakdowns when you dive into it, quick way to display forecasting",
    "dislike": "Sometimes the metrics can feel a little unforgiving and don't take into account nuances of a sales cycle",
    "problems solved": "Getting our team deeper analytics on sales cycles, sales velocity, and ASP to help identify areas where a specific rep may need improvement"
  },
  {
    "Review Date": "02/27/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "A great tool to forecast my pipeline and commit for the upcoming month. Like the connection with our CRM for minimal admin in Kluster. Emojis also make the overview visually appealing.",
    "dislike": "Need external help to adjust rights and views sometimes. However, this goes pretty quickly.",
    "problems solved": "Forecasting sales pipeline and keeping track of deals for the month."
  },
  {
    "Review Date": "09/26/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "As a VP of sales a large part of my Job is reporting revenue analytics. Kluster is plug and play but also gives insight that other tools charge 10x for. I was able to solve all reporting needs but do so in a way that my entire C-suite can digest at any given moment.",
    "dislike": "So far my only complaint is that they don't have slack pushes. However their new email push is amazing and helps so much.",
    "problems solved": "Reporting Alaytics up but also being able to make decisions on KPIs on the fly"
  },
  {
    "Review Date": "02/27/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Easy to forecast and stay on top of your pipeline and funnel. Easy to estimate your deal velocity, close rate and average size in the analytics page",
    "dislike": "Sometimes slow to connect with CRM tools.",
    "problems solved": "Giving great insight in to my averages that i can work on and develop. Average size, volocity, winrate etc."
  },
  {
    "Review Date": "03/11/2024",
    "Reviewer Role": "Advisor",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Nice UI, Good Integration to HS, makes AE life just a bit easier! Before we had just Spreadsheets!",
    "dislike": "I'd refer to more forecasting details and tips on my pipeline coverage. Otherwise great tool and excellent support.",
    "problems solved": "Help me get my forecast up to speed!"
  },
  {
    "Review Date": "09/26/2023",
    "Reviewer Role": "Account Executive",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "For a while I was pulling data from our CRM and putting it into a spreadsheet and it was such a manual process, and often forgot to update key areas. I use Kluster daily and it has saved me a ton of time and ensured our sales reviews are more accurate so we can make better decisions.",
    "dislike": "At first, the navigation to my team was tricky but figured it out in 30 seconds and now it's no problem.",
    "problems solved": "Kluster helps us with forecast accuracy and creating pipeline goals."
  },
  {
    "Review Date": "05/23/2023",
    "Reviewer Role": "Sales Executive, Nordics & Baltics",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The best thing about Kluster is that it gives you insight on your whole pipeline. You know how many deals are in wich stage and how many of them are not moving forward. It is the negative things like deals stuck and deals that might slip that is the most importnat to take aktion on. I really also like the dashboard where you see your committed and bestcase deal and you can easly mark them with icons and move them back and forth.",
    "dislike": "That it takes some time for the Hubspot integartion to sync. It would be much better if it would automattically sync when you do changes in Kluster or in Hubspoot.",
    "problems solved": "It really shows me my relevant pipeline and how much I need to create to guarantee that I will hit all my goals the coming next 2 Quarters. The small emoies are super easy to use and help out as salespeople often are visual."
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "Senior Account Executive",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I love that Kluster helps me stay on top of my pipe and making sure no deals slip through the cracks. Little things like how often a deal close date is pushed out affects deal velocity and Kluster highlights this. It's been super helpful as a newly joined AE to make sure I'm hitting my sales goals.",
    "dislike": "I think the UI can be improved, but I prioritize the data that a revenue intelligence platform houses. Kluster provides exactly that. Finding the sidebar arrow to collapse it can get annoying sometimes (would be nice if it was dynamic and adjusted the main screen rather than taking up a few inches and having to manually collapse), but the product functions as expected.",
    "problems solved": "Kluster helps helps me forecast easier, helps nudge me for stalled deals, helps me understand what my revenue targets are, and making sure I'm getting rid of opportunities that should not be there."
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "Demand Generation Operations Senior Manager",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Streamline team forecasts for more effective sales management and increased revenue predictability\nImprove one-to-one meetings and analyze individual pipelines to develop data-driven strategies\nDrive SaaS companies to surpass targets every quarter with Kluster's revenue predictability platform\nEmpower revenue leaders with tools for strategy definition, target delivery, and seamless deal and pipeline management; #1 for integration speed and live forecasting",
    "dislike": "A bit disappointed by the lack of flexibility to create custom reports outside the provided options on the platform, and with sluggish load speeds that hinder productivity and user experience\nA better integration with HubSpot would also be appreciated",
    "problems solved": "Kluster is a game-changer for sales management. It streamlines team forecasts, boosts revenue predictability, and takes one-to-one meetings to the next level. The platform helps us exceed targets every quarter, providing data-driven insights for strategy definition, seamless deal management, and live forecasting. As a millennial DG manager, Kluster empowers me to drive growth and make informed decisions with its user-friendly tools."
  },
  {
    "Review Date": "02/27/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Really easy to use, gives you great visibility of your deals and allows you to forecast really accurately",
    "dislike": "A little bit 'clunky' looking perhaps, but functionality is easy to use",
    "problems solved": "Allows me to forecast accurately - my Manager always runs our pipeline reviews using Kluster as a guide :)"
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "Commercial Operations Manager",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "We've had an excellent experience with Kluster so far, they have been able to work with us to create dashboards which fit our business needs - they're also really responsive about any questions we have",
    "dislike": "There is a certain degree of trial and error with getting the dashboards set up, but nothing worse than I expected given the way our system is set up. Our biggest challenge has been adoption (as with any of these tools), but after about 8 months we hit our sweet spot and people are much more engaged now.",
    "problems solved": "We use hubspot and we felt that the dashboard functionality was too limited, we wanted easier access to our data and to be able to access it in a more visual way. We were also using more basic documentation for Commit meetings, and wanted a way to better track our pipeline month to month."
  },
  {
    "Review Date": "02/27/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Real time update with the CRM\nForecasting New Business and Growth\nTransparency\nTime comparing",
    "dislike": "Sometimes is very slow\nI wish I could see my colleagues numbers sometimes",
    "problems solved": "121 with my manager are faster\nvery good view of the situation\neasier ti predict future moths revenue"
  },
  {
    "Review Date": "10/05/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster allows you to easily and quickly gain access to valuable insights which allow you to spend time focusing on building and executing plans to improve where in the data you can see you are not performing so well",
    "dislike": "No downsides to the tool itself, but the UI could be nicer compared to other UIs of tech tools",
    "problems solved": "Reducing our manual efforts on forecasting, saving time. Increasing our visbility into sales metrics, to drive the correct coaching conversations."
  },
  {
    "Review Date": "02/29/2024",
    "Reviewer Role": "Sales Development Representative",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Forecasting is really intuitive and helps track stagnant deals really closely!",
    "dislike": "Sometimes it takes a little bit long for info to be updated from Hubspot but not too bad",
    "problems solved": "Forecasting takes well less time as it allows you to drag and drop"
  },
  {
    "Review Date": "03/01/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "It makes forecasting and reviewing easy, I like the drag & drop feature.",
    "dislike": "I think the labels could be better. Its not intuitive to understand what manual opt up vs. commit, vs. roll-up really means.",
    "problems solved": "Forecasting, reporting, viewing targets and goals"
  },
  {
    "Review Date": "02/27/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I really like how simple and easy it is to input my monthly and quarterly forecast.",
    "dislike": "I haven't found anything specific that I don't like.",
    "problems solved": "Kluster is solving our inabililty to forecast with confidence, and the time it takes to manually input."
  },
  {
    "Review Date": "02/28/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I find ease of use to be a massive plus.",
    "dislike": "I don't have any complaints about Kluster.",
    "problems solved": "Helping me to understand where deals are at, last time I've worked with specific contacts, and forecast better."
  },
  {
    "Review Date": "02/28/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "deal vaule is clear, good use of icons with deal slip etc, and can show key details very easily and clearly",
    "dislike": "hard to naviage if away from main dashboard",
    "problems solved": "shows mu pipeline very clearly."
  },
  {
    "Review Date": "02/28/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Detailed and simple view of your pipeline",
    "dislike": "maybe too much nimbers in the same screen",
    "problems solved": "When you dont have a clear view of your pipeline and the stage in which each deal is"
  },
  {
    "Review Date": "02/27/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster helps us to weekly forecast our commit, best case and pipeline deals.\nWe are also able to deep dive into pipeline metrics and analyze how pipelines are progressing and deals are moving from stage to stage.\nI can commit my weekly, monthly and quarterly numbers with Kluster to the board.",
    "dislike": "It is simple to use, but sometimes a layer deeper into the analytics would be helpful.",
    "problems solved": "Forecasting and Analytics"
  },
  {
    "Review Date": "02/29/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "That it's very easy to see data and statistics",
    "dislike": "sometimes it's not up to date and the stats can differ",
    "problems solved": "the overview over my pipeline and how my deals are going"
  },
  {
    "Review Date": "02/27/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The connection to our CRM\nThe overview of numbers",
    "dislike": "Nothing for now. Sometimes it responds a bit slow.",
    "problems solved": "Centralizing my pipeline in 1 platform. Understanding my numbers, target, current sales position."
  },
  {
    "Review Date": "02/27/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Easily able to see pipeline and add notes to deals/emojies",
    "dislike": "lags when refreshing forecast, doesn't link to Hubspot very quickly.",
    "problems solved": "Being able to see clearly the sales speed and pipeline generation."
  },
  {
    "Review Date": "09/27/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "How it interacts with Salesforces so seamlessly. It captures all my salesforce data and makes forecasting a breeze. I like how it can easily calculate potential winnable deals and pipelines to build a diverse forecast.",
    "dislike": "A little slow on the salesforces updates to kluster. I wish it was a little faster.",
    "problems solved": "How to forecast all the potential deals and provides a view of the best and likely outcomes."
  },
  {
    "Review Date": "10/12/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Just as the title says, it's a simple and intuitive UI and allows you to quickly enter forecasts and report on everything form conversion rates, forecasts, pipeline - you name it. Having used tools like Insight Squared, this is much cleaner.",
    "dislike": "Given my usecase, Kluster has been able to deliver on all of the needs that I have. Sure, there are little user experience items that could be polished, but I would be petty to outline them as true negatives of the product.",
    "problems solved": "It has streamlined both the forecast process as a rep and the analytics around conversion."
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "Revenue, North America",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster provides great information for any sales leader that otherwise lives buried in the CRM. The accuracy on forecast is (scarily) on point, and it notices things about deals and rep patterns that usually would take missed quarters to identify. Overall, it's a great asset to our revops and sales leadership group.",
    "dislike": "My company follows shifted quarters (Salesforce style) and it can be a pain to reset the timeline of quarters and pull in pipeline for the quarter each time you want to dig into a new report.",
    "problems solved": "Kluster gives me the data and insights at a level that is impossible within Hubspot alone. I can identify problem areas for the team and work to coach and train the sales team on the issues that Kluster helps notice."
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "In my previous companies, we had to rely on CRM forecasting and analytics tools which, to be honest, have never been really good. Always struggling with forecasting, cross-data analysis, and generating easy-to-read, and insightful reports for scenario planning. All this was solved once we started using Kluster with my organization. No more waiting for CRM experts to update our reports or create multiple scenarios, or having to extend forecasting meetings because the data wasn't useful.",
    "dislike": "Nothing so far - After a 30 min wide team training session, everyone started using Kluster without any hiccups.",
    "problems solved": "Ease of use for CRM and forecasting analytics made easy. Since starting using Kluster, our ability to forecast properly has increased, making our forecasting, revenue planning, and team strategy sessions much more efficient."
  },
  {
    "Review Date": "02/27/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The visibility, how easy is to understand the numbers",
    "dislike": "sometimes is a little bit slow when making changes",
    "problems solved": "I am watching al my sales performace easyly"
  },
  {
    "Review Date": "02/29/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The ability to see pipeline progress and understand trends",
    "dislike": "Ability to customise certain sales reports",
    "problems solved": "Understanding how pipeline is developing g"
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "Senior Business Development Rep",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster is super helpful in being able to track my team's metrics. In the craziness of each day, it's nice to come into the platform and have everything in one place. It's super easy to use, and my weekly 1:1 calls with our rep are helpful in identifying room for growth.",
    "dislike": "There isn't anything that's not working well for me. Support is super fast and the platform is very easy to use. I have nothing but nice things to say about it!",
    "problems solved": "Kluster is helping me keep track of my team's daily, monthly, and quarterly metrics. Sometimes it's hard to have complete confidence in random reports but with Kluster I have full faith the information given is correct."
  },
  {
    "Review Date": "05/23/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "- Provides us with a top-level forecasting and opportunity management view for all our deals.\n\n- Great tool for daily monitoring of quota coverage/attainment.\n\n- Forecasting upcoming quarters and beyond.\n\n- Easy to navigate and flexible to accommodate different levels of job roles needed.\n\n- Easy integration with Salesforce, so no need for duplicative actions.",
    "dislike": "There isn't anything in particular that strikes me as negative about the solution.\n\nHowever, there are a few areas within the dashboard and Kluster Vision (analytics) that can be a bit confusing to initially grasp, but there are dedicated live resources you can leverage to help navigate those early adoption days.",
    "problems solved": "- Kluster helps us forecast better and easier with clear data analytics to make informed decisions.\n- Keep track of stalled deals that may need a little nudge.\n- Understand what my revenue targets are for the quarter and beyond.\n- Making sure I am keeping a high level of sales hygiene by keeping opportunities up-to-date and closing out any deals that do not need to be there."
  },
  {
    "Review Date": "05/23/2023",
    "Reviewer Role": "Sales Development Representative",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster is a powerful team collaboration platform that aims to streamline and optimize project management and communication processes. With its impressive array of features and intuitive interface, Kluster provides a comprehensive solution for businesses seeking to enhance teamwork and productivity. Having extensively used Kluster for several projects, I can confidently say that it has proven to be a valuable asset in maximizing our team's efficiency.",
    "dislike": "One dislike of Kluster is its lack of advanced customization options. While the platform offers a range of features that cater to general project management needs, it may fall short for businesses with unique or specific requirements.",
    "problems solved": "Kluster is primarily solving the problem of scattered communication and inefficient project management. Before using Kluster, our team faced challenges with fragmented communication channels, missed deadlines, and difficulty in tracking project progress. Kluster has provided a centralized platform that brings all team communication and project management tools together, eliminating the need for multiple applications.\n\nBy using Kluster, our team now enjoys streamlined communication, improved collaboration, and enhanced project efficiency. The platform allows us to have real-time discussions, share files, and conduct video calls within a single environment, eliminating the need for constant switching between different tools. This has significantly reduced communication gaps, ensuring that everyone stays informed and on the same page."
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "Director, Enterprise Client Services",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I like that Kluster allows for a quick way to forecast individual employees on my team a week, month, and quarter out in advance, as well as being able to forecast from an overall team perspective.",
    "dislike": "My main issue with Kluster is from a management, or \"roll-up\" perspective, as Kluster calls it. The forecast that each of my employees submit does not roll-up into my forecast accurately, nor does it mirror which category/stage they have listed each deal in their forecast in. I am having to take time to pull each of their reports individually (or I have been asking them to just send a screenshot upon submitting for ease of reference) and then go in and manually pull each deal into the correct category for each of my employees to make my teams' forecast accurate. Additionally, if I click on \"roll-up\" mode, it will show none of my staff has submitted a forecast when they have, and if I go and pull their report/forecast separately, it will show submitted. It could just be something in Kluster that is set up wrong, but I know our Revenue Ops team has inquired a few times and been told it's fixed, and we're still having this issue. It just makes it very manually intensive at this time from a team forecasting perspective that I'm responsible for submitting weekly and monthly.",
    "problems solved": "Assuming that Kluster can fix the roll-up mode that I referenced on the previous page, Kluster will be very helpful in allowing myself and my team to accurate forecast a week, month and quarter out in advance and know which specific deals are likely to close each week, and what stage the other deals are in."
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "What I like best about Klsuter is that it integrates seamlessly with Salesforce and reflects updates in less than a few minutes. This is helpful because it gives my manager real-time insights about what deals are in play, what stages they're at, and predicted close dates. This eliminates the need to constantly ping my manager with updates since broad changes are reflected in a visual dashboard.",
    "dislike": "I wouldn't say I 'dislike' this about Kluster but I do think there is an area of improvement -- being able to add contextual notes to each deal would be beneficial so that managers have detailed insights into why a deal is in a particular stage and what it will take to progress the deal / when it might progress.",
    "problems solved": "The main problem that Kluster is solving is real-time insight for management into deal cycles and the ability to more accurately forecast close dates and revenue amounts. This benefits me as a user because it requires less back and forth between myself and my manager in that I can simply reflect changes in Kluster to give him insights to deal cycles."
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Really useful to have everything on one portal. Love the sales velocity tab - - information that explains what is needed to success target on a monthly quartly and annual basis.",
    "dislike": "Sometimes updates can take over 15 fifteen minutes to update via CRM (Hubspot)\n\nTo many unused dashboards - filters - ideally be suitable to have limited filters.",
    "problems solved": "Managing pipeline and Enhanced Visibility and Transparency: With Kluster,\n\nproject stakeholders gain better visibility into project status, timelines, and resource allocation. The software offers visual dashboards and reporting tools that present key project metrics and data in a clear and accessible manner. This transparency facilitates informed decision-making, enables timely adjustments, and helps identify and mitigate potential bottlenecks or risks.\n\nEfficient Resource Management: Kluster helps optimize resource allocation by providing insights into resource availability, utilization, and allocation across projects. This allows project managers to balance workloads effectively, avoid overburdening team members, and prevent resource conflicts. By maximizing resource efficiency, Kluster enables teams to deliver projects on time and within budget."
  },
  {
    "Review Date": "03/06/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The team at Kluster is outstanding. They were able to help align cross-functional teams by speaking about the revenue forecast in the same language. Their team is extremely knowledgeable and was able to pass it on to our RevOps and Sales Leaders.\n\nI believe we could've picked any platform, but without proper enablement, it would've been a waste of money. The Kluster team has gone above and beyond to ensure our success. I highly recommend working with them.",
    "dislike": "The UX might sometimes feel a bit clunky. There is an opportunity for some productivity gains - specific numbers flowing through more user journeys, and the ability to multi-view tabs for easier comparison. It is not trivial in getting work done.",
    "problems solved": "I can forecast my business with a high degree of confidence. I can prepare for QBRs easier and back up the story with data that clearly shows a forward-looking action plan on a different level - individual, team, or region."
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Forecasting used to be one of the most laborious tasks. Copying and pasting figures from one place to another, calculations on the iPhone and triple checking the CRM to ensure no deal was forgotten. Now, I open one tab and everything is ready for me. With all my opportunities synced from Salesforce, I have full visibility into my entire pipeline without having to switch back and forth or second guess anything. In less than a minute, i can see exactly what's needed for me to reach my target.",
    "dislike": "So far, there isn't anything for me to dislike. In addition to the functionality making life easier, even the user interface is a delight given the simplicity of the layout.",
    "problems solved": "Pipeline visibility and management. I have full transparency into my journey to quota attainment and exactly where I need to focus my efforts to get to where I need to be."
  },
  {
    "Review Date": "10/08/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster helps me stay on top of my pipeline and ensures I hit my sales goals as a new Account Executive. It's great at highlighting deal details like close date changes that affect deal velocity.",
    "dislike": "As of now, I have not identified any significant issues or drawbacks with Kluster.",
    "problems solved": "Kluster simplifies my forecasting, nudges me on stalled deals, clarifies my revenue targets, and ensures I remove unnecessary opportunities from my pipeline. It's an invaluable tool for streamlining my sales process."
  },
  {
    "Review Date": "10/12/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "- Real time analysis\n- A great tool for sales reps 1:1s and where to focus there efforts\n- Data that has not been previously attained or easily attained\n- Great Customer Service / Quick response times",
    "dislike": "- Sometimes the platform engine can be a little slow to respond\n- There's a lot to take in, some data points are not the most intuitive",
    "problems solved": "Rep stalled pipeline and key stats on where sales reps should focus their efforts."
  },
  {
    "Review Date": "05/23/2023",
    "Reviewer Role": "Business Development Manager",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "It's interesting to track my average deal cycle and which deals have contributed to my success. I also use this a lot to track the amount of opportunities I create per month and evaluate this each month.",
    "dislike": "The downside of Kluster - I am yet to find any. I think I could get more out of the platform, but I believe that this is because I don't have enough time to use the platform, rather than any dislike about the Kluster platform.",
    "problems solved": "It's helping to predict my future pipeline and revenue growth. It's solving the issue of not understanding trends and things to look out for in the sales process/cycle."
  },
  {
    "Review Date": "09/26/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The insights and the different dashboards and views to find clear conclusions on how to manage my team more effectively.",
    "dislike": "I do not dislike anything. The UX could be a bit improved.",
    "problems solved": "Having a much better insightful view about my team's overall performance."
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "Account Executive | Australia & New Zealand",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I love being able to customise my view for fields that are relevant to me to give me a full and holistic picture of where my pipeline is and where  I am going to get to not just this quarter and next - you always have to have one eye on the next quarter and this really helps you.",
    "dislike": "Great solution but sometimes I find that the load speeds can be a little slow (fair enough when it is pulling so much data) but sometimes when I need to look up something quickly it can be a little annoying.",
    "problems solved": "Being able to accurately forecast, get a clear snapshot of my pipeline, and help me to keep my salesforce clean and tidy. It also helps me to see measurable data points that I can track like days to close and average deal size."
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The tool highlights all aspects of your forecast in a clear and easy-to-use view, enabling you to be on top of your team, your deals, and your forecast.   The Kluster team responds quickly to your inquiries via the chat function and is very helpful.  You can make changes in Kluster that also update SFDC, meaning you only need to be in one tool during your forecast call.   I recommend Kluster to any company looking for a tool to help efficiently and effectively manage the forecast.",
    "dislike": "I haven't found any downside to Kluster, but some additional features could be added to improve it.  The upside to working with Kluster is that the team is always open to ideas for the platform and makes changes nimbly as needed.",
    "problems solved": "Kluster helps me to deliver an accurate forecast and fully understand all aspects of my forecast."
  },
  {
    "Review Date": "09/26/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster has been totally customized for my company and my team specifically, showing you many essential analytics and suggesting solutions.",
    "dislike": "I would like it to be more intuitive, a screen full of numbers may be difficult to navigate",
    "problems solved": "It solves forecasting"
  },
  {
    "Review Date": "03/13/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Dashboards are neat, and the possibility of tagging deals",
    "dislike": "Inconsistency in syncing to CRM, causing all notes to disappear.",
    "problems solved": "Forecasting, it's a tool that serves it purpose on some level. Not perfect"
  },
  {
    "Review Date": "10/17/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "- Accuracy on data\n- AI Support for a better overview of deals\n- Kluster vision allows me to do reverse engineering using conversion ratios to build different plans before every quarter\n- Great UX, easy to use",
    "dislike": "- Hubspot integration works fine but is not the fastest",
    "problems solved": "have full visibility on my pipeline and instant granularity on every opportunity details with just one click"
  },
  {
    "Review Date": "04/26/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "We have recently started using Kluster and it's been a game changer for us. It is really intuitive and easy to use, and the customizable platform and real-time progress tracking have helped me stay organized and on top of things without feeling overwhelmed. The reporting capabilities are great and give me a clear overview of everything that's going on.\n\nOn top of that, we have a great CSM (Charlotte Payne) who always goes above and beyond to ensure satisfaction with the product and always provides quick and helpful solutions to any issues we encounter. Her dedication and expertise is much appreciated in our organisation.\n\nOverall, I highly recommend Kluster. It's definitely made my work life a lot easier and more streamlined.",
    "dislike": "Honestly, there's nothing I dislike about Kluster. The platform is highly customizable, intuitive, and easy to use.",
    "problems solved": "Giving me a clear view and keeping me on top of things"
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I like how easy it is to drag and drop my forecast submissions week over week and how seamlessly data flows from Salesforce into the Kluster platform. So far, it is our organization's best tool for revenue forecasting.",
    "dislike": "Sometimes it takes a bit long for data changed in Salesforce to reflect in Kluster, but that os the only thing I can think of that I dislike about the platform since using it over the past few months.",
    "problems solved": "We have had a problem properly forecasting revenue because Salesforce data is not as up-to-date as it could be. Kluster forces salespeople to keep Salesforce hygiene high, by putting forecasts front and center, allowing users to quickly see what they have coming up and what may need to be adjusted based on the reality of a deal."
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "As a repeat customer, all I can tell you about Kluster is that they care. Forget features and widgets - yes, the product is world class, but the Kluster team cares about their customers and is more than willing to go the extra mile.",
    "dislike": "None, really. They are constantly evolving and building amazing tech",
    "problems solved": "Kluster provides us insights into our revenue function. Forecasting is important but that's just one portion of what Kluster provides (btw, the AI is impressive on its accuracy). I find pipeline insights and an end-to-end view of the GTM function particularly useful."
  },
  {
    "Review Date": "09/26/2023",
    "Reviewer Role": "Commercial Account Executive",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Better Pipeline management, time efficiency and resource allocation",
    "dislike": "Being able to see the real movement on deals aka how has my pipeline changed from last week?",
    "problems solved": "Submitting an accurate number to my manager"
  },
  {
    "Review Date": "09/29/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I love that it connects with SalesForce. It is very easy to make custom changes on the fly. Implementation and training was very easy. I use it daily.",
    "dislike": "Fortunately, I have yet to experience any drawbacks.",
    "problems solved": "The main problem that Kluster is helping to solve is accurate forecasting. Kluster helps force us to use actual data and support our projections, then it presents it in a very useable layout."
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Very quick out of the box visualisations and analyses to help understand our business, allowed us to get to high quality analysis without extremely high investment either up front or ongoing.\nIn particular, Kluster handles comparisons across different time periods well, which is something we struggled to analyse easily within Salesforce.\nThe team are very responsive in helping to pull together different reports.\nUI is friendly, and relatively easy to use.",
    "dislike": "The ability to drill down in some of the reports isn't available, so it could be more user friendly in places.\nNot always fully self-serve for creating / changing certain reports.",
    "problems solved": "Kluster solves challenges around creating dashboards and reports that would be challenging to make and maintain within Salesforce. Kluster makes it easier to have visibility over our sales function."
  },
  {
    "Review Date": "02/29/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "What i like best about Kluster is my ability to forecast accurately.",
    "dislike": "Sometimes there is too much data (maybe thats a setup thing though)",
    "problems solved": "Kluster is solving my forecasting."
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Helps reduce risks and make better financial decisions that increase profit margins, cash flow, improve resource allocation, and create more opportunities for growth.",
    "dislike": "Too early to tell.\nSometimes feel it intuition can be improved on. It not always easy to reflect every business in one tool. So customisation could be better to reflect this.",
    "problems solved": "helps reduce risks and make better financial decisions that increase profit margins,, and create more opportunities for growth. As mentioned before, forecasting is by nature hard but this helps gather and rpesent data in one place."
  },
  {
    "Review Date": "03/08/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The insights functionality i belive is the most valuable aspect, especially when fueling 1:1 discussions between managers and sales reps. As an administator trying to build adoption of the tool, being able to quantify insights is a great way to drive accountability",
    "dislike": "Some of our reports can be quite bespoke and often fall outside of the pre exsisting reports provided on the platform (the Kluster team are very good at working around this!)\n\nIt would be good if we could create reports ourselves and a better connection to HubSpot would be great!",
    "problems solved": "Kluster is helping is delve deeper into our existing data set, which we were underusing before. Kluster makes sense of the noise and provides insights we likely would not have even thought to look for."
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Lots of data points equalling fat free answers about my pipline ad forecast. I like that it pulls directly from Salesforce to bring everything into one place.",
    "dislike": "Within the widget library it would be great to click into the boxes to see what data points you have - great way to recap history of activty",
    "problems solved": "Central place to have all my activity and sales targets in one place with a granular breakdown of the stage of each opp, what has closed and % of target against quarterly/annual targets"
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster helps me keep my pipeline revenue predictable, transparent & tidy. The UI is innovative, with drag and drop functionality, and has a roll-up mode to show me exactly where the opportunities are coming from.\n\nAccompanied with this are intelligent A.I. generated predictions and risk factors to keep me aware of every possibility and eventuality. Kluster is definitely a must-have for the modern SaaS org.",
    "dislike": "That I didn't have it sooner! Perhaps roll-up mode sometimes doesn't pull correctly, however I believe this can be due to SFDC indexing rather than the Kluster product.",
    "problems solved": "- Pipeline and revenue predictability is now extremely easy to see\n- Helps hold myself and our AEs accountable for accurate forecasting\n- Allows smart construction of realistic best case and commit."
  },
  {
    "Review Date": "09/26/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "As a new AE it makes it very easy to forecast and share with my manager. They had great trainings with a friendly staff. I raise my forecast weekly and we review together as a team multiple times per week to go through the top deals. It integrates well with Salesforce.",
    "dislike": "There is so much information, it might be nice to have more clarification and self resources to understand when to use each statistic.",
    "problems solved": "It makes it easy to raise forecast and learn more about my own statistics, where I am excelling and where I could be doing better."
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "While the out-of-the-box reporting from the platform is valuable, we have loved what we've been able to customize to match our specific SF instance and needs -- esp compared to the lack of flexibility offered by other tools. The Kluster CS + implementation team has been fantastic in executing our roadmap, and we're excited to see where we can go from here!",
    "dislike": "While we feel covered in this regard by our great CS partners at Kluster, the lack of direct admin capabilities to edit and configure the platform in a DIY fashion is sometimes frustrating.",
    "problems solved": "SaaS reporting, commercial analytics, opportunity / pipeline inspection, forecasting, tracking all parts of our sales process against targets, measuring recurring revenue by different cuts over time, etc."
  },
  {
    "Review Date": "09/26/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Forecasting, it is super for getting into the nitty gritty details and for someone in sales it gives a fairly solid overview over all the deals in the pipeline",
    "dislike": "UI - it's not the most beautiful system on the surface and could use a retouch",
    "problems solved": "Providing an overview over pipeline deals and showing where to put effort and priority."
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "Chief Growth Officer",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Ability to accuratley forecast and have visibility of working and stalled pipeline.\nTrack conversion rates, demo to win, pipeline win rates, average deal value and sales cycles.",
    "dislike": "There is nothing about Kluster that I dislike.",
    "problems solved": "Forecasting, pipeline health and conversion stats are always hard to get a handle on using just a CRM; it's also time-consuming to find if you can.\nUsing Kluster gives you easy and quick access to all the data you need, allowing you to make informed, data-driven decisions."
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "Regional Sales Manager",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The dashboarding was really well thought out from a salesperson's perspective. Navigation is also designed very efficiently and not 'busy' as you would see form other solutions.",
    "dislike": "Still trying to wrap my arms around Kluster Vision. I see it's potential but not yet finding it valuable. I think this is mainly du to the fact I have only been in my role for 4 months.",
    "problems solved": "Forecasting, summary of active deals, ability to see deals that are in 'trouble'"
  },
  {
    "Review Date": "10/03/2023",
    "Reviewer Role": "Account Manager",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I love that it estimates what pipeline I'll be getting before I get it.",
    "dislike": "Overall it works very well! There are some glitches going between monthly pipeline and quarterly pipeline, but that's really it.",
    "problems solved": "It gives me insight into what I can expect in my pipeline in the future."
  },
  {
    "Review Date": "10/17/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Easy to use and easy to see where my gaps are in forecasting and pipeline",
    "dislike": "A lot on info that I am sure I could use but not sure how to use properly",
    "problems solved": "Enablig to forecast better  on a weekly basis"
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "Senior Account Executive & Team Lead - US",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I had the pleasure to experience the tool both as a rep and as a sales manager, first it gave me all the transparency and data I needed to shift my focus into the relevant and now Kluster helps me manage my team forecast more effectively and have trust on that forecast when passing it to senior management. It helps me with one-to-one's and drives the conversation on the strategies and plans of attack on a much more clear way.",
    "dislike": "Right now there is nothing I dislike about it yet.",
    "problems solved": "Transparency on the data, unification of the data from CRM to a clear unique source of information and lastly unification of sales rep management"
  },
  {
    "Review Date": "03/08/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster makes it really easy to spot trends at the macro and micro levels while surfacing actionable insights to improve both outcomes and forecasting. We are only 3 months in but are already leveraging Kluster dashboards in 1:1s, pipeline reviews, and for BOD reporting.\n\nAlso, our CSM, Charlotte, goes above and beyond to ensure we're getting the most out of the tool. Kluster's Client Success team does a great job of sharing rev ops best practices, which have helped improve some of the ways we manage the team.",
    "dislike": "Purely from an aesthetic standpoint, the UI could use a bit of a refresh. Functionally, it is very easy to navigate, though.",
    "problems solved": "Pipeline management and forecasting. Kluster surfaces previously inaccessible data to enable us to make more data-driven decisions and have better insight into what's driving revenue. Additionally, it's \"Latest Headlines\" tab surfaces early alerts on the most pressing issues so that we can work on solutions before it's too late."
  },
  {
    "Review Date": "03/08/2023",
    "Reviewer Role": "Commercial Data analyst",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Being able to have reports within Kluster that are not possible in any of our other tooling (eg. Hubspot). The customer success team are probably the best thing so far with Kluster, they are super responsive and always looking for ways for us to achieve our asks from them.\n\nWe've also had some custom projects where we want to build reports in Kluster that didn't exist out of the box, and Kluster have been able to build these for us :)",
    "dislike": "Previously we had to ask Kluster to do minor admin things like remove inactive users etc which was a bit inconvenient, but they have recently updated Kluster so we have control of this :)\n\nWe've had some cases where specific lenses keep breaking - but these are custom lenses we had created so the logic isn't standard so teething problems are expected",
    "problems solved": "Being able to easily get real time metrics over things like sales velocity etc without any manual calculations or work from our team. We also use Kluster for reviewing sales people's activity and deciding targets and forecasts for accurate estimations.\n\nWe also use Kluster reports in company wide comms and are a good way to round up the week with reports like 'pipeline change'"
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Having Kluster to provide valuable insights and data is crucial to my success as an Account Executive. I love the ease of use of the Kluster platform and all of the features and functionality.",
    "dislike": "There isn't anything I particularly dislike about Kluster.",
    "problems solved": "Kluster is providing the data and insights needed as a sales person to shorten the sales cycle and win deals effectively. I can definitely see an improvement in my sales process with Kluster."
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Accurate forecasting - One of the key strengths of Kluster is its ability to generate accurate forecasts. The software utilizes advanced algorithms and data analytics techniques to analyze historical data and generate future predictions. During my testing, I was impressed by the accuracy of the forecasts, which helped us make well-informed decisions and optimize our planning processes.\n\nCustomizable - Kluster offers a range of customizable features that cater to diverse forecasting needs. The software allows users to adjust parameters, input different variables, and apply specific models, enabling us to tailor our forecasts to match our unique requirements. This flexibility was particularly valuable in aligning the forecasts with our business objectives.\n\nGreat support.",
    "dislike": "Learning Curve: The initial learning curve of Kluster might be a bit steep for users who are not familiar with forecasting software. Some additional guidance or tutorials could be beneficial to help new users get up to speed more quickly.",
    "problems solved": "As an Account Executive, Kluster has been a game-changer in solving critical problems and significantly benefiting me in my role. One of the key advantages it offers is enhanced forecasting accuracy. Kluster's advanced algorithms and robust data analytics capabilities provide me with highly accurate forecasts. This accuracy allows me to make more informed decisions, set realistic targets, and develop effective strategies to drive revenue growth. With Kluster, I can confidently rely on the forecasts generated, enabling me to better plan and allocate resources, identify potential risks or opportunities, and ultimately optimize sales performance."
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster is an absolute dynamo when it comes to pipeline management and forecasting! Its innovative AI capabilities coupled with the intuitive drag and drop functionality turn data interaction into a joy. What's more, it instills a culture of discipline and excellence within our sales team, encouraging top-notch data hygiene in Salesforce that significantly enhances our overall business operations.",
    "dislike": "While Kluster is already a standout tool for small to medium businesses, it's geared up to excel in the enterprise realm. Our complex quarterly sales cycle calls for a slightly different approach. I am genuinely excited about Kluster's commitment to continuous improvement and their dedication to adapt their platform to address the unique dynamics of large enterprise dealflows.",
    "problems solved": "Kluster is a champion, taking on key challenges like revenue forecasting and pipeline visibility with remarkable efficacy. It presents us with a real-time, crystal clear snapshot of our sales pipeline, empowering us to strategically allocate resources with absolute confidence. It's not just about forecasting; Kluster provides predictability, allowing us to plan with optimism and hit our revenue targets with surefire certainty"
  },
  {
    "Review Date": "03/06/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster was one of the few platforms on the market willing to work with the complexities and individuality of our business. No request or question for the customer success team is too small. The team took their time to understand our business, did not rush our implementation, and continued to make suggestions for better use of the platform.",
    "dislike": "I wish there were more customization abilities for administrators; all updates to the platform need to go through their team. Some security features required of internal IT teams (SSO, MFA, etc.) are not yet possible.",
    "problems solved": "With a business model that varies from tradition SAAS companies, we used Kluster for a more customized forecasting solution."
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I have a clear view of my current pipe and the associated MRR. Also I know clearly which deals are more likely to be close won.",
    "dislike": "Maybe I would say that the UX is not the best that I've seen. A better integration with HubSpot would be appreciated",
    "problems solved": "Clear view of the pipe.\nCommitment and best case deals\n\nWe are able to anticipate the futur MRR and as a sales commissions I will get."
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "Sales Executive",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "It is a great way to get more insight into your deals and pipeline to better understand where opportunities are in their cycle. it is also helpful to be able to better forecast properly.",
    "dislike": "It can be a lot of data. Taking things slowly and using each section bit by bit would be my recommendation because if you are not used to having all of these data points it can be overwhelming to try to understand and use properly at first.",
    "problems solved": "Kluster is solving forecasting issues and helping the sales team better forecast deals more appropriately so leadership understands the pipeline and deals that are real and coming into the funnel."
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I like that I can use Kluster to have a better and more accurate understanding of the forecast of the sales team I am working with. Custom reports/widgets. Easy to understand.",
    "dislike": "I think Kluster could be better with dropdown and sub-sections. I feel sometimes some sub-sections or dropdowns could help you to verticalize the organization. Right now it looks a bit flat.",
    "problems solved": "I am using Kluster to better understand the sales trends, using this for the 1:1 with each sales leaders but also to communicate insight and trends to Senior Stakeholders. It is easier than building your own reports. Simply looking there and better understanding trends by playing with different variables."
  },
  {
    "Review Date": "05/23/2023",
    "Reviewer Role": "Senior Sales Executive",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Makes forecasting much easier. Great to see how Kluster reviews deal health. It's allowing us to have full transparency on deals as a team.",
    "dislike": "It's taken a while to set up but we are now seeing the benefits of that",
    "problems solved": "We used to have a hard time tracking deal health and seeing what is progressing forward. We are now seeing more stale deals leaving pipeline and an active focus on healthy deals."
  },
  {
    "Review Date": "03/08/2023",
    "Reviewer Role": "BD and Partnership Ops",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "From a revops perspective, Kluster is a very nice tool to help me and my team forecast. This gives us a clear indicator of where we can expect to land in terms of new revenue until the end of the quarter. It also helps reps understand where they are in terms of pipeline and enables data-driven decision-making.",
    "dislike": "the UI can sometimes feel a bit chunky, but generally really like Kluster",
    "problems solved": "Kluster helps me understand my pipeline and helps me forecast the amount of expected sales for the quarter. So while mid-quarter I'd only have an idea of what I expect to close, kluster helps me create reliable data-backed forecasts"
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Easy to visualize in real-time, drill down into the detail around a key business metric, see historical data and trending information. Easy to run a sales and marketing meeting from thanks to the ease of navigating through key business metrics.",
    "dislike": "None really. Maybe some more marketing centric measures and a link from Kluster to Hubspot dashboards and back but not so much a dislike as something that would be useful. Kluster could well do that but our instance may not have been configured that way.",
    "problems solved": "Real time sales analytics\nPipeline health\nRevenue operations\nAverage deal size, win rate and pipeline insights\nForecast calls\nSales performance reviews\nExec readouts"
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster provides all of the data and insights you need to forecast effectively and gives you a view of how your sales team is performing over time. Their support is also first class and always on hand to help you get access to the data you need.",
    "dislike": "Their integration with HubSpot could be improved.",
    "problems solved": "Helping us forecast accurately and provide insight into how we're performing as a sales team."
  },
  {
    "Review Date": "09/26/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I really like the hubspot integration as I do not need to do double work in different tools. Also it gives me and my manager clarity on my pipeline and the health of each deal.",
    "dislike": "Before, an error was showing when trying to submit my forecast but it is no longer showing.",
    "problems solved": "- Just using one tool for forecasting with direct integration with Hubspot.\n- Gives us very usefull insights for each deal showing a healthscore and giving advice on them."
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The ability to slice and dice the data, along with the ability to see immediate historical trends enables our team to see the insights we need, when we need them.",
    "dislike": "Nothing stands out that that I dislike, but I wish it was integrated more into the tools we already use to give visibility to more individual contributors of how they are doing compared to our benchmark.",
    "problems solved": "Kluster is surfacing data on our sales performance that we previously have not been able to visualize or see in a way that is actionable. The instant trends and the ability to drill down into specific people is extremely helpful."
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "Renewals Manager",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "It eliminates the need for other documents and allows my manager to quickly see what I've forecasted and why.",
    "dislike": "Sometimes I wonder if this could be done in our CRM instead and eliminating another tool, but the CRM likely isn't as user friendly.",
    "problems solved": "Kluster is making it easier to understand my pipeline and communicate that information with my manager and leadership is a fairly easy and streamlined way."
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Super useful in giving me visibility on what could close in my pipeline reviews.\n\nGives me a great indication of what I'm expected to close, prompting me to manage my pipeline better.\n\nThe support so far has been amazing and super helpful/ timely whenever I have any questions.",
    "dislike": "I do not have anything to report at this stage!",
    "problems solved": "Visibility on pipeline and probability of hitting my target."
  },
  {
    "Review Date": "03/30/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Overall positive things to say about Kluster.  We've run into several issues as our business is small but complicated, and they've leaned in and helped us correct them.  The team has been responsive and provided numerous training opportunities.",
    "dislike": "It's a solid product overall, but it does take a fair amount of customization.  We've had to go back to them numerous time to have currency issues fixed, etc...",
    "problems solved": "Helps see holistic forecast and map out key KPI's such as days to close, pipeline loss, stallpoints, etc...  The visualization and waterfall charts are really cool"
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "Associate",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster lifts the hood to reveal the true nature of each reps pipeline, rather than the face value metrics. This means forecasting is more reliable, and coaching conversations are more productive.",
    "dislike": "The revenue analytics and insights are great, it would be great to be able to drill into the activity around each opportunity to avoid having to jump between systems to know whats going on with a deal.",
    "problems solved": "Kluster gives us the ability to see further ahead with our revenue function. Building a picture of what the months ahead look like it means forecasting is more accurate and decision making is more proactive."
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "Revenue Operations Manager - Enterprise Sales",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster's visibility is fantastic, but the very best part of Kluster is the customer support team. They've been extremely helpful, responsive and pleasant.  The platform is highly customizable and quite user-friendly.",
    "dislike": "I have only been using the platform for a few weeks and haven't experienced any shortcomings yet. It does take some investment of time to utilize the platform fully. I'm sure there are features that I haven't had an opportunity to explore yet.",
    "problems solved": "Kluster is driving pipeline visibility and allowing us to increase forecasting accuracy. It has also allowed us to identify areas where deals stall, which we previously hadn't had."
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Cluster is easily the most intuitive tool I've worked with to manage my team's business. The visualizations and workflows are top-notch. You don't need a Phd in data science to use Kluster like \"other\" CRM/reporting tools out there.",
    "dislike": "I haven't seen any yet. Maybe I've missed this somewhere, but would be nice to see some loss/competition reports so that we can better understand where/how we can be doing better.",
    "problems solved": "We have much quicker insight into the overall health of our business, and it speeds up internal reporting...removing much of the manual processes we use to rely on with spreadsheets."
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "Account Manager",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Hello, Account Manager here, we use Kluster for New Business / Farming forecasting, and it makes it incredibly easy to do so. I like the notes feature for opportunities and insights from past & existing deals, which allow you to get a good overview and plan action ahead based on trends of what worked.",
    "dislike": "I don't find anything that I dislike about Kluster.",
    "problems solved": "Issues with which deals are staggering in the pipe, and then what action plan I can make based on past trends. Noting everything is salesy detail that is great for discussing stuff 1-to-1 with your manager."
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Kluster allows us to match our revenue goals with current pipeline stages and understand what's keeping us from increasing our pnl. All of this under one roof.",
    "dislike": "Need to keep HubSpot up to date in order to have up-to-date data.",
    "problems solved": "In a tough quarter, Kluster allows us to analyze what we need to work on to increase revenue for next quarter."
  },
  {
    "Review Date": "03/08/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I think that the most powerful aspect of Kluster is that it allows you to gain a full understanding of your pipeline and forecasting, whilst offering an objective and unbiased look at the statistics and reality of it.",
    "dislike": "I do have a bit of concern as to how effective the AI would be. Until now we have not had enough data put through the system, and we have quite a unique use case. Perhaps this makes it less effective.",
    "problems solved": "We were struggling to get a realistic idea of our pipeline and forecasting had been somewhat inconsistent and inaccurate."
  },
  {
    "Review Date": "05/24/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I really like Kluster's dashboard to break out different sales pipeline so I have visibility on the sales motions",
    "dislike": "Sometime the information is not cleanly displayed but this is not a huge issue for me",
    "problems solved": "Kluster helps me to have a clear view of the bookings information so I can run cohort analytics and churn analysis on them"
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "Sales Executive, US",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The ability to forecast my pipeline accurately and gain insight into what I need to go after quota for a particular month or quarter! More intuitive than using the CRM to accomplish the same goals.",
    "dislike": "I have not found anything to dislike at this point, but I'll be sure to update my review should I run into any issues.",
    "problems solved": "I need to accurately forecast my pipeline so my team can effectively go after our quotas. The added ability to analyze each won/lost deal is super valuable for helping to add more value to my clients."
  },
  {
    "Review Date": "05/23/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Kluster provides insights quickly that would typically be very difficult to calculate. It allows us to forecast in real time and make decisions quickly. Not just as a team but also as individuals.",
    "dislike": "The initial set-up period was quite clunky. It took a while and lots of attempts to get everything syncing correctly. But once this initial part was done it has been great.",
    "problems solved": "Giving us better insights into our pipeline health and overall performance as a business. We can track performance against targets and see where we need to improve as a team."
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I am a novice user, so having a Kluster partner available to guide us and help us leverage the tool has been instrumental.",
    "dislike": "No downsides. If anything, I need to take the time to learn more and make better use of the features.",
    "problems solved": "Getting the reports I need quickly and easy to use in executive meetings."
  },
  {
    "Review Date": "03/08/2023",
    "Reviewer Role": "Member",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "If you've ever had to fill out a spreadsheet for forecasting, you will know how painful that process is. Kluster simplifies forecasting and allows it to be completed in seconds.",
    "dislike": "Nothing, so far everything's impressed me. If it saves me time, allows me to drag and drop oppurtunities into commits and provides insight into deal stages, I'm happy.",
    "problems solved": "Kluster makes the business critical task of forecasting very very simple, allowing you to complete it under a minute, and provides clever insight into your sales analytics as well as the teams."
  },
  {
    "Review Date": "05/23/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Enterprise(> 1000 emp.)",
    "like": "Kluster arms me with the data I need to understand what I need to focus my efforts on to improve. Since using Kluster I've been laser-focused on where my gaps are, without relying on guesswork. I can understand my pipeline and forecast accurately.",
    "dislike": "There's nothing I don't like about Kluster!",
    "problems solved": "Making sense of my current opportunities by using data from past deals, which allows me to forecast. Understanding areas and holes in my pipeline stages, so I know which areas of the sales cycle to focus levelling up on."
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster creates dashboards and views that a far easier to navigate than Salesforce. Beyond that, the analytics are beneficial in terms of staging opportunities and remaining organized with my pipeline overall.",
    "dislike": "I can't really say that I have any dislikes, but I could certainly utilize the tool more frequently as I am sure I am not utilizing it to its fullest potential.",
    "problems solved": "Forecasting to management is the main problem Kluster is solving. It's giving us a place to provide updates and it's commonly used during internal planning calls."
  },
  {
    "Review Date": "09/26/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Dashboard view and analytics to ensure healthy pipeline.",
    "dislike": "Personally do not have anything negative to say.",
    "problems solved": "Understanding my pipeline and accurately forecasting to EL."
  },
  {
    "Review Date": "03/08/2023",
    "Reviewer Role": "VP of Sales",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "It takes away the leg work of prepping for a pipeline review and allows us to focus on the important topics.\n\nAccurate forecasting on where an AE will finish for the month/ quarter/ year which also enables us to identify where the top of the funnel needs to be for them to hit their required target.\n\nIntegration was seamless.\n\nOutside of the product, the team is excellent. Great people who offer a lot.",
    "dislike": "It takes some time to get used to the platform and requires a few training sessions to get used to it.",
    "problems solved": "Kluster takes the guesswork out of our new business funnel. We can hold departments and individuals accountable with it, while providing accurate forecasting to other departments in the business."
  },
  {
    "Review Date": "05/26/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "We can easily see key revenue insights on one pane of glass in an easily digestible format. Charts and dashboards are super helpful",
    "dislike": "Some of the navigation from different periods can be frustrating, but not a major point",
    "problems solved": "Sales forecasting and single source of truth data"
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Very easy to update forecasts. I also like the pipeline and deal health view.",
    "dislike": "We are pretty early in our adoption of Kluster, but I haven't encountered any issues. It looks like we have some duplicate dashboards in our instance, which confused me initially, but that may be just how we set it up.",
    "problems solved": "Kluster streamlines our pipeline reviews. It's also a good tool for getting insight into the health of your pipeline. Helps surface certain red flags to keep an eye out for."
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Easy, drag-and-drop functionality. Clean UI. Takes under a minute to submit a forecast.",
    "dislike": "Sometimes the integration between Kluster and our CRM is not always refreshed. This is my main critique.",
    "problems solved": "Allows me a clean view of current quarter's deals and easily submit them in a forecast."
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "Account Executive II",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like that it gives me the ability to see past data and accurately predict what my professional commit will be",
    "dislike": "It gives you insights on past closed/won, closed/lost, and pipeline deals that allow you to forecast. Predicting trends based on historical data is very helpful",
    "problems solved": "Overall team view. I like seeing my own analytics but when my manager is looking at everyone's call in a zoom meeting she can't click into each rep and see why we called what we called"
  },
  {
    "Review Date": "03/08/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Being able to segment views by week/month/quarter/etc makes it easier to keep track of pipeline, plan where to focus, and give a user-friendly view of where my opportunities are. Also allows the team to forecast to senior management much more accurately and boosts accountability.",
    "dislike": "There's sometimes a delay in reflecting Salesforce data into Kluster, though, to be honest, I'm unsure if this is a Salesforce issue or a Kluster one. Aside from this, no complaints so far!",
    "problems solved": "- Pipeline/opportunity forecasting; tracking key measurables and revenue trends\n- Increases accountability (no one like submitting an empty forecast!)\n- Gives senior management, and the sales teams in general, a more streamlined and user-friendly way to plan, analyse, and execute sales-funnel plans"
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "Senior Manager Sales Operations",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster brings additional valuable insights to Salesforce data, enabling sales managers, the management team, RevOps team, etc to access the key metrics and leading indicators. The forecasting feature, as well as Kluster Vision are absolutely great tools.",
    "dislike": "It would be great if I could create my own reports and dashboards, update filters as needed instead of having to rely always on the support team.",
    "problems solved": "Kluster is helping us identify gaps and trends, easily, so that corrective actions can be taken timely."
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The insights for each opportunity gives me the clarity to cut through storytime and ensure that the salesperson is not victim of their own wishful thinking.",
    "dislike": "The process of writing back information for rich text created some formatting issues.",
    "problems solved": "Insights into each deal."
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I like that my manager no longer messages me about the state of each deal. The context I'm able to provide in Kluster around each deal is easy to mark with emojis and notes.",
    "dislike": "It is slow to reflect changes in the close date between SFDC and Kluster. I think this might be a specific problem with our set up.",
    "problems solved": "My manager no longer sends me fire drills asking about deals. The context is all in the forecast report."
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "Board Member and Part Owner",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "It helps with forecasting and realizing at what stages my deals get stuck in the most often. This helps me to take a  better approach and put my focus on progressing deals.",
    "dislike": "So far i like everything Kluster shows me. I wish they would tell you a little bit more about what the data means and how it's calculated.",
    "problems solved": "It's given our organization much more accurate forecasting and tells us how we can get better based on the data"
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Very intuitive and customisable dashboard which makes it super easy to digest and use data",
    "dislike": "Sometimes it can take a while to configure it in a way that suits you best but that's only because I have never been shown how to use it properly and there's a lot available",
    "problems solved": "Salesforce data can be a bit inaccessible and difficult to extract and analyse at times whereas kluster clearly and cleanly displays it ready to use in presentations etc"
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "Account Executive",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "You get great reports and data out of Kluster to give that enable actionable results for the entire team. Management receives the insights they need and the sales team gets answers to complicated sales ops questions and the data to support reps through the process.",
    "dislike": "With all of these tools, it takes a bit of time to get used to the UI and setting up the dashboards takes a bit of trial and error. No major roadblocks, it's a great tool.",
    "problems solved": "This is solving our lack of communication between management and individual sales reps enabling us to view actionable data that helps us do our job and saves us time when we have internal meetings."
  },
  {
    "Review Date": "05/23/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "- news feed - highlighted anomalies and potential risk without need of scrolling through all the KPIs\n- ability to submit forecasts for Team & Reps\n- kluster insights\n- ability to compare to same time in previous periods\n- custom reports\n- responsive Customer Success",
    "dislike": "- one size doesn't fit it all and need a lot of customisation which not always goes smoothly\n- no data quality control when rolling out fix or new custom update\n- bugs and same metrics with different values in different places. However Customer Success always tries to rectify these\n- report desciptions sometimes are misleading",
    "problems solved": "- pipeline performance/forecasting\n- tracks KPIs and trends\n- flaging potential risks"
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster has been super helpful for our team. It's a lot easier to keep track of our forecasts and make sure we stay on track quarter to quarter. The dashboard is intuitive and very easy to use. It also integrates easily with our CRM HubSpot.",
    "dislike": "There is not much to dislike about Kluster. Their team has been super attentive with getting our team up to speed with the product and have given us several training sessions.",
    "problems solved": "We did not have an efficient way for sales people to forecast but also stick to their forecasts and make sure they are accurate. It's been a great tool for sales people at our company to take control."
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "Partnerships Manager",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "it shows the visibility of every stage in our funnel, makes what would take me an hour in CRM possible in minutes. Can more easily then adjust my strategy as needed.",
    "dislike": "The only issue so far was with my log in initially, but fixed rapidly.",
    "problems solved": "Sometimes we lacked visibility and definitive answers on where to focus and why, but the clear visibility for everyone means we can see be much more accurate in our strategy."
  },
  {
    "Review Date": "03/06/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster is a brilliant tool that allows me as a team lead to drive better pipeline management, accurate forecasting and cleaning up stalled deals. There's a lot of other functionalities but those are the main challenges which Kluster helps mitigate.",
    "dislike": "Sometimes I wish that the snapshots could be edited a bit more, however the CSM and Data-department is extremely helpful so it is very rare that I'm not offered a solution that is satisfactory.",
    "problems solved": "Kluster is a valuable tool that assists us in our day-to-day operations and our overall analysis of the sales force's performance and areas of improvement. The accesibility also gives the sales rep's a great overview of their own progress."
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster is a data wizard. It dishes out the analytics and reports you need to make informed decisions; helping my rose coloured glasses to reflect the true colours of the opportunity.",
    "dislike": "Rolling out to the partial team led to a disconnect between those who had vs. those who didn't. That phased approach wasted a bit of time our side.",
    "problems solved": "Pipeline visualisation; anlysising team performance against best practice; accurate reporting for the board"
  },
  {
    "Review Date": "03/08/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Fantastic tool for leveraging insights and performance metrics to forecast accurately. Love the ability to track sales velocity, highlights and pipeline health.",
    "dislike": "It can be a little daunting at first to learn, but the onboarding process has been super detailed and the team very helpful",
    "problems solved": "Forecasting has traditionally been closer to educated guesses from conversations with clients in the pipeline, but now we have accurate and detailed historical data to leverage"
  },
  {
    "Review Date": "05/23/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "We used to submit our forecasts through Gong which was time consuming and manual. Kluster means we can sync with Salesforce and click submit and its done!",
    "dislike": "Nothing so far - hugely beneficial.\n\nWe had great training from the team and they are on hand if we need help.",
    "problems solved": "saves time submitting sales forecast for the month and the quarter, everything is completely automated with Salesforce and my managers love it."
  },
  {
    "Review Date": "10/12/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Being able to see the top-level info on my pipeline such as Deal Insights, Days in Stage & Alerts",
    "dislike": "Can be a bit buggy at times but generally works fine.",
    "problems solved": "A view of my pipeline, dashboard and KPIs"
  },
  {
    "Review Date": "05/23/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "It's super easy to learn and use\n\nThe reports are iunsightful and help you to manage your pipeline effectively, using live data\n\nGives you actionable insights that help you to succeed",
    "dislike": "You need to keep logging in quite often - I'm sure it's for security but if you leave the page it makes you sign in again",
    "problems solved": "Helping me to understand which deals need my time and attention the most"
  },
  {
    "Review Date": "03/06/2023",
    "Reviewer Role": "Senior E-commerce Sales Consultant",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "User experience and data. It is easy to use, to understand and it brings valuable data.",
    "dislike": "Not sure if it is Kluster or Hubspot that sometimes not all the filters can be used. But it is not a big deal.",
    "problems solved": "Getting an overview of where I am, what do I have to do to get my target, how many meetings I need, what my sales cycle and sales velocity are"
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "Founder & CEO",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Very comprehensive set of analysis features and fairly intuitive user experience.I also like some of of the forecating features which are predictive in nature based on historical performance.",
    "dislike": "It can take some time to set up new modules, dashboards, and reports but once they are set up the platform works very effectively.",
    "problems solved": "Kluster helps us have our finger on the pulse of our ongoing business performance and revenue forecasting"
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "That you have all your data right in front of you. From open pipeline to stalled pipeline - it's easy to navigate.",
    "dislike": "That you can only submit your monthly forecast the one time, and then it is locked in. Some things change early in the month that needs to be rearranged",
    "problems solved": "Helps with stalling pipeline and creating a game plan of who I need to be in contact with."
  },
  {
    "Review Date": "05/23/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Like the fact that you're very easily able to see where you are, in comparison to your team - the UX also is really good, its very easy to see & navigate through the platform",
    "dislike": "I haven't been using it very long yet, however ther hasn't been anything I dislike during my usage so far.",
    "problems solved": "Having a clear view on pipeline and actions, steps or progress of deals."
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I like that you are able to see a quick snapshot view of your pipeline and what you have pending to close.",
    "dislike": "The sync time between Kluster and SFDC had some opportunities for improvement. Being able to change dates right in the forecast view would be nice to have vs having to go into every position individually to update",
    "problems solved": "Solving for or forecasting needs within the organization."
  },
  {
    "Review Date": "05/04/2023",
    "Reviewer Role": "Director of Marketing Operations",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Customizable insights that actually tell a story and draw  correlation between enablement and performance. From the top of the funnel to individual rep performance, you can drill into data points and not be killed by analysis paralysis.",
    "dislike": "Nothing really. Team listened to our enhancement requests and rolled out missing functionality.",
    "problems solved": "Marketing and Sales alignment\nFunnel management\nRep performance management\nPipeline management"
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "So many ways to understand and manage your pipeline, forecasts, deal flow and give accurate bookings projections. Never-ending insight reports driving data-driven decisions. Understand what's really working  and live without the need for massive spreadsheets manually updated. People are great as well, top-class team",
    "dislike": "Small company and so we know they're working with limited capacity, means we know they're working on the things that matter. Date pickers in some of the reports are a little clunky and would benefit from a refresh",
    "problems solved": "Accurate forecasting, pipeline flow, pipeline tracking, post-quarter analytics, board call prep and GTM strategy planning"
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Having visibility over my pipeline and where I am tracking against my target. When I have one-to-ones with my manager, I am able to provide accurate insight on my current performance.",
    "dislike": "There aren't downsided to Kluster however as an SDR I will make more use of Kluster in the future.",
    "problems solved": "Getting visibility of my pipeline where i didnt before."
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Very clear and easy to use page for providing overview on deals and pipeline",
    "dislike": "To be honest I don't think there are many down sides, except for when submitting a forecast it would be nice if you could revert it back",
    "problems solved": "I use Kluster to forecast close dates and amount for deals, helping to organise my accounts and time"
  },
  {
    "Review Date": "05/23/2023",
    "Reviewer Role": "Sales Development Executive",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster is clear and easy to use. It gives me facts and figures based on history and allows me to work smarter with regards to my pipeline.",
    "dislike": "Struggling to find anything I do not like currently about Kluster.",
    "problems solved": "Kluster alows me to see my own pipeline and the pipeline of the team. It allows me to forecast better."
  },
  {
    "Review Date": "03/03/2023",
    "Reviewer Role": "Executive Member",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "We use custom objects in Salesforce, and Kluster was one of the only platforms on the market that I was confident would work for our use case. The Kluster team is excellent to work with and truly understands our business.",
    "dislike": "Because we are using a more bespoke build of the platform, changes take some time.",
    "problems solved": "We leverage Kluster for forecasting"
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "Director of Sales, SMB",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The ability to forecast ARR for our COO and CFO was highly accurate and easy to use. We've tried many tools before, but this seems to have all the bells and whistles we need, yet keeping things simple and engaging.",
    "dislike": "Initially learning was a little tricky for me with too much data or can be overwhelming, but once I went through the online course... Honestly, I got the gist of it, and it was like any other program.",
    "problems solved": "Forcast quarterly targets for our VP and have the accurate date to have a weekly intelligent conversation."
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "Vice President of Global Channels",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster provides amazing insights. I use it to monitor pipeline and our business. I like the tool better than salesforce.",
    "dislike": "I work in partnerships so seeing sell to and sell through is tricky. For channels, there are many motions and to capture both, this list would need to be constantly updated.",
    "problems solved": "Having more visibility to our business."
  },
  {
    "Review Date": "05/23/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "You can have all top line figures you need to manage your business. You can look at pipeline retrospectively which is impossible in a CRM.",
    "dislike": "You can't change the axis on the dashboards or vizzes as flexibly as I'd like. The UI is na little clunky.",
    "problems solved": "Board reporting saving time. Salaes analytics helping coach my team."
  },
  {
    "Review Date": "05/23/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "its real-time updates, intuitive interface, comprehensive analytics, and collaborative workflow management, which contribute to improved revenue generation and target achievement.",
    "dislike": "Nothing really. Sometimes it takes a few seconds to sync with HS. But it is not a problem",
    "problems solved": "Kluster solves revenue management challenges, boosting sales efficiency and collaboration, leading to increased revenue and better business outcomes."
  },
  {
    "Review Date": "05/23/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Enterprise(> 1000 emp.)",
    "like": "Understanding where in the sales funnel I need to change in order to improve results",
    "dislike": "We can't make the most out of Kluster due to incomplete Salesforce data",
    "problems solved": "How to speed up my sales cycle, how likely I am to win deals, who to cold call, how to improve specific areas of my sales cycle, etc."
  },
  {
    "Review Date": "05/23/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The dynamic overview of your KPIs and pipeline progress makes a difference in the day-to-day activities and dramatically supports the quality of forecasts to management.",
    "dislike": "There are no particular 'negatives' about the tool so far.",
    "problems solved": "The tool softens the difficulties of handling high volumes of deals, keeping track of progress, and giving accurate forecasts to management."
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "Commercial Account Executive",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Allows me to visualise my pipeline and communicate it effectively to revenue managers. Easy enough to use and I can easily see which parts of my pipeline need the most attention.",
    "dislike": "Sometimes can be slow to pull updated contract values from salesfor e.",
    "problems solved": "Allows me to clearly visualise pipeline and priotise in order of priority."
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Pipeline and forecasting information including age of deals, days in stage, and what good looks like when I win and when I lose",
    "dislike": "It's not always easy to know where to find reports. Perhaps it's just a matter of more training",
    "problems solved": "It's helping me to optimize my sales process and clean up my pipeline"
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster has worked very well for our sales team, where we previously haven't had much luck with other forecasting tools. It's straightforward, user-friendly and took very little time to get ramped on how to use the tool.",
    "dislike": "Have been using Kluster for about 6 weeks, and no complaints so far!",
    "problems solved": "Kluster is solving our forecasting ability on a weekly, monthly and quarterly scale. Previously we were relying on spreadsheets, which took a lot of manual work with no automation. Kluster takes the human error our of the equation."
  },
  {
    "Review Date": "08/17/2022",
    "Reviewer Role": "Global Director, Revenue Operations",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Great, responsive team with a genuine interest in delivering value to customers.\nAn internal team with strong experience in SaaS sales which means you get a wealth of reporting out of the box which tick many of the boxes for sales performance analytics which you can't get out of Salesforce and would take hours to build in PowerBI.\nSpecifically deals with Salesforce reporting limitations around (a) Performance vs target (b) Intel on what might happen in the future based on historical trends.\nPuts actionable insights in the hands of reps on both near-term forecast (what can I do to increase likelihood of hitting target this month?) as well as long term pipeline (what do I need to do now in order to ensure I hit target next quarter?).\nBuilds rep and leader accountability via intricate forecasting module.",
    "dislike": "Understand that there are some great roadmap items which will put configuration and administration more so in the hands of the customer.  In the meantime, Kluster offer very responsive customer success / implementation resource, so this doesn't represent too much of an inconvenience.",
    "problems solved": "See above."
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "Vice President, Marketing and Communications",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I love the visual representation of how prospects move through the funnel.  Kluster gives us more insight than we ever had before.  From a Marketing standpoint, it allows us to have more informed conversations with our Sales team.",
    "dislike": "No real dislikes.  Some initial learning curves in optimizing our platform use, but that is mostly due to its robust capabilities.",
    "problems solved": "Broader visibility into our sales funnel.  It makes it easier to project if we are tracking toward hitting or missing our targets and helps us pinpoint general trends."
  },
  {
    "Review Date": "03/08/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Visibility into deals and what stage they are in.",
    "dislike": "When trying to select weather you would like to edit for the quarter or month that drop down needs some work.",
    "problems solved": "It keeps my deals organized. But my favortire part is having those numbers live somehwere other then SFDC"
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Easy to use and forecast. Integration with salesforce makes updates simple.",
    "dislike": "Slight learning curve at the beginning, but nothing too bad",
    "problems solved": "Weekly forecasting is made easy with Kluster\nDeal updates is simplfied with Salesforce integration, using less time in administration tasks to focus on more important tasks."
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Easy to use. I like the main dashboard that shows all the info I need on one screen.",
    "dislike": "Maybe I just haven't used it enough, but I would like to be able to see my team's metrics compared to mine.",
    "problems solved": "It's helping me understand my sales metrics."
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "We use Kluster multiple times a week while forecasting our months/quarters. Kluster makes it easy to see how we are tracking and how small improvements to certain metrics will lead to a significant impact on key results.",
    "dislike": "Not much to dislike on it. Took time to understand a couple metrics but with an onboarding training that was ironed out easily.",
    "problems solved": "We use it to forecast our pipelines and it has made it easy to share across levels what our expectations are for month/quarter."
  },
  {
    "Review Date": "11/21/2022",
    "Reviewer Role": "VP Global Sales",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster is a great tool. The Kluster team have worked hard to tailor the solution to our needs and it's invaluable when looking at team performance, forecasting and analysing trends.",
    "dislike": "As with all tools, there are reports that need tweaking and iterating on but this is expected. The main thing is that the Kluster team are very hands-on in supporting these fixes quickly.",
    "problems solved": "Evaluating team performance, forecasting and analysing trends. We used ti use SFDC for the reports we are using in Kluster, but the granularity and alternative ways of looking at the same data is invaluable."
  },
  {
    "Review Date": "03/08/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster makes it that I have complete visibility into my pipeline. An an IC it saved me hours a week on forecasting and allows me to spot risk in my pipeline early",
    "dislike": "Nothing to dislike at the moment - it's clear and easy to use",
    "problems solved": "It's allowing me to more accurately track and report on pipeline. It's allowed me to better report to the business and avoid awkward conversations I've had in the past when the numbers have been completely off!"
  },
  {
    "Review Date": "05/23/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "It gives you an easy overview of painpoints and keeps track of old deals to drive",
    "dislike": "Could not really see downsides, as it does what you expect",
    "problems solved": "Keeping track of old deals and keep focus on the right things"
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "Sales Rep",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster allows me to forecast my goals. This helps me stay on track. It allows me to organize my targets and current deals",
    "dislike": "Something I would like is customization of dashboard",
    "problems solved": "It is solving the quota goals"
  },
  {
    "Review Date": "09/07/2024",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Easy access to info you need! Pull up Kluster in management meetings.",
    "dislike": "Could do with more reports as well as comparing with old deals",
    "problems solved": "Usually have ti use multiple spreadsheets to track closed lost and deal progress"
  },
  {
    "Review Date": "03/10/2023",
    "Reviewer Role": "Sales Operations Manager",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The Kluster insights are really helpful",
    "dislike": "to save time in understanding how the pipeline changes.\nKluster overall has a great ease of use and being able to have a bespoke dashboard.",
    "problems solved": "Saving a lot of time and giving clarity. I can see easier where changes have been made and visually show reps when an Opportunity should be removed from the pipeline based on insights.\nAlso looking into conversions throughout the sales cycle"
  },
  {
    "Review Date": "03/08/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "It's very easy to dip in and adjust your forecasts to get an idea of what input would be required for different scenarios. This means I don't have to spend nearly as much time in spreadsheets or even worse Salesforce reports.",
    "dislike": "Nothing that jumps out immediately. As with all Saas tools there is room for improvement but there isn't one glaring area I get frustrated with.",
    "problems solved": "Great visibility into our pipeline and forecasting."
  },
  {
    "Review Date": "05/23/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Allows me to accuratley forcast. User friendly and good visually. Good Predictions.",
    "dislike": "Can sometimes be a little difficult to use with integrations.",
    "problems solved": "Allows me to accurtatley forcast to my manager in a timely fashion."
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "Vice President, Enterprise Sales",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "look of dashboards, everything is intuitive",
    "dislike": "Hard to drill down into deal specifics sometimes",
    "problems solved": "How to decrease our mid funnel timeframe from it's current number of days in stage, to half that"
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "Senior Commercial Account Executive",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "makes submitting my forecasting really easy but also simple.",
    "dislike": "so far there isnt anything i dont like about kluster.",
    "problems solved": "main problem is giving me visability over what my best case/commits are"
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster gives me a radar in an otherwise very hrs to navigate job.\n\nAllowing me to accurately forecast and find gaps that need filling to enable me to reach my targets.",
    "dislike": "There honestly isn't a thing I dislike about kluster. Without it I couldn't do my job.",
    "problems solved": "It allows me to see where the gaps are in my pipeline and enables me to accurately forecast to sales leaders."
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The ability to track forecasts from different regions in one area.",
    "dislike": "At this point, there is nothing I dislike.",
    "problems solved": "Data is housed in one location with different break-out points."
  },
  {
    "Review Date": "05/24/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Helps manage pipeline and predict revenue easily for both reps and management.",
    "dislike": "I wouldn't change anything - there will be future evolutions that improve the breadth of functionalities, but the software as it is right now works as it needs to.",
    "problems solved": "Revenue prediction, mostly. Helps with identifying gaps in pipeline and adjusting sales strategy to fix these. The end result is more accurate revenue prediction."
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "Sales Operations Manager",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster allows us to draw actionable insights from our data to support forecasting on an individual rep basis but also across our sales team.",
    "dislike": "Haven't come across anything so far that I've disliked.",
    "problems solved": "It's helping us draw insights from the data that we have in our CRM whilst helping us more accurately future plan what we need to do to achieve our targets."
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "Revenue Operations Manager",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The epic CS team and the community analytics section",
    "dislike": "Bias towards salesforce but that's most providers",
    "problems solved": "Helping us dig deeper into our pipeline"
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I love how Kluster synthesizes our company's data into succinct, yet informative bits of insights that wouldn't usually be obvious to me on the surface.",
    "dislike": "Being very new to Kluster, to this point I haven't encountered anything that I've disliked about the platform.",
    "problems solved": "Kluster is providing a centralized, organized space to manage our company's forecasting models"
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Very fast SaaS RevOps function that is best complemented with regular sessions with their excellent customer success",
    "dislike": "They are scaling too and sometimes lose track of the working improvements back to our team",
    "problems solved": "Fast data insights from our GTM function to complement our then nascent RevOps team- added more bandwidth and benchmarking was also useful"
  },
  {
    "Review Date": "03/09/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster takes the headache out of Friday's forecast and allows me to share more forecasts with confidence and accuracy. It also updates in superfast time from Salesforce so waiting around for updates.",
    "dislike": "So far everything has worked well and there's nothing i could think about changing.",
    "problems solved": "more accurate and up to date forecasting."
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I like the the tool pulls from SFDC and provides charts and logs",
    "dislike": "it's not easy to use.  I used Clari in the past and it was much more simple .  Easier to navigate and create reports. More drop downs and categories.",
    "problems solved": "Quick views of the reps numbers"
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I like the updated news stream, that uses all our Salesforce Stats to give a very quick overview of how our quarter is looking.",
    "dislike": "That we currently cannot add new users ourselves.",
    "problems solved": "Being able to determine how realistic our goals for the quarter are."
  },
  {
    "Review Date": "11/21/2022",
    "Reviewer Role": "Strategic Marketing Manager",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "it gives really in depth insight into each rep and overall team. can help see trends and create tangible action plans from the stats",
    "dislike": "can be almost too much info so need to understand how to weed through it",
    "problems solved": "being able to make sense of sfdc data, sales reps trends, and more. really helps me coach sales reps"
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "Senior Commercial Account Executive",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I like the userbility of the too as it seemed to be very intuitive.",
    "dislike": "There was nothing that stood out to me that wasnt positive.",
    "problems solved": "It is helping me with my sales forecast and saves me so much time on a weekly basis"
  },
  {
    "Review Date": "11/26/2022",
    "Reviewer Role": "Sr. Sales Operations Manager",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The reports and data you get out of Kluster give legitimately actionable results for everyone-- insights for management, answers to complicated sales ops questions, and (most importantly) data to support rep process/strategy changes.  The team at Kluster has been excellent throughout.",
    "dislike": "Not really a dislike, more just something to keep in mind-- if you're talking to an audience that isn't used to multi-faceted charts and data, it requires some explanation.  Nothing insurmountable by any means, just keep in mind that there will need to be time to digest.",
    "problems solved": "When and why are deals being lost, how do differences in sales motion affect a team, how do different reps behaviors affect their performance in different areas.  A big benefit is being able to track SFDC data historically."
  },
  {
    "Review Date": "11/18/2022",
    "Reviewer Role": "Sales Operations Manager",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Basically, for me, the timeline feature on the prospects is giving me a really cool inside without that much effort",
    "dislike": "To be honest I would like to create my own reports on my own dashboard without always asking someone to do it.",
    "problems solved": "Have a basic overview of sales activity daily and also sales forecasting."
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Enterprise(> 1000 emp.)",
    "like": "Love the analytics provided. The platform is super easy and insightful to use.",
    "dislike": "I cannot think of anything. It is everything a sales professional can ask for.",
    "problems solved": "Forecasting-how to bridge the gap of where we currently stand."
  },
  {
    "Review Date": "03/08/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "You have a clear overview of your pipeline management, deals, sales velocity and planning.",
    "dislike": "Since it is connected to your CRM you have to have a cler structure when uploading your data.",
    "problems solved": "Deals management and planning"
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "SVP Finance",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "UI is seamless, reports are a huge value add, lift on my end was minimal, support continues to be top notch",
    "dislike": "haven't been able to find anything so far.",
    "problems solved": "Real time visiblity into our GTM metrics"
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "the interface and gamification of forecasting",
    "dislike": "not embedded in CRM so requires separate login to maintain data",
    "problems solved": "more accuracy in forecasting, gives company leaders more insight -- less benefit to me as a seller"
  },
  {
    "Review Date": "03/07/2023",
    "Reviewer Role": "Vice President of Strategic Product Sales",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Ability to adjust forecast across account team",
    "dislike": "Overall the product is working good and no feedback on what I don't like.",
    "problems solved": "Kluster is helping the team improve their forecast accuracy."
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "-Super visually pleasing\n-Quick visibility on my full pipeline\n-Easy to make changes",
    "dislike": "-Nothing, i prefer it to my CRM for reporting",
    "problems solved": "Visibility over my quarter on quarter pipeline health"
  },
  {
    "Review Date": "05/22/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The simplicity of this tool makes it very powerful.",
    "dislike": "The User Interface could be a bit prettier",
    "problems solved": "Sales pipeline"
  },
  {
    "Review Date": "08/03/2022",
    "Reviewer Role": "Principal Analyst, Sales Operations",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster has been a game changer in the way we forecast and measure/track KPIs. The tool is very customizable, easy to use, and provides us with actionable data we trust. Our CSM team works tirelessly to ensure that Kluster continues to meet our organization's needs as we evolve.",
    "dislike": "After ~3 months of using Kluster, there is very little I dislike. As expected, we have run into the occasional bug but the Kluster team is always quick to assist despite time zone differences.",
    "problems solved": "Kluster has replaced a lot of manual reporting/dashboarding previously done in SalesForce. This automation and access to current data improve our workflow and ability to make informed decisions quickly."
  },
  {
    "Review Date": "02/24/2022",
    "Reviewer Role": "Sales Manager - Los Angeles",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I love that Kluster makes data fun and easily digestible, both for myself as a manager, and for my team, who are typically turned off by data and spreadsheets. Kluster makes it easy for my team to know where they need to focus on in order to make their quota for the month, quota, and year.",
    "dislike": "Not much, but I would love to be able to compare my team's data to other regions in the company, as well as having a view of my team vs the entire company as a whole.",
    "problems solved": "Kluster helps me solve the problem of my team not owning their data, as the reports are easy to read and update in real time. By using Kluster, my 1:1s have become more efficient as the data takes away the storytime and excuses from the reps."
  },
  {
    "Review Date": "03/14/2022",
    "Reviewer Role": "Sales Operations Manager & Marketing",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The predictive forecasting with the built-in AI functionality removes the subjective component of 1:1s with sales reps and also makes forecasting more accurate by looking at the trends and facts. Kluster Vision for the sales reps shows how little actions have a giant impact which is huge for sales reps; especially those that are struggling.",
    "dislike": "Kluster needs to be more self-service. While the Kluster team is amazing, I want to be able to do more on my own without bothering them.",
    "problems solved": "We adopted Kluster for the forecasting component but the added value of having better, more data-driven 1:1s and being able to see live conversion analytics to pinpoints gaps in our process has been a critical need that Kluster solves. It's also helping us see where marketing leads stall, and what types of marketing leads soar through the process more quickly."
  },
  {
    "Review Date": "02/22/2022",
    "Reviewer Role": "Revenue Operations Manager",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster provides so many insights and is highly customizable. We love that we can create multiple views so that we can get different snapshots of the business. It's highly customizable so we can focus on what's important to the business at any time.\n\nThey have an AMAZING CS team that goes  above and beyond to make sure that everything is set up and customized to your business. They also share great insghts and bes practices that they see from other customers.",
    "dislike": "The only negative I would say is that there is no admin panel to go in and configure your own settings; this all has to be completed through your CSM. However, their communication is excellent, and the turnaround is very quick. If there are ever discrepancies in the data, they are fast to resolve it.",
    "problems solved": "- Insights into sales team trends such as lead velocity and pipeline coverage.\n- Forecasting\n- Team coaching"
  },
  {
    "Review Date": "02/17/2022",
    "Reviewer Role": "Director of Sales Enablement",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Through Kluster we get powerful insights that would have been very time-consuming or impossible to pull from Salesforce or PowerBi. We also get support from a team who speak our language, understand our challenges, and creatively find solutions to help us scale fast. The CS team at Kluster simultaneously run multiple projects with us, and lead from the front. I wish we had this level of support from the rest of our tech stack!",
    "dislike": "What I like about Kluster is when we find gaps in visibility, they listen, and try to fill them. So when we pointed out that Kluster could be better at helping us manage SDRs, and forecast for when new hires would start hitting our pipeline, they were more than happy to build new functionality to cater for our needs which we are now rolling out.",
    "problems solved": "Our success plan so far has focused on a few key areas;\n- AE and Manager 1-2-1s assessing pipeline health\n- Forecasting\n- SDR management\n- Recruitment planning\n- Inbound Vs Outbound coverage tracking\n\nWe have seen a positive impact on pipeline health, and quota attainment."
  },
  {
    "Review Date": "08/02/2022",
    "Reviewer Role": "Account Executive",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Great functionality, especially in terms of predicting outcomes, based on individual and team. I love the way it provides you with trending good/bad data points",
    "dislike": "There are some bugs and glitches in the UI, which can sometimes lead to a poor user experience. As soon as some of these are ironed out, this product will be top class",
    "problems solved": "- Predictability of Pipeline\n- If an opportunity isn't real"
  },
  {
    "Review Date": "04/22/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Enterprise(> 1000 emp.)",
    "like": "Kluster is a very easy tool to use and will ensure you can manage your KPIs as well as forecast accurately using the insights the platform is able to show. I have used Kluster now at 2 different companies and the developments that they have made are very good, the granularity in which you can report on helps to manage the pipeline throughout the month and prevent any issues before they arise.",
    "dislike": "Although the platform has very good insights at every stage and element of a deal it can take a little while to get used to how everything works but the team are very supportive in helping to navigate the platform.",
    "problems solved": "I am able to forecast more effectively using the insights Kluster provides, further to this the software enables my manager and I to have more detailed conversations around deals, how they are working and any additional coaching points we need to work on."
  },
  {
    "Review Date": "08/09/2022",
    "Reviewer Role": "Global VP Sales",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I can't live without the velocity page..",
    "dislike": "That I can't set it up myself and need to call each time.",
    "problems solved": "Kluster saves me hour of time with a calculator trying to get data from Hubspot.  It does all the math for me with an easy to understand dashboard."
  },
  {
    "Review Date": "02/17/2022",
    "Reviewer Role": "Sales Manager",
    "Company Size": "Enterprise(> 1000 emp.)",
    "like": "Kluster gives us a sales management team a great way of getting details sales analysis to ensure that we are not only looking at our reps on a topline basis but finding key areas where we can focus training and improvement strategies.",
    "dislike": "Sometimes there are elements of the platform that are not pulling through the right data, however Rory and Tom alongside their team are always on hand to fix and resolved this issues almost instantly.",
    "problems solved": "We have found that using Kluster's data we are able to understand more about each reps sales cycle, where they are operating in good practice and the areas we need to focus on to improve them. This then structures how we develop individual training plans and get more from each member of the team"
  },
  {
    "Review Date": "08/26/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "In depth analytical dashboards provides a wide range of visibility into opportunity progression. Great for basic out of the box visualizations.",
    "dislike": "Lack of customization from a user standpoint. All customizations have to be done by Kluster, also limited into what is able to be customized.",
    "problems solved": "Kluster provides an easy platform for our sales reps to forecast their opportunities. This then rolls up into sales management to easily view forecasts and analytics."
  },
  {
    "Review Date": "08/15/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster is simple to use and provides easy to understand analysis of key sales performance metrics.",
    "dislike": "Some of the navigation is not always intuitive and reports need to be custom-built.",
    "problems solved": "Kluster provides a critical view of sales performance metrics, enabling me to track improvement and monitor the impact of changes to our sales and GTM motions. It also helps drive more consistency and visibility in forecasting, resulting in better business performance."
  },
  {
    "Review Date": "02/17/2022",
    "Reviewer Role": "Revenue Operations Specialist",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Kluster is a game-changer for RevOps and Commercial Leadership. Not only will you improve your forecasting accuracy, but you'll clearly see why and where you might miss goals, so that you can act quickly. I especially like that individuals can easily see how incremental KPI improvements can influence performance. This makes for more effective 1-2-1 conversations with managers and helps identify training gaps.\nThe team at Kluster is super helpful and will always do their utmost to help you get the best out of the product. Just a great bunch of people with a brilliant product!",
    "dislike": "No dislikes, other than that, this tool will highlight issues with your CRM processes. This isn't a negative, but it does mean you'll need to get your house in order!",
    "problems solved": "Better forecasting accuracy and making sales metrics actionable can be a challenge without the right tools. The business often relies on unruly spreadsheets or, worse, doesn't use the valuable data available. Kluster helps resolve this by making the metrics readable and actionable. And all reporting is automated!"
  },
  {
    "Review Date": "02/25/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "To be honest, I'm not the most organized rep so having Kluster pull all my sales data into one place is super helpful. It also save me a ton of time putting together forecasts each week for my manager. It take like 2-3 clicks and I'm done - and that's easily visible to the right people.",
    "dislike": "It sometimes takes a bit too long to pull the sales data from our CRM into the platform but at most that is like 15mins. -First-world problems. Overall it's been great though!",
    "problems solved": "The problems that I'm solving are: saving a ton of time with creating forecasting reports, and having all of my quarterly/monthly deals in one place.\n\nKluster also has great reporting which allows me to understand what factors accelerate or decelerate my deals."
  },
  {
    "Review Date": "01/11/2022",
    "Reviewer Role": "Vice President Sales Operations",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster has an extensive repository of metrics and charts right out of the box... everything on my requirement list was readily available, as well several things I wish I had initially put on my requirement list.  Aside from the product my account team is the best.  I can't say enough good things about doing business with Kluster, in general.",
    "dislike": "Nothing.  Everything I have asked for, I have been able to get and their product roadmap includes more enhancements than I could ask for - they are one step ahead!  The team is fast to respond, despite the time zone differences (East Coast vs. London)",
    "problems solved": "We use Kluster for forecasting and reporting/dashboards.  It has given the teams a clear view of their business and can be used to support our broader team calls and 1:1 coaching sessions.  The link with SFDC helps us avoid any reconciliation exercises because we all start with the same dataset, and it matches SFDC."
  },
  {
    "Review Date": "04/21/2022",
    "Reviewer Role": "RevOps Manager",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The graphs are easy to review and contain a lot of data",
    "dislike": "I can not change the filters myself and need to rely on rep",
    "problems solved": "Monthly manager meeting regarding ARR spends etc. Better than the SFDC dashboard and more pleasing to report.  Info being sliced in different ways is super helpful."
  },
  {
    "Review Date": "02/16/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "It's genuinely a tool for all revenue professions - from the greenest AE to the most seasoned CRO. By providing actionable insights to the feet on the street on their own unique behaviours and pipeline, it turns the tool from yet-another-thing-i-have-to-fill-out-for-the-higher-ups to something they want to look at and use as they plan their days, weeks, quarters, and year out. At the top, the CRO can have insights into why the numbers are changing and the Kluster smarts behind the scenes help blend rep behaviour with actual past performance (since we all know that reps are perfect at always keeping a clean and accurate pipeline...).",
    "dislike": "Nothing so far - still working through a review.",
    "problems solved": "I would love to have this help with forecasting into what can often be a short sales cycle, and to help our teams to understand the impact of their activity (taking into account their personal conversion rates)."
  },
  {
    "Review Date": "02/24/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I work as an account executive. Kluster allows me to study my pipeline, my conversion rate and the length of the sales cycle.\n\nKluster also allows me to compare these KPIs with colleagues doing the same job.",
    "dislike": "Not much,I find the platform very fun and intuitive.\nIf you have any questions, the support is very responsive.\nKluster gives a good overview of the current situation.",
    "problems solved": "Kluster is useful on a daily basis for forecasting, pipeline management, creating and managing sales targets. It also allows us to know our weaknesses, to know where we can improve, is the pipeline sufficient? Are the deals getting signed quickly enough?"
  },
  {
    "Review Date": "02/25/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "On a daily basis, Kluster helps us to forecast effectively and accurately.\nAs an AE, Kluster gives me clear visibility on where I'm at in terms of closing, on my pipeline, and the gaps with my quotas.",
    "dislike": "Not much, even if the analysis of the open deals could be a bit more customizable to be adapted to different situations and use cases.",
    "problems solved": "All AE are now on the same page in terms of forecasting and reporting and this is super valuable for the management.\nIt helps us to get clear visibility and to be aligned as a team saving a lot of time."
  },
  {
    "Review Date": "10/15/2021",
    "Reviewer Role": "Business Development Representative",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Kluster helps me check my forecasts to make sure that what I am presenting to my manager is accurate.\nIt also keeps me honest about not holding onto deals too long that are plodding and need to be closed lost.",
    "dislike": "As a first time user, at the moment nothing",
    "problems solved": "I found forecasting off Hubspot clunky, and now I do it all through Kluster. My manager uses it, so I know we are on the same page.\nI have become harder on myself when forecasting, and although at times my number is lowered its now more accurate."
  },
  {
    "Review Date": "02/25/2022",
    "Reviewer Role": "A",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Be able to analyze my deals clearly - super useful",
    "dislike": "How slow the system can be sometimes, should be faster to load",
    "problems solved": "Having a clear view of how I am performing against my target and what kind of deal I am winning"
  },
  {
    "Review Date": "03/01/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "That it syncs with Salesforce but is easier to see everything that I have going on this month",
    "dislike": "Takes a bit too long to sync with Salesforce (sometimes up to 20-30 mins).",
    "problems solved": "I'm able to see where my focus needs to be at any given moment which has allowed me to be more productive and hopefully has contributed to my closing more deals as well."
  },
  {
    "Review Date": "04/04/2022",
    "Reviewer Role": "Revenue Operations Manager",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Support, weekly call with Tom. Always able to ask questions and get an update.",
    "dislike": "Control - but new featured coming.  To be able to change parameters.",
    "problems solved": "Reporting for monthly manager meeting"
  },
  {
    "Review Date": "02/25/2022",
    "Reviewer Role": "Account Executive",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "It saves time, and is cleaner to see 1) what i need to do, 2) what my manager is seeing",
    "dislike": "its not fully synced with our CRM so not everything shows up - might be an issue on our side on the intergation",
    "problems solved": "Easier forecasting meetings with my team and manager - and faster overviews for myself (which timelines are coming up, what and where to clean up my pipeline). Also great for my QBR and personal goal setting"
  },
  {
    "Review Date": "02/24/2022",
    "Reviewer Role": "Account Executive",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "It shows me what opps are realistic, opportunity creations, commit, vs. best case. it makes submitting forecasts easy",
    "dislike": "Sometimes Kluster can be a bit harsh when an opportunity is discounted or changed in scope. Tulip's deal often change from the initial conversation.",
    "problems solved": "I have figured out what my typical forecasts should be. tracked how my pipeline grows overtime and especially where I am generating opportunities from"
  },
  {
    "Review Date": "02/24/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like the ability to see historical information about deals, as well as determine which deals have a higher likelihood of closing based on industry. We can use this information for our prospecting efforts by identifying our low hanging fruit.",
    "dislike": "(This is not a Kluster issue) - lack of good information in CRMs means we cannot glean as many insights, and I think there could be navigational improvements to help find information more easily. I find that the platform is not designed intuitively.",
    "problems solved": "Identifying commonalities with our successful deals so that we can be more focused in our efforts and identify deals that are at risk sooner to help keep our forecast as accurate as possible"
  },
  {
    "Review Date": "03/01/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I have been using Kluster for the last eight months and have been very impressed so far. I particularly like being able to see what deals are at risk.",
    "dislike": "I can't think of anything I don't like about it. Does what it needs to!",
    "problems solved": "Having my risk deals highlighted enables me to action them quickly or take them out of my forecast. This helps me to be more accurate when it comes to QBR time!"
  },
  {
    "Review Date": "06/17/2021",
    "Reviewer Role": "Senior Account Executive",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster highlighted areas within our business and sales process that we weren't currently tracking. This helped highlight risk or trends throughout each stage of our sales cycle so that we could make more informed decisions, quicker.\n\nThe team are incredibly hands on, helpful and go over and above to advise on the most impactful parts of the platform for your business, and promote thoughtful conversation about the areas you may not be aware are holding you back. I certainly didn't!!\n\nYou can tell right from the C-suite  through sales and product you're a partner with them not a number and can even suggest input that gets immediate recognition.",
    "dislike": "Not so much a dislike but it's worth spending the extra session to get a deep dive into why each graphic matters and what it's really showing, so that you know how to effectively take action on the information.",
    "problems solved": "Better forecasting to the business, highlighting areas of risk within each deal, identifying opportunities across the team's pipeline to press.\nReviewing performance over time and looking into why we've overperformed or underperformed.\nReps become more accountable for their pipeline management and get better visibility on the actions required in their deals."
  },
  {
    "Review Date": "08/11/2022",
    "Reviewer Role": "Director of Revenue Operations",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster takes some advanced reporting and insights and makes pulling them easy. If you really need to step up from your basic CRM reports, Kluster is the easy button to get you there.",
    "dislike": "Not much to dislike. It's easy to use and pulls data directly from you CRM for realtime insight.",
    "problems solved": "Kluster has given us some awesome leading metrics to help us predict future success."
  },
  {
    "Review Date": "02/24/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Being able to see the health of my pipeline and be able to forecast to my manager accurately.",
    "dislike": "Only that I don't have it in my other roles",
    "problems solved": "Pipeline visibility, accurate forecasting"
  },
  {
    "Review Date": "02/24/2022",
    "Reviewer Role": "Account Executive",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The UI, I am a visual learner so having a clear and visual representation of pipeline makes it really easy to follow.",
    "dislike": "Could be me, but seems to take a long time to update from Salesforce e.g. the red, green and amber dots for deal health are sometimes inaccurate.",
    "problems solved": "Effective time management."
  },
  {
    "Review Date": "02/24/2022",
    "Reviewer Role": "A",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The dashboard functionality giving me full insight into pipeline and performance. This enables me to spot the gaps and plan accordingly",
    "dislike": "The refresh time when pulling from SFDC could be faster",
    "problems solved": "Pipeline visibility and reporting. It enables me to have oversight as well as easily report upwards"
  },
  {
    "Review Date": "02/24/2022",
    "Reviewer Role": "Corporate Account Executive",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The weighted pipeline gives me a true reflection of the propensity of my deals to close.",
    "dislike": "There are potentially too many data points",
    "problems solved": "Not having a top line view on pipeline value and my gut feeling on where i'll finish at the end of the q"
  },
  {
    "Review Date": "02/24/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "It's a comprehensive application and can be effective for bigger deals.",
    "dislike": "It's overkill for small deal sizes. The dashboard has a ton of information.",
    "problems solved": "Pipeline analysis"
  },
  {
    "Review Date": "02/21/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "As a sales manager, Kluster is a great tool to help me manage my team forecast more effectively and, therefore, give our leadership team a more predictable revenue. The platform also helps with one-to-one's, examing individual pipelines and more efficient ways to create strategies based on facts.",
    "dislike": "I wouldn't say there were any dislikes with this platform",
    "problems solved": "The problems Kluster solves are many, in particular for me, forecasting, pipeline management, creating, and managing sales targets."
  },
  {
    "Review Date": "05/17/2021",
    "Reviewer Role": "Sales Manager",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster has proven very valuable for us to be able to understand our sales function in much more detail, helping us improve our performance across teams and verticals. Especially our understanding of our per rep sales metrics and where each can work to improve which has seen our average deals size almost double in some cases and time to close shorten to half the previous.",
    "dislike": "It's still a fairly new company and some admin work is required but their CS team responds within the hour to help adjust or fix what I can't myself. But I know that's being worked on and not something that should discourage anyone.",
    "problems solved": "It really helped us to understand where we can improve and take measures to boost our business and achieve our goals."
  },
  {
    "Review Date": "05/11/2021",
    "Reviewer Role": "Commercial Technology Manager",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Easy connection to Salesforce with some great visuals. Great technical support and onboarding. Intuitive to use from Manager to Sales Rep",
    "dislike": "There hasn't been anything major. As it pulls in Salesforce data you will just need to ensure that you have your reports set up correctly to make it the most accurate",
    "problems solved": "We had a complex org structure that could not be used with Salesforce's org structure and made out of the box forecasting hard. We needed a tool that would be easy for everyone to Forecast as well as provide the team the right insight in what we are doing"
  },
  {
    "Review Date": "03/30/2021",
    "Reviewer Role": "Vice President",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Comprehensive forecasting and pipeline management with deep diving insights that allow you to take action at a company, team, and rep level.\n\nSpot early warning signs in the pipeline and forecast more accurately at every level of the business. It will also help track and improve the four sales levers of average sales cycle length, win rate, average deal size and optimum no. of opportunities to manage. Helps us understand if we have enough pipeline of the right composition for future periods, to achieve predictable booking patterns.\n\nLeveraged by everyone from SDR, AE, AM, CS all the way up to CCO and CEO - the visibility and data it provides to take action is excellent. 'Kluster Vision' allows reps to know what needs addressing in real-time, that level of actionability is rare\n\nKluster refreshingly drive innovation through idea generation that stems from their Kluster community, all their clients providing real-time feedback and suggested improvements. Got an idea? They'll make it happen.\n\nKluster is the real deal. GWI (and my previous company) have subscribed for the last 5 years, it's the tool I renew year after year ahead of all others.",
    "dislike": "Limited.\n\nSome of the interfaces/visuals aren't quite as slick as other platform tools. I guess this comes second to prioritising the value it aims to bring to their clients",
    "problems solved": "Forecast accuracy\nSpotting early warnings\n121 coaching\nImprove sales efficiencies and behaviours"
  },
  {
    "Review Date": "03/30/2021",
    "Reviewer Role": "Data & Insights Manager",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Kluster's predictive AI provides great guidance to our sales team, improving our forecast accuracy and helping us clear out aging pipeline.\n\nKluster has top-notch customer service, and is always working for us. We have weekly catch-ups with our CSM, and when we need bespoke work done, Kluster never hesitates to help us quickly deliver solutions.\n\nSimilarly, we're able to benefit from other reporting and dashboards from the Kluster community. Kluster's offering is growing with us.",
    "dislike": "Kluster focuses mostly on in-period forecasting, where our sales leaders would prefer an annual view.\n\nHowever, Kluster is helping us build this out, so this problem will be resolved soon and will be available to the community.",
    "problems solved": "We solved a problem with a matrixed reporting structure in our Sales org, as Kluster is able to configure this in the backend in a way that tools like standard Salesforce forecasting could not.\n\nWith Kluster, our rate of delivering analytics has increased rapidly.\n\nOur forecast accuracy has shot up, as well as our adoption of Kluster as a forecasting and analytics tool."
  },
  {
    "Review Date": "03/24/2021",
    "Reviewer Role": "Chief Growth Officer",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Predictive forecasting, team KPIs, dashboards",
    "dislike": "There is nothing about Klister that I dislike",
    "problems solved": "I am able to better predict not only the health of my pipeline but also predict where my team will end up at the end of the month. This enables me to quickly identify if we are behind in the month and address any shortfalls.\nThe Interactive dashboard helps me to report to key stakeholders within my business more efficiently and effectively.\nHaving the ability to set KPIs for individual team members based on their historical performance is a game changer."
  },
  {
    "Review Date": "06/07/2021",
    "Reviewer Role": "Head of Sales",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "As a relatively small team, we don't yet have a dedicated Rev Ops function. Kluster is an essential part of our toolkit that allows us to get all the insights we need without a dedicated team.\n\nCurrently, on their start-up package, the parts of the tool we currently use are relatively basic but are incredibly valuable as we start to scale. From the conversations I've had with the CS team, I'm pretty excited to get to the stage where we're ready to make the most of the more advanced features.\n\nI'd recommend Kluster to any small sales team who feel they don't have the time and/or expertise to get the most out of the data available to them.",
    "dislike": "Not really their fault, but when we first started looking at Kluster we realised pretty quickly that our CRM data integrity wasn't really good enough.\n\nDefinitely make sure that your team is using SFDC properly so that the data going into the tool is as good as it can be.",
    "problems solved": "Analyzing our pipeline, showing us what's rubbish and what's actually good. Loss analysis showing us which bits of our sales process are the weakest. They are providing more accurate forecasting than we had previously."
  },
  {
    "Review Date": "02/28/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The customer service and knowledge of Tom and Pete",
    "dislike": "The dashboards can be complex to read and understand",
    "problems solved": "The visibility of pipeline for the quarter/year so sales leaders can plan ahead"
  },
  {
    "Review Date": "06/02/2021",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "It's straightforward to use. The display of data is clear and concise. It integrates easily with Salesforce, and the insights it provides are incredibly valuable to everyone involved in not only the Sales org, but Marketing and Customer as well.\n\nKluster works very well with its customers, asking for constant feedback and ways to innovate and improve. Any issues (rare) are dealt with quickly.",
    "dislike": "Nothing at the moment. Would be interesting to see how the tool can take data from other sources, such as content and learning systems.",
    "problems solved": "We are to clearly and concisely see our sales data for opportunities, making it very easy to see how we track compared to target, but also quickly identify if there may be an issues which can be addressed early."
  },
  {
    "Review Date": "03/29/2021",
    "Reviewer Role": "Member - London Chapter",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The product is incredibly easy to use and to adopt in sales teams. But the one thing that does stand out is the world class support. The Kluster team have been brilliant in helping to shape our Kluster instance to our specific business needs.",
    "dislike": "Nothing to dislike so far - Kluster has been great!",
    "problems solved": "Forecasting, pipeline management, data integrity, tracking/monitoring key metrics and KPI's, sales velocity, board reporting. We have seen huge benefits in using Kluster in all these areas. I seldom log into Salesforce now - all the data I need to drive growth is in Kluster!"
  },
  {
    "Review Date": "05/12/2021",
    "Reviewer Role": "Vice President, North American Sales",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The forecasting predictability is pretty amazing and I get insights in one place for our business.",
    "dislike": "At this time I haven't found limitations with Kluster. In fact, the team has be incredibly responsive to our needs and suggestions. Being in the enterprise software space for 20 years, you just don't see that anymore and we value our engagement with the Kluster team.",
    "problems solved": "Forecasting accuracy, deal inspection insights, nice visualization of our data movements"
  },
  {
    "Review Date": "10/08/2021",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The product gives me a snapshot of salesforce every 15mins. If anything moves at any stage, I can see the changes immediately.\nIt has some predictive analytics based on history, which are useful\nIt has saved me a tremendous amount of time every day",
    "dislike": "Nothing yet, It seems good so far. We are only a couple of weeks in",
    "problems solved": "Better forecast visibility, better pipeline velocity"
  },
  {
    "Review Date": "06/09/2021",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I love that everything I could need is right at my fingertips. I never have to look far for information I need at any given moment and am actually more regularly being directed to things I wouldn't have picked up on without Kluster. Their team is so helpful and supportive - they feel like an extension of our team. Can't recommend them highly enough!",
    "dislike": "No major red flags. They are constantly working on new product and evolving which comes with teething pains, but everything is moving in the right direction, and quickly!",
    "problems solved": "Trends quarter over quarter, red flags, positive impacts of specific campaigns, stagnating pipeline, patterns in rep productivity."
  },
  {
    "Review Date": "03/30/2021",
    "Reviewer Role": "Director, Global Sales Operations & Enablement",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I love how dynamic they are as an organisation but also the out-of-the-box insights!",
    "dislike": "It doesnt have a self-serve admin portal.",
    "problems solved": "We are solving many problems including:\n- Forecasting\n- Key KPI tracking\n- Just in time analytics\n- Performance management\n- etc."
  },
  {
    "Review Date": "03/25/2021",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Sales Analyst",
    "like": "Easy to navigate, valuable insights and a great team to work with",
    "dislike": "I cannot fault the product from my usage thus far",
    "problems solved": "We have been able to create consistent scalable forecasting across our global org, with access to intelligent and predictable insights to guide our sales organisation"
  },
  {
    "Review Date": "03/25/2021",
    "Reviewer Role": "Senior Manager of Sales Operations",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Customer support is second to none, they have become an extension of my team.",
    "dislike": "Most downsides are directly tended to by Kluster in an efficient manner.",
    "problems solved": "Forecasting visibility, pipeline inspection, rep behavior, and hitting the number! Allowed by team in Sales Ops to scale without adding resources."
  },
  {
    "Review Date": "05/09/2021",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Pipeline reporting. In particular the pipeline change, coverage, conversion, and capacity reports. They help me see and plan for how much and what type of pipeline is needed entering and during a period.\nTheir support is fantastic. Easily the best support I've had from any tool I've ever used.",
    "dislike": "Filtering by multiple criteria is challenging",
    "problems solved": "Main challenges in solving with Kluster are pipeline planning, future quarter forecasting, and funnel conversions. A couple of things I've used it for is to help guide rep coaching conversions on where deals get stuck, and see future quarter gaps early, giving more time to solve for them"
  }
]