[
  {
    "Review Date": "12/02/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Super easy to use, integrates with LinkedIn, provides company information.  Also, easily exports contacts to SalesForce",
    "dislike": "Doesn't always have smaller companies, but that is to be expected.",
    "problems solved": "Best for finding email addresses, or contacts at companies with certain job responsibilities, great support for the sales team."
  },
  {
    "Review Date": "05/19/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "It is a modern approach to searching for contacts that have a lot of filtering characteristics. What I truly like about it is that it interfaces with our CRM, and Uplead techs were able to modify the upload mapping so that it uploads without a hitch into our leads area. It took a few tests, but they got it done.  Also, being able to get emails, and VALID emails that are tested at the time of download is really good. Like all list companies, they are not perfect, but a far cry better than the lists we've purchased in the past including D&B, InfoUSA, where not only do you not get emails but if you buy emails, it costs a LOT more and you have no idea if they are really good or bad when you purchase. With Uplead you have a fighting chance.\n\nAlso, they are very responsive to questions via email, and continuously looking to improve not only product delivery but periodic updates to data and with their AI engine reviewing data quality, its a very good alternative to other offerings.\n\nFinally, the cost is very good vs competition!\n\nList management is at best, an imperfect science.  UpLead makes it more acceptable and it's easy to use.",
    "dislike": "Not much, in fact the only thing I would require is some greater granularity or AI selection on filters. Almost all of what is reasonable and needed is there, but we have had one or two difficult searches that could use some great selection.",
    "problems solved": "Getting new leads to market to, and potentially, updating existing contacts and leads in our DB. We have close to 1/4 million contacts, and the timeliness of information is critical."
  },
  {
    "Review Date": "11/23/2020",
    "Reviewer Role": "Marketing Executive",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Its easy to use interface & the value for money on credits",
    "dislike": "Companies with unconventional URL's e.g. .io/.ai are hard to find but for .com companies you will find info for almost all of them",
    "problems solved": "we are using  uplead to run our in house marketing campaigns as well as finding contacts for client campaigns"
  },
  {
    "Review Date": "01/05/2021",
    "Reviewer Role": "Owner operator",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I could find my specific types of leads. I could even tap into the types of software their company uses. Super helpful. Adding to lists was great. No need to leave Uplead to add data on another program.",
    "dislike": "The price may dissuade some but if you have a good service or product you an make they money back easily in my opinion.",
    "problems solved": "Finding leads fast - the right ones."
  },
  {
    "Review Date": "11/11/2020",
    "Reviewer Role": "Marketing & Demand Generation Consultant",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Easy to search, and includes email validastion",
    "dislike": "The technology matches are not very accurate as best I can tell or they need a better categories",
    "problems solved": "Problem - building good marketing and sales lists with hard to find contacts.  Pour benefits are that we have been able to append important company and contact data to our target accounts."
  },
  {
    "Review Date": "01/07/2021",
    "Reviewer Role": "Social Enterprise Advisor & Managing Partner",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I like ease of use and support from reps.",
    "dislike": "Browser connection outside of daily tools",
    "problems solved": "Email lookups and research"
  },
  {
    "Review Date": "11/12/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "great contact info and you only pay  for the good information.",
    "dislike": "There is no downside that I've found yet.",
    "problems solved": "It's a great lead source. Super easy to learn and use. More good contacts than any lead source I've used.  And I only pay for good contacts."
  },
  {
    "Review Date": "11/11/2020",
    "Reviewer Role": "Vice President of Sales",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Super easy to use with accurate information.",
    "dislike": "Overall there are some small things with the download and saving leads that were originally a little bit of pain. After talking with their support they stepped up and helped me better understand how to use those functions.",
    "problems solved": "Able to get more accurate leads quickly."
  },
  {
    "Review Date": "11/19/2020",
    "Reviewer Role": "Digital Marketing Assistant",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Accurate information, it shows only valid and correct emails, and a lot of other useful information about the companies and contacts.",
    "dislike": "It would be useful to provide other email variations of the person, not only one.",
    "problems solved": "We were looking for potential clients, tried many different tools but without results. UpLead provided so many useful information, not only about our clients but competitors too.\nAnd I have to say, it's really easy to work with UpLead."
  },
  {
    "Review Date": "03/11/2021",
    "Reviewer Role": "Growth Marketing",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "It is extremely user-friendly and has a lot more features than some of the other tools we have used.",
    "dislike": "Nothing comes to mind yet. Seems like a very insightful tool.",
    "problems solved": "Prospecting"
  },
  {
    "Review Date": "12/01/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Enterprise(> 1000 emp.)",
    "like": "search by link option, and how narrow you can go by your search criteria",
    "dislike": "you should work on enlarging your data platform for startup companies",
    "problems solved": "generating leads much faster, having the company details in one page along with competitors."
  },
  {
    "Review Date": "01/07/2021",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Uncovering leads and their contact info I wouldn't otherwise have access to.",
    "dislike": "The downside is not being able to search for a specific contact as you might on LinkedIn.",
    "problems solved": "I now have a valuable list of leads I can prospect. UpLead's filtering has allowed me to narrow the leads by location, position, company size, and technologies to name a few."
  },
  {
    "Review Date": "07/07/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "We like it because we get  information on our leads with 100% accuracy  unlike other services that charge you for outdated information .   If the email address of the lead you are looking for is dead they tell you and don’t charge you a credit for it.  Also while it is a subscription service you can go month to month without heavy upfront fees like zoominfo , and you can easy upgrade if you need more credits for the following months.\nAwesome flexible service",
    "dislike": "Nothing.   The service is great and flexible.  There are times you won't find info but in large  for the money spend it is a great choice.",
    "problems solved": "We use it to find contacts and business development for our buyouts business within the tech sector.   Uplead has allowed us to  find  strategic buyers for 3 of our Clients resulting hundreds of thousands in fees"
  },
  {
    "Review Date": "07/02/2020",
    "Reviewer Role": "Business Development Associate",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I recommended UpLead to all of my coworkers and people that find it useful on my first day of using it. Great quality of data, every professional that is in the business of sales or marketing should not even think about jumping on the free trial. I hope everyone that uses it finds it useful as much as me.",
    "dislike": "I have no complaints so far. The UpLead team has been super helpful and quick to respond to every question I had. Keep up the great work!!",
    "problems solved": "This tool can be of great service to anyone that wants to do market research. The number one reason I am using UpLead is the verified email addresses."
  },
  {
    "Review Date": "07/14/2020",
    "Reviewer Role": "Vice President Marketing",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I was happy to find Upleads after comparing several lead services.  We were in need of contact validation and new contact data and from my experience, the quality of the leads has been great. The interface is also super easy to use and lets you pull based on all major criterias.",
    "dislike": "Haven't found much to dislike so far.  I wish there were more contacts returned in a few of my searches, but in large part, and as said, I was very happy with the contacts we were able to validate / discover, and the accuracy of the data.  Other providers have TONS of contacts but the data is bad, which of course is not a very good trade off.",
    "problems solved": "Validating contact data, finding new leads."
  },
  {
    "Review Date": "08/20/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like how simple and easy it is to use.  I had tried a number of other products that do similar things and none of them felt like the right fit.  As soon as I started with UpLead I stopped wasting time looking for a solution, and started spending it filling our sales funnel.",
    "dislike": "There have been a few links I found that were outdated, but it hasn't really been a problem.",
    "problems solved": "I was tasked with building out our Business Development program, and knew I needed to find a way to get in contact with businesses in the region whom we may be able to help.  UpLead downloads the contact information directly to our CRM and makes filling out our prospecting list super easy!"
  },
  {
    "Review Date": "05/19/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "UpLead is very easy to use and navigate. I feel like I am able to find the best leads for our company and make sure they are valid. This feature is extremely to ensure we are reaching the right people.",
    "dislike": "One thing that is really important for us is finding people with specific job titles. At first, I had a tough time figuring out how to search for people with multiple job titles. Fortunately, helpful instructions were in the tool! Once I figured it out, I was able to move forward easily.",
    "problems solved": "With UpLead, we are learning the right people to reach out that would be best supported by our business instead of reaching out to leads who would not be interested in what we have to offer."
  },
  {
    "Review Date": "11/25/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The UI (user interface) is incredible!  All fo the data you need for contacts is easily accessible and sortable.  I recently converted from LinkedIn Sales Navigator to Uplead and there's just no comparison.  Uplead is far superior in every sense of the word.  Populating my CRM with leads is 10x quicker with Uplead than it was with Sales Navigator.",
    "dislike": "I don't have any dislikes though I've only been using the product for about a week.",
    "problems solved": "I've started a new business in a new city which means I am 100% to building a network.  Uplead allows me to find and contact more potential customers than any of the competitors in their market."
  },
  {
    "Review Date": "12/01/2020",
    "Reviewer Role": "Sr. Regional Sales Consultant                            FL, GA, TN, NC, SC",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Provides email as well as a phone number.",
    "dislike": "I wish they had a Broader contact search.",
    "problems solved": "Getting through to the right people."
  },
  {
    "Review Date": "08/27/2020",
    "Reviewer Role": "Voice Talent",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The ability to save my searches and the ability to create a wide variety of searches",
    "dislike": "There is nothing that I dislike.  They have provided all of the services that I have needed.",
    "problems solved": "Uplead is a great source for searching out future clients and the ability to select the required data is very sufficient."
  },
  {
    "Review Date": "10/01/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Product: Web based, easy and intuitive to use. Gives you the options to search by company url, company name, location, function, etc. The list is almost endless.\n\nValue for Money: Unlike all the other competitors in the field, Uplead is a monthly subscription based service, which you can scale up and down as your business needs evolve.",
    "dislike": "Almost nothing. Occasionally, there are fewer connections to a company, but they are super helpful in updating their searches.",
    "problems solved": "Great for outreach marketing and integrates directly into HubSpot - fab and saves so much time and effort."
  },
  {
    "Review Date": "11/24/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Ease of filtering to the people you need.",
    "dislike": "Phone numbers do not seem to be as accurate as email addresses.",
    "problems solved": "We needed additional contacts to be able to market into. We have been able to get that fairly easily."
  },
  {
    "Review Date": "04/19/2021",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The accuracy, easy UI-UX, Intuitive, Export to CSV, extract LinkedIn EMails",
    "dislike": "There is nothing to dislike such an amazing platform",
    "problems solved": "I am getting high quality accurate leads at an affordable price plan"
  },
  {
    "Review Date": "12/08/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The user interface is a no brainer. What you see is exactly what you get. No complicated menus or hard to find search parameters whatsoever.",
    "dislike": "I wish it directly integrated with my company’s CRM. Love this platform.",
    "problems solved": "Within 7 days, UpLead has helped us find more qualified leads than we could have using any other platform or service."
  },
  {
    "Review Date": "07/28/2020",
    "Reviewer Role": "Freelance Copywriter",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like having access to verified emails.",
    "dislike": "I wish I could sort through verified emails before using credits. That way I could better target which companies I approach. As it is, I select a number of prospects and take whatever 'verifieds' make it through. Or else, pick a number and get the first X number of verified to pass through the net. Not a big issue by any means.",
    "problems solved": "Getting high-quality leads. I've quickly gotten the attention of my best prospects."
  },
  {
    "Review Date": "08/25/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Very easy to use and yields excellent lead information. It has really help[ed our organization with obtaining quality lead information.",
    "dislike": "There is really nothing that I don't like about UpLead.  I have been very impressed.",
    "problems solved": "UpLead has created an efficient and economical way for us to find leads and market information. It is a great resource and cuts down on a  lot of manual effort to find this information."
  },
  {
    "Review Date": "09/22/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I love how many ways you can filter results",
    "dislike": "How few valid email addresses there are, and how the phone numbers aren't actually phone numbers for the contact. It's just a company number which reduces the ability to follow-up with someone.",
    "problems solved": "I've been able to search for very specific companies that fit specific parameters which has been wonderful. There's also a great benefit to being able to download valid-only leads. However, I'm finding that 10% of those leads aren't actually valid, and I get bounced emails. Also, the phone numbers aren't accurate."
  },
  {
    "Review Date": "05/26/2020",
    "Reviewer Role": "Co-Founder",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Feature of data filtration as per title, revenue, year etc.\nI needed US companies data who have revenue less than 10 million and whose team size is 1-10.\nAlso i got another filter for job title , through which i was able to reach decision makers of that company which helped me to reach the right audience set.",
    "dislike": "some data are not correct, need to be updated continuously\nA feature enhancement that i would like to add is it would be great and save a lot of time if we have personal contact number of decision makers available.\nAs it will save us a lot of time.",
    "problems solved": "I needed consolidated data for my sales team, and they are giving the same. I need data on various parameters like some guys require data from specific industries and Uplead provides that wonderfully. Other times we needed data on basis of company revenue , and i was able to filter out companies on the basis of their revenue."
  },
  {
    "Review Date": "07/30/2020",
    "Reviewer Role": "Senior Director & Global Head - Marketing",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The accuracy of data is really great. I like the product and it is very handy in my sales process.",
    "dislike": "Nothing specific. However a lot more of data can be added",
    "problems solved": "I am solving my sales problems. I am able to generate good leads by using uplead and I will recommend this to those are battling with a sales challenge."
  },
  {
    "Review Date": "03/11/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Completely eliminates the needs for hiring & managing freelancers for lead generation. You can view the organization and all of the known employees within it. All of those email addresses from each employee are available. Meaning if you try to contact one person at a company, and fail, you can go down the line to the next person easily.",
    "dislike": "Some data is outdated but the ease of use more than makes up for that. I would also like if revenue levels would work in smaller increments. For instance, you can filter from $1m to $10m - but I'd like to filter from $1m to $5m.",
    "problems solved": "All of my prospecting is being done in record time. I don't have to manually search for companies. Also the price is pretty good. But would obviously like if it was a bit lower. An unlimited plan would be great."
  },
  {
    "Review Date": "01/04/2021",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The comprehensive and up-to-date info! Great for finding contacts at companies!",
    "dislike": "in comparison to other services i do not have any complaints",
    "problems solved": "Prospecting and reaching out to new contacts"
  },
  {
    "Review Date": "12/01/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I like the way to configure searches to very specific things.",
    "dislike": "It took me multiple time to figure it out completely but now it is simple for me to use.",
    "problems solved": "Lead generation. I do not have to rely of our lead department. I can get my own leads."
  },
  {
    "Review Date": "11/11/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Uplead is highly cost-effective and we are not locked into a contract.",
    "dislike": "Uplead doesn't always have the companies or titles I'm looking for.",
    "problems solved": "Generating valid and verified contact information for target prospects."
  },
  {
    "Review Date": "03/11/2020",
    "Reviewer Role": "Sales Development Representative",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "UpLead provides a feature-rich platform with a pleasant, user-friendly interface that integrates easily with many CRMs.  In addition, the data are of high quality, and the email addresses are tested before unlocking, allowing the user to make an informed decision about whether to pay a credit or not.  I'm a former user of Discover.Org, and this represents much better value for the money.",
    "dislike": "With the recent price increase, it isn't quite the value champion it used to be, but it's still very much worthwhile.  I have no functional issues with it.",
    "problems solved": "My job as Account Manager requires me to spend much of my time processing quotes, while my manager is pushing for more prospecting efforts.  UpLead allows me to easily switch to prospecting mode when I'm not doing admin work."
  },
  {
    "Review Date": "01/19/2021",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "So far the support has been very quick to get back to me. Integration with SF",
    "dislike": "At first, the UI and the search functions were tough to get used to but all in all very happy.",
    "problems solved": "Growing my lead generation. Efficiency is the number one benefit."
  },
  {
    "Review Date": "04/22/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Many of the contacts are not searchable by traditional methods such as LinkedIn. As well as verified emails, there are often direct telephone numbers as well, making the prospecting journey a lot easier.",
    "dislike": "No real downside other than the available data is very US-centric; ideally some more UK and European contacts would be welcome!",
    "problems solved": "It is a massive time-saving tool in compiling targeted, quality new prospects with verified contact details."
  },
  {
    "Review Date": "11/19/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like the ease of use and the great search options.",
    "dislike": "I dislike that some of the individuals contact information is not available.",
    "problems solved": "We are generating lead information to use for email marketing campaigns."
  },
  {
    "Review Date": "12/09/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Price is very affordable and easy to use",
    "dislike": "Some leads are dated and some companies can't be found",
    "problems solved": "Finding direct emails for contacts"
  },
  {
    "Review Date": "12/01/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "UpLead's interface is super simple and easy and allows you to search for contact information using lots of parameters. They also provide detailed information on each contact, which is great.",
    "dislike": "The only complaints I have are common across all data vendors, mainly accuracy, but that's part of the nature of the beast.",
    "problems solved": "We use UpLead for fast and easy data acquisition, verification, and appending."
  },
  {
    "Review Date": "11/12/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Ability to select from lots of different variables",
    "dislike": "Not all the data from selections are available to purchase",
    "problems solved": "Enriching existing data and improving buying leads for marketing campaigns"
  },
  {
    "Review Date": "05/06/2020",
    "Reviewer Role": "Director of Marketing",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The depth/number of customers listed in the tool is great.  They are the clients we're looking to grow with from every level of the organization.",
    "dislike": "Current employment can be outdated.  We've found from checking just our own domain that about 30% of the people listed no longer work with us.  It looks like this info is coming from LinkedIn and is subject to LinkedIn being accurate.  If it's not, we'll be wasting credits on people who don't work for the customer we're looking to develop.",
    "problems solved": "We are able to target perspective clients and get access to them far easier with this tool than by hunting for open source information or calling the switchboard of their main office hoping to get someone who is a decision maker."
  },
  {
    "Review Date": "02/16/2020",
    "Reviewer Role": "Cofounder & CEO",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The user interface and the filters are great. Data is accurate data. But most importantly if you are running research projects to estimate target markets, it's a great tool to have.",
    "dislike": "Nothing much. Maybe they can add a few more columns to the output, like the website URL. Otherwise, I find it very helpful. Also, the ability to be able to search by uploading a list with company names would help.",
    "problems solved": "We use for research purposes primarily. It helps us estimate and analyze the size of the target universe for our clients. Because of the multiple filters that it has, analysis is much easier as compared to some of the other tools that are available out there."
  },
  {
    "Review Date": "07/21/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Really customizable to your needs i.e. revenue, c-level, industry etc",
    "dislike": "Needs more contacts from more companies, as this prevents gaining maximum scope of contacts available.",
    "problems solved": "The time cost of researching leads. This is minimised due to the HubSpot integration which is great and instantly puts the contact into the CRM."
  },
  {
    "Review Date": "06/10/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The user interface is very easy to understand. It's quick to do filters and download leads.",
    "dislike": "It's not possible to do a search that includes keywords in the company name. It's only possible to exclude by keywords.",
    "problems solved": "We're sourcing new leads to reach out to on LinkedIn in sectors we haven't approached yet"
  },
  {
    "Review Date": "03/11/2020",
    "Reviewer Role": "Director Of Marketing",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I really enjoy Uplead's ease of use. It's very intuitive and makes it easy to find information about potential clients and companies. The contact data is also up-to-date, which is a BIG plus for a prospecting tool like this. Inaccurate data doesn't make sales and business development reps more efficient, so this is key. I've found Uplead to be more accurate than other prospecting tools.\n\nThe detailed information about each contact helps sales reps to make an informed selection when choosing to spend a credit to unlock a contact's email. Additionally, Uplead verifies emails and gives you the result with the option to accept or decline the lead without using a credit. This allows you to know that you're using credits on emails that will reach an actual person. The combination of detailed information and email verification really helps you maximize credits and make sure you are getting the best value for each credit.\n\nThey also have quite a lot of filtering options. I really like the fact that they have a technology filter. These deeper kinds of filters add to the value of Uplead and help our sales and marketing teams better target prospects with more relevant and effective messaging.\n\nA lot of quality prospect tools are way too expensive for small businesses that can't invest tens of thousands of dollars. Uplead is the prospecting tool that you can afford with the data quality you need. If you're ready to make your prospecting efficient and affordable, Uplead is the perfect tool.",
    "dislike": "Sometimes the filters will exclude contacts that they shouldn't. For example, if you make one of your filters US contacts only and the contacts don't have country information but do have state information (i.e. contacts that have their location set to Ohio, but not Ohio, US) will be excluded. You have to play with the filters a little to understand what level of exclusion works best for you. It takes a little tinkering, which does take time, but the information is accurate so that's better than inaccurate data.\n\nI love the technology filter, but it would be great to have more technologies available in this filter. I'd also like to know how Uplead knows what technologies a company is using.",
    "problems solved": "We are using Uplead for: prospect and account level research, identification, and prioritization, as well as expansion and up-selling/cross-selling in current accounts. We run lead generation and content syndication campaigns separate from Uplead, but then we use Uplead to verify the leads we get and also find more contacts at that account.\n\nSo far, Uplead has been great at meeting all these needs. Definitely cut down time spent on these activities."
  },
  {
    "Review Date": "09/18/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "It's one of the best tools in the market if compared to others as gives precise results",
    "dislike": "Till now I've had a good experience hence no issue till now",
    "problems solved": "I need to connect with people into the education sector and uplead has proven to be that tool which helps me in connecting to them"
  },
  {
    "Review Date": "12/21/2019",
    "Reviewer Role": "Sales Manager",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "UpLead makes it easy to look for information about potential clients and companies that could help increase our sales and boost our marketing strategies. I like that it has a wide range of information stored and I can find at least all of the things I'm looking for. It provides content of quality that is needed in my work all the time.",
    "dislike": "I wish UpLead expanded its data so that there's not any information missing while trying to look for a company's information.",
    "problems solved": "It has helped us a lot in our marketing campaigns. It has a reasonable price and plans that offers a lot of resources. Contact data is always right and of quality, and it works in real time. Prospecting can take a lot of time from us but UpLead has it all covered and by just selecting the right filters we can have the information needed right away."
  },
  {
    "Review Date": "11/11/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Ease of use and the ability to filter through information to obtain what I'm looking for.",
    "dislike": "Pricing for Individual users that has very low volume needs.",
    "problems solved": "Not guessing email address, which saves time and repeat submissions to get to an individual lead."
  },
  {
    "Review Date": "11/11/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The contacts never end. I can look at any area, oil, and gas, or investors.",
    "dislike": "Not sure yet. I will see if I can find something I don't like and send it to the gents that have been in contact with me every time I am on the site.",
    "problems solved": "Many Contacts all over the world."
  },
  {
    "Review Date": "04/08/2020",
    "Reviewer Role": "Full Stack Engineer",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I've tried quite a few systems like Uplead.  Many are really expensive.  Another had good data but results were slow.  Uplead has a rich UI (filter capabilities) with plenty of good lead data.",
    "dislike": "I wish LinkedIn profiles were present in the main search results (instead of having to click through to an individual profile to find it).  Not a big deal, but this would be a time-saver.",
    "problems solved": "Obtaining leads for cold email outreach via companies that recently visited my clients' websites, shown be LeadFeeder."
  },
  {
    "Review Date": "01/30/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The monthly payment option; no year long contract. As well, the prices are much more affordable and with the same information you find on other sales lead sites.\n\nEase of use as well. very intuitive and you definitely can find decision makers or candidates with ease.",
    "dislike": "A little hard to sort by title, but once you learn it, it's awesome. Other than that, it is a great product and well worth the price. Great customer service and they check in often to make sure you are enjoying the product.\n\nNo matter the budget, UpLead has a price you can afford.",
    "problems solved": "Getting leads quickly and able to reach prospects with ease"
  },
  {
    "Review Date": "12/05/2019",
    "Reviewer Role": "President",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Offers everything needed to generate quality leads.The numerous options for Search Criteria provides access to specific target markets. There is detailed info about all the leads which helps to make an informed selection. The email Unlock feature gives the option to accept or decline the lead without charging a Credit.\nThe Search Criteria options enables finding contacts and companies using different methods for finding qualified leads.\nThe ability to select companies based on their social media presence.\nThe demo was very useful and they're follow-up was very timely.\nTechnical support has been excellent..knowledgeable, helpful, professional.",
    "dislike": "Some companies do not have email addresses.\nThe CRM doesn't integrate with Apptivo",
    "problems solved": "Finding targeted leads; building an email list; generating more activity within our social media marketing.\nMore sales opportunities, website visits and social media interaction.\nNo need to use multiple vendors for leads; UpLead provides everything we need in one solution"
  },
  {
    "Review Date": "06/16/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Love the integration with HubSpot-- it makes things easy!",
    "dislike": "A lot of contacts are not up-to-date... I've found that new hires or contacts that have left the company are not updated. Also, smaller or international companies are hard to come by or don't exist on UpLead.",
    "problems solved": "Finding prospects to contact and new companies to call on. Makes my process as a BDR so much easier/more efficient!"
  },
  {
    "Review Date": "02/28/2020",
    "Reviewer Role": "EXECUTIVE RECUITER",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "As a sourcing individual searching for contacts for our business, we rely on the  authenticity of the data.\nIf you have any issues, their support staff will assist you - no matter what.",
    "dislike": "No downsides - if there were, I would not be a loyal client.  Uplead is an extension of our staff - ready to help anytime and anywhere.",
    "problems solved": "Finding new clients and candidates is the biggest benefit.  It is affordable!"
  },
  {
    "Review Date": "01/30/2020",
    "Reviewer Role": "Responsable marketing principal",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The simplicity of the search engine parameters and the results view. the accuracy of the results is also a big plus when the contact is not existing anymore the erase it and give the user a really good experience to acquire leads, Uplead algorithm is by far the most powerfull we saw compared to competition.\nthe new 2.0 platform is even more user-friendly they have more contact results then any platform we used in the past",
    "dislike": "the only think i dislike compared for example to a another platform we use called Lead411 is that at some point we have no choice to use a credit to reveal the email compared to lead411 that provide us some revealed email in the search results. this is so far the only down side that i see...",
    "problems solved": "the relevance of the search results by SIC Code which is the most accurate way to have proper leads, the major problem in my company was to update my contacts list, with uplead it is 500x faster compared to the traditional  search online."
  },
  {
    "Review Date": "05/26/2020",
    "Reviewer Role": "Team Lead",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Interaction and flexibility this company and and its representatives have is truly ethical. I wanted to extend my trial as i had a presentation scheduled after memorial day. Without further due i was given an extension and now i can proudly represent the customer service they are providing. I would like to thank Russel who has an immense thirst to go an extra mile for the customer. More than happy with the service so far. Great job guys.",
    "dislike": "Nothing i know of so far. Perfect so far",
    "problems solved": "Lead generation and email capture"
  },
  {
    "Review Date": "08/11/2020",
    "Reviewer Role": "Sales Knockout",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like that Uplead does not require a long term commitment and that it is easy to use.",
    "dislike": "Nothing to dislike so far. UpLead more than met my expectations.",
    "problems solved": "The biggest problem I’ve solved is finding qualified leads that fit our client avatar. UpLead’s offering has now saved me countless hours collecting prospect data."
  },
  {
    "Review Date": "11/18/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "My team llike the ease to separate searches and add to individuals to different campaigns",
    "dislike": "There is no downside.  Great ease of use.",
    "problems solved": "Creating Prospecting lists with accurate contac.t info,"
  },
  {
    "Review Date": "01/30/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Email addresses appear to be updated regularly, and are available for a variety of contacts within each organization, from operations to sales and the executive suite.",
    "dislike": "We have not found any true problems as of yet.  A few searches have come up without results, but that's probably because the company has not been inserted into the database as of yet.  That has happened less than 10% of the time I'd say.",
    "problems solved": "Allows us to better target our email marketing campaigns, which we use to compliment our mail marketing programs."
  },
  {
    "Review Date": "11/17/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The company search function is easy to use.",
    "dislike": "Learning the search functions and capabilities helped redirect my initial dislikes.",
    "problems solved": "Using Uplead to increase opportunities for new business contacts.\nWe have identified several business looking for products and services we offer."
  },
  {
    "Review Date": "12/01/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "User friendly website, almost always finds the information i am looking for",
    "dislike": "does not always have every company i am looking for",
    "problems solved": "tracking down contact information for specific businesses"
  },
  {
    "Review Date": "06/17/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Everything about UpLead is above par. A business partner recommended it and I have not regretted subscribing to the application. Great and up-to-date leads.",
    "dislike": "Yet to find any dislikes. ABSOLUTELY NOTHING.",
    "problems solved": "Marketing and sales"
  },
  {
    "Review Date": "11/06/2019",
    "Reviewer Role": "Data Specialist",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Whatever criteria I searched there, I got the contacts related to that. I liked the search option mostly. It has everything we need to narrow down the list as per our requirement.",
    "dislike": "You should have more data in fields, like I didn't see any column without missing data. It means you have columns like SIC, NAICS, and many more where data fields are blank and in that case we may missed some leads if we try to filter it down with additional filters.",
    "problems solved": "I am trying out several research options with UpLead. I am looking for new leads for my clients as well. It helped me in some case but disappointed in some other cases as well in terms of small firms or companies."
  },
  {
    "Review Date": "01/09/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "UpLead provides numerous, powerful, and granular search parameters in a reasonably common-sense interface. The contacts themselves are not only qualified for technical deliverability (something that required other third-party tools and subscriptions at subsequent stages), the contacts themselves are surprisingly receptive and essentially the building blocks on which deep, long-lasting relationships have been able to be forged.",
    "dislike": "Some filters restrict keywords to only 1 parameter. In many cases for instance, I've found the need to search for a keyword in one search parameter and another as a sub-defining query.",
    "problems solved": "Quality contacts pure and simple. It's not enough to have quality emails alone, we ultimately want warm, receptive leads. While this is a big ask for any lead source, of course, I have nevertheless found this with UpLead in spades."
  },
  {
    "Review Date": "01/31/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I can search most C suite suspects, retrieve both emails and phone numbers in minutes.  Not only that, while searching you will come across other suspects as well.  (Suspects being potential leads but not yet qualified to be a prospect).",
    "dislike": "I really do not dislike anything.  You need to understand going in that not every email will be available.  It's far better than waiting and hoping to connect on LinkedIn though.",
    "problems solved": "I am able to get rite to the decision maker and start the process."
  },
  {
    "Review Date": "02/03/2020",
    "Reviewer Role": "Co-Founder",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Our favorite feature is the ability to search for leads based on \"Technology\" allowing us to reverse engineer and find prospect who may be using a competitor or integration partner.  Also being able to filter by role within the organization allows us to pinpoint the correct person with the business to reach out to - increasing our engagement and replies.",
    "dislike": "There is very little.  But if I had to be nit-picky, its a little hard to find previously exported leads.",
    "problems solved": "Generating a fresh list of highly relevant prospects that we can warm up via cold outreach."
  },
  {
    "Review Date": "03/25/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Easy integration into CRM tools like HubSpot & SFDC.  Search parameters are easier to use than ZoomInfo.  Monthly pricing model is great for start-ups!  Verification of email addresses before downloading into CRM/spreadsheet.",
    "dislike": "Can't see email addresses w/o using credits and downloading into a spreadsheet or CRM tool.",
    "problems solved": "Access to the target positions and people that I am looking for in companies I want to do business with."
  },
  {
    "Review Date": "12/05/2019",
    "Reviewer Role": "Regional Director",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The UI is very intuitive delivering refined results given that it front-ends an enormous dynamic database that is continually building and refreshed with clean data.",
    "dislike": "It has performed as to expectations with respect to functionality and data delivery. Also, the Customer Care pre and post-sale is solid. No dislikes.",
    "problems solved": "Increase access to our ICP is a very meaningful detail or our growth plans. It's early but clearly we will raise our prospecting metrics to exclips the expected ROI. Easy decision to make, especially given thier pricing and licensing model."
  },
  {
    "Review Date": "11/06/2019",
    "Reviewer Role": "Principal and Owner",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Comprehensive data including the tech stack, very easy to navigate, email validation, and it is priced fairly at every level, even single user.",
    "dislike": "Sometimes contact phone numbers are no longer active but that will happen will any sales intelligence tool.",
    "problems solved": "I am able to easily identify a market sector and reduce the search results to a specific geography and then find contacts by role or title. The search can be saved and I can download the results into a spreadsheet of my CRM using credits based on my plan. From there I have a highly targeted list I use for outbound lead generation."
  },
  {
    "Review Date": "01/13/2020",
    "Reviewer Role": "Chief Executive Officer",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Ease of use and simple identification of the contact type I need. I first tried ZoomInfo, and it was outrageously priced. Higher than I had read about on the Internet. For this reason, I found UpLead which seems to be a reasonable alternative at a tremendously lesser cost.",
    "dislike": "I have not found anything I disliked specifically with Upload.",
    "problems solved": "Avoiding the insanely high cost of ZoomInfo while having access to accurate data. I need access to decision makers and Uplead has so far been a simple alternative while not costing anywhere near some other platforms I have seen."
  },
  {
    "Review Date": "09/25/2019",
    "Reviewer Role": "Hr Manager",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The fact that you are able to connect with key individuals within a company to get your point across/ business done quickly and efficiently. I like that I do not need to waste time and come up with creative ways to find decision makers contact information. It's all there for you. I do enjoy the integration aspect as well as I am new to the marketing side of things. I am able to sync my information to a mail merger (for bulk messaging) because uplead gives me the option to transfer ALL data to an excel sheet.",
    "dislike": "Some emails are not up to date. But I enjoy the fact that they verify this info upon unlocking to keep from a wasted credit. This is something that stood out to me in comparison to other companies.\n\nI wish there was an option to get unlimited/open credits, more of an annually option to increase productivity within my company.\n\nOther than this I am content with this platform.",
    "problems solved": "Getting in front of key decision-makers within a company. I can directly contact them without searching the web. I can also find out a quick snippet of the company when doing a search, it helps when conducting a completely general search. I find it hard to differentiate the titles of workers, Uplead outlines there current role/ title to ensure I am speaking with the correct individual."
  },
  {
    "Review Date": "12/03/2019",
    "Reviewer Role": "System Engineer",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The aesthetic look of the website is modern but I'd rather have leads that accurate. I did not pay for a good looking website but quality leads.",
    "dislike": "We moved from D&B leads which we learned our lesson. We were stuck with a one year contract. D&B had horrible leads with inaccurate contacts and emails that bounce all the time. That being said when we joined Uplead I thought we would try for a month. Well, it seems that their leads are just as bad, I'm a business owner so I was under the impression this was billed on a month to month meaning you needed to physically approve payments. Apparently, we got billed for 3 months. I was very upset so I contacted customer service and guess what!! They are bad people!! If you stop auto-bill you lose all of the credits you paid for. Right when I thought you can't get worst than D&B, Uplead really took this lead. Very disappointed with this company. I will be filling a complaint with the BB and US consumer affairs.",
    "problems solved": "They did not resolve my issue"
  },
  {
    "Review Date": "07/28/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Easy to navigate search criteria and ability to upload to CRM, Salesforce. Mike and Russell are very helpful and responsive to my questions and to address our needs",
    "dislike": "We are a fairly new user of Up Lead and it is currently satisfying our needs",
    "problems solved": "We are using UpLead to reach out to new prospects in our vertical markets"
  },
  {
    "Review Date": "09/30/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Up lead helps to gather more information about targeting audience with reasonable price",
    "dislike": "We are not able to get more free credits",
    "problems solved": "find out all c level information"
  },
  {
    "Review Date": "06/02/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "That I'm able to find potential clients that I never thought of before or would have never come across.",
    "dislike": "That I am not able to note who I contacted in the systems",
    "problems solved": "Finding new potentials clients, I've scheduled more sales meetings directly due to Uplead."
  },
  {
    "Review Date": "12/10/2019",
    "Reviewer Role": "CEO and Founder",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I love the ability to upload a list of URLs of target companies, and then get results for all the contacts at those companies. I think the fact that UpLead verifies email addresses leads to less bounced emails and higher conversions. I also like how easy it is to download information to our CRM.",
    "dislike": "Sometimes I can't find the contact information that I'm looking for, or some of the contact information is outdated. That being said, this is something that just happens when people leave companies and new people join or are promoted to new positions.",
    "problems solved": "Uplead helps us implement a scaleable marketing process by helping us source a high volume of leads at the right companies. We have saved time and have found a higher level of accuracy in the contact information we sourced via the platform."
  },
  {
    "Review Date": "02/26/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Enterprise(> 1000 emp.)",
    "like": "Oh, it has been the best tool I have used to date. I have tested other more expensive experiences and without fail the information that was available had been very outdated. I have been using UpLead for about 3 weeks religiously and haven't come across one outdated record. The ease of finding the correct email addresses for contacts has saved time on trying to \"guess\" at the right combination to unlock a potential piece of business.\nAlso, it is extremely easy to use...easier than logging into this survey.",
    "dislike": "The only situation that I have run into, is that some companies aren't listed. Mostly smaller local/regional entities.",
    "problems solved": "Finding the right contact and their information has been a challenge. UpLead has saved me hours of combing through LinkedIn to find contacts. I still use LinkedIN for expanding information."
  },
  {
    "Review Date": "09/29/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Large number of filters available to me!",
    "dislike": "I have yet to encounter any features I am unhappy with.",
    "problems solved": "I am reaching more leads and finding better quality leads."
  },
  {
    "Review Date": "06/18/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I was able to get my database seriously cleaned up and updated. And how can you not appreciate a product that saves you money by letting you know a connection is not current?",
    "dislike": "It took me a moment to figure out how to use the search functions effectively, but not frustrating.",
    "problems solved": "Keeping current, more useful contacts."
  },
  {
    "Review Date": "08/22/2019",
    "Reviewer Role": "Marketing Consultant",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "UpLead has unmatched customer service. Everyone is so nice and helpful. They're extremely patient and understanding as well. When I was in the first stages of the trial I ran out of tokens, but was still unsure if I wanted to invest in the service. Without hesitation, an UpLead representative loaded more tokens to my account, so I was able to confirm my belief in their services. Also, their services have provided us with hundreds of contacts that we've been able to turn into leads. Also, the data that UpLead provides is up to date, which saves us time from reaching out to inactive email addresses. The UpLead service is extremely easy to use as well. I'm not the most tech savy person, but this software is extremely easy to use, and if you are confused at all, you can just ask the helpful customer support staff.",
    "dislike": "One thing I think UpLead can do better is increase the size of their overall database. I think if any of their competitors has the upperhand on UpLead, it is because of their database size.",
    "problems solved": "UpLead has been instrumental in our research process which includes creating customer leads in our industry. This has helped us turn those leads into sales, which has allowed us to beat our lead targets for the 3rd week in a row. The simplistic application has made out data research simple, affordable and extremely successful."
  },
  {
    "Review Date": "08/22/2019",
    "Reviewer Role": "Intern",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "My team and I use UpLead very often to find contacts and companies during our trade shows. UpLead is a great easy to use website that allows you to find everything you need very quickly. I have tried other websites to compare them to UpLead, and can say that no other website compares to them. They have the most information available, and is very easy to access. Also, UpLead has the best customer service support team. While in the trial stage, I asked support for a few more credits to show my boss. UpLead provided me with the credits within 20 minutes.",
    "dislike": "Sometimes I needed to search a name a couple of times before a result showed up. This was not a major problem, but it would take often 3 searches for some names to show up. This did not happen all the time, but was annoying when trying to fill out a contact list quickly.",
    "problems solved": "UpLead has made my job so much easier finding companies and employees we are looking for in certain locations. My company searches for certain types of users, and UpLead has provided us with a quick and easy way to access these people."
  },
  {
    "Review Date": "08/22/2019",
    "Reviewer Role": "Digital Expert Consultant for Fragrances & Beauty (External)",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "This platform is incredible, I find 99% of the contacts I want. In addition, the system for controlling the emails of contacts makes it possible to choose freely if one wishes to recover all the chosen contacts or only those who pass the verification.",
    "dislike": "Je voudrais une application pour l'utiliser à la place d'aller sur le site web.\nAussi, obtenir la connectivité et la synchronisation avec mes propres contacts sera utile.\nPeut-être que l'interface de recherche sera meilleure sans choix cachés que vous devez développer pour sélectionner.",
    "problems solved": "Obtain the right contact instead of searching, saving time.\nI was purchasing contact lists from providers. Those lists were not accurate enough for me, and often, information was wrong, but there is no way to know that before buying them. With UpLead, I can check and select contacts from results matching my criteria, no need to buy the full listing."
  },
  {
    "Review Date": "06/16/2020",
    "Reviewer Role": "Digital Marketing Director",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I could not find another API providing the same level of data as uplead.  They are changing the game.",
    "dislike": "I would like more free credits. =D.  It’s kind of expensive.",
    "problems solved": "I am using the api to to get user information."
  },
  {
    "Review Date": "05/07/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "UpLead solved all problems we had in our previous searches for Leads. Further, it is userfriendly, efficient and offers high-quality information for fair prices",
    "dislike": "To be honest, there wasn't anything I wasn't satisfied with",
    "problems solved": "Lead generation\nCreating contacts for campaigns"
  },
  {
    "Review Date": "04/22/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Good source for business development and targeting region wise",
    "dislike": "updated data since people switch jobs and contacts and email sometimes are wrong",
    "problems solved": "effectively using our business sources"
  },
  {
    "Review Date": "03/12/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Version two is very simple and easy-to-use",
    "dislike": "Not enough contacts for medium business\n\nHowever if used with other tools Uplead works just fine with this category",
    "problems solved": "Lead generation. Both process and result."
  },
  {
    "Review Date": "03/11/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "What I like the best is the quality of the data, the completeness of the data, the seamless integration with Dynamics 365 and Salesforce.",
    "dislike": "I don't really have a dislike at this point, but I would like to have a simple way to redeem credits for any email bounces.  There have been very few, but it is almost certainly going to happen.",
    "problems solved": "Prospect identification and list building is our objective with UpLead and it has been fast and easy."
  },
  {
    "Review Date": "01/31/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Choice of Information , Industry-wise and They are ahead of the game compared to peers. Ability to Improve your customer experience by identifying right people for right products.",
    "dislike": "Uplead can offer more tools to dissect data and keep only required Information",
    "problems solved": "I was Really concerned 2 months ago as I don't have any business connections. This tool raised my hopes with all leads available , completely day and night . Now I am confident with Information I will be there for sure"
  },
  {
    "Review Date": "01/30/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like that I'm able to search easily by any field that I need.",
    "dislike": "A few of the phone numbers aren't available.  It would be much helpful if the HQ phone number wasn't the only one that was available.",
    "problems solved": "A few of the phone numbers aren't available.  It would be much helpful if the HQ phone number wasn't the only one that was available."
  },
  {
    "Review Date": "07/28/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I love that Uplead checks to make sure emails are correct so you don't waste time or money",
    "dislike": "Nothing, so far everything has been good experiences",
    "problems solved": "Finding the right point of contacts for companies we want to do business with."
  },
  {
    "Review Date": "03/18/2020",
    "Reviewer Role": "Sales Representative",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The extensive filter options are great! Very easy to target not only industries but people who can make decisions at each company.",
    "dislike": "A few of the leads are for businesses that are closed... but the good news is, you aren't charged a credit when a lead isn't good.",
    "problems solved": "I've saved tons of time on lead prospecting, AND found better people to approach!"
  },
  {
    "Review Date": "07/26/2019",
    "Reviewer Role": "Founder",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I use UpLead to source prospects from specific companies, roles and management levels.  UpLead by far has the best coverage (e.g. number or contacts) as compared to other technologies I've used including ZoomInfo, Adapt.io, GetProspects, Hunter, etc...  I love the buy-what-you-need pricing model and the fact that UpLead validates emails upon download and only delivers/charges for verified leads it provides.",
    "dislike": "The attrition rate of leads at down load can approach 30-50%.  I'd prefer that they routinely validate their database.  That said, I appreciate still listing the contacts and offering access to LinkedIn profile even though they can't provide the email.",
    "problems solved": "Sourcing precise list of prospects by target company URL.  The cost and efficiency of UpLead makes it a critical tool in my business development arsenal."
  },
  {
    "Review Date": "02/26/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The ease of customizing a list to your exact specifications.",
    "dislike": "It would be nice if the the Industry tab had sub categories.",
    "problems solved": "Solving the problem of finding qualified leads manually. Benefits: saves time, gives me reliable leads."
  },
  {
    "Review Date": "07/12/2019",
    "Reviewer Role": "Marketing Manager",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I love the look & feel and the way you can search and target exactly to what you're looking for. You can use the results you prefer by selecting them and the unwanted results can be ignored. It helps to get a better understanding of the market we are in and to update our current company and contact info, as they refresh their data time and again. There's no real subscription, that's a plus too. Because the platform is flexible. There's nothing to dislike really. I wish I knew uplead before, it could have saved me from a lot of time that went to waste.",
    "dislike": "Nothing really...?! I have found nothing to dislike, I'm sorry. I have only found things to like thus far. So I couldn't tell you what's there to dislike. The platform is just spot on and meets all my expectations. So maybe I still have to discover the downsides of the platform, but I don't mind if my perception stays the same :) !!",
    "problems solved": "I'm finding more companies to gain a better understanding of the market. That helps to understand my companies and the way we can grow and to use the new contacts as leads. It also helps to update the content that I already have, because the data keeps refreshing and updating."
  },
  {
    "Review Date": "02/12/2020",
    "Reviewer Role": "Facilitator",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Uplead filters out and does not count leads with invalid email addresses.  I like that you can search the contact on Linkedin.  This allows for an additional level of verifying that the lead is a good lead to connect with.  It's a great companion to Social Media Marketing Strategies.",
    "dislike": "I have no dislikes.  I am able to find what",
    "problems solved": "I have cut my marketing dollar and am getting better results with Uplead."
  },
  {
    "Review Date": "07/24/2019",
    "Reviewer Role": "Owner / Voice Talent",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Able to save searches, Emails are current. The system keeps track of emails you've downloaded from previous searches so you don't download duplicates. Several ways to search potential clients, Customer service is fast and helpful, most issues fixed within minutes. The option to integrate with CRMs to keep email list workflow.",
    "dislike": "I haven't encountered any dislikes as of yet. I had two billing issues back to back, but they were corrected during a chat session with customer service. The system didn't recognize my payment change during a billing cycle.",
    "problems solved": "The problems I'm solving with UpLead are the ability of expanding my customer base through email marketing campaigns. I'm able to reach decision makers and thus cut time by contacting those people directly."
  },
  {
    "Review Date": "02/26/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The ease of use in finding the contacts that I am looking for. I was able to find the contacts for businesses that I was targeting. The search function is very thorough, and it allows you to filter down to very specific criteria.",
    "dislike": "The fees are the only disadvantage, but necessary. Otherwise, I am very pleased with the experience using UpLead.",
    "problems solved": "I am able to find the contacts for the companies that I am targeting for business leads. I have always known my target customers, but had difficulty getting in touch with the correct people. UpLead has helped connect me."
  },
  {
    "Review Date": "05/19/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The ease of use and being able to validate the email information",
    "dislike": "it was a bit tricky at first figuring out how to find a save search",
    "problems solved": "Finding qualified email lists"
  },
  {
    "Review Date": "11/06/2019",
    "Reviewer Role": "Director Of Operations And Business Development",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The ease of being able to locate new contacts for an ever growing industry and to be able to filter out many irrelevant filters that dont apply to us. Also, if a lead is not a \"good\" lead, we get refunded back that credit. That's a great concept and much appreciated that that ethic is promoted.",
    "dislike": "I have no dislikes at this time. I enjoy using this and will be more this winter!",
    "problems solved": "None at this time. I did notice my companies contact information isnt up to date."
  },
  {
    "Review Date": "12/05/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Up Leads site is very helpful by gathering leads in almost any configuration you need to gather data.",
    "dislike": "I don't care for the credits program. Unless you can afford the highest monthly plan 200 credits goes fast!",
    "problems solved": "UpLead data is helping me to contact the correct person I need to talk with for my publishing business,"
  },
  {
    "Review Date": "10/16/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "the ability to choose your criteria based from your specific vertical.  It is very easy to navigate and gives you lots of options to choose.",
    "dislike": "The inaccuracy of contact persons and contact #s.",
    "problems solved": "Makes my job a lot more quicker in specifically targeting only the verticals i needed to get in touch with"
  },
  {
    "Review Date": "03/11/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "When looking up contact names and e-mail address the accuracy has been great.",
    "dislike": "Uplead needs to have more company listing in a geographical area, as in my area there are no company listing for some bigger size firms.",
    "problems solved": "I have been able to find e-mail address for contacts that I have not been able to find in other places."
  },
  {
    "Review Date": "04/14/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The fact that the account information is accurate and it's easy to use.",
    "dislike": "I have not found anything I dislike yet.",
    "problems solved": "Speed is everything. I need names, titles, phone numbers and email addresses as well as up to date information on companies to minimize the amount of time it takes me to get to the right decision maker for our companies services."
  },
  {
    "Review Date": "10/17/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "There's an incredible amount of filters that you can add that leaves you with the leads you want - other lead generations services don't compare and you end up wasting a lot of credits and in turn a lot of money. It's a very nice UI / UX and it really was easy for our team to pick and start using right away.",
    "dislike": "So far we've not run into any issues with the platform, it does exactly what we need it to do and it does it very well.",
    "problems solved": "We're looking for extremely specific leads at a very fair price and thus far we've had a great amount of success using UpLead."
  },
  {
    "Review Date": "03/17/2020",
    "Reviewer Role": "Lab Tech I",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I liked that this system was intuitive and easy to use",
    "dislike": "If this system had an integrated CRM or some additional plugins I would pay more for it",
    "problems solved": "We have managed to find several companies that were in need of our services in other states and markets that we aren't as familiar with."
  },
  {
    "Review Date": "01/29/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The UI is nice and user-friendly, all the needed functionalities are easy to access and the results of the queries are presented in a clear way. The integration to Hubspot CRM works well.",
    "dislike": "The industry categories that are our primary target group was not easy to find.",
    "problems solved": "We are entering new markets and Uplead has helped us to understand who are the players we need to address. With Uplead we are saving a lot of time."
  },
  {
    "Review Date": "02/12/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The speed of the search engine and its precision. Expected results in no time :)",
    "dislike": "When searching for company contacts by web page address was a bit tricky. I had to put the address certain way, as in with www prefix and/or https:. But  it wasn't really a problem",
    "problems solved": "Without UpLead, finding certain leads would not be as easy. Besides it saved me lotta time and effort."
  },
  {
    "Review Date": "04/08/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The leads are very complete.If you have question. They responded right away.",
    "dislike": "The formats to save or download your leads could be more simple.",
    "problems solved": "The direct email to the business. Closer chance to a sell"
  },
  {
    "Review Date": "04/22/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Easy to use interface. You can just type in info and it shows right away.",
    "dislike": "No listings for some businesses which I would appreciate.",
    "problems solved": "Finding people's email addresses"
  },
  {
    "Review Date": "12/04/2019",
    "Reviewer Role": "Prospecting Agent",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The ease of use, its not complicated to navigate at all.",
    "dislike": "Naics codes arnt readily available, kinda have to search for them, does show partial on main page, but I always need the full code for my work.",
    "problems solved": "Better contacts, better email addresses"
  },
  {
    "Review Date": "08/22/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "As a small business I don't need a robust lead generation tool, and UpLead is just what I need. I can pay by how much I use, and not subscribe for a whole year. It's perfect for my needs!",
    "dislike": "There's no function (that's I've seen) to request additions to their library. I'll often have a contact I need the information for, and have no way to ask UpLead to source and add that person. Similarly, there's no function for me to let UpLead know if a contact or email in their system is no longer relevant.",
    "problems solved": "I'm working with sales, and using UpLead I'm able to find the right person to connect with at each company. I also love the LinkedIn button function! It makes it really easy to confirm that the contact is still working at the company in the most relevant role."
  },
  {
    "Review Date": "05/22/2019",
    "Reviewer Role": "Sales & Marketing Coordinator",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Working with UpLead is intuitive, but like most prospecting tools, knowing the search criteria goes a long way for the best results. That said, the amount of accurate information I receive for contacts is extraordinary.\n\nCustomer support ~ my rep is Russel ~ is quick, concise, and not overbearing. I think UpLead is a hidden gem.\n\nWhat surprised me was how accurate the results were. Companies with a myriad of contacts are listed as a result and, when you select one, you're given a list of all contacts within that company. This simplifies my efforts immeasurably.",
    "dislike": "One complaint is the inability to search by a specific radius around a city, metro area, or zip code. A quick workaround is searching by county. May have to fine tune the results, but it solves my issue.\n\nAlso, although UpLead integrates with many CRM platforms, the one, our company, uses isn't among them. Luckily, my customer support representative, Russel, provided a quick workaround.",
    "problems solved": "I was recently hired into a company with virtually no marketing department. The website is worse than zero and so are many other facets. One of the duties assigned to me is lead generation. I introduced the idea to management and used UpLead as an example. I gave them a no BS objective overview of the features/advantages/benefits and used the free credits to illustrate how effective the tool is for prospecting.\n\nAlthough my initial focus is bringing our website into 2019 for the very short future, UpLead is the primary tool for helping us grow!"
  },
  {
    "Review Date": "08/11/2023",
    "Reviewer Role": "Chief Executive Officer",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The real time Organic Vertical Contact ability.",
    "dislike": "When I find something I let the community know.",
    "problems solved": "Onboarding process With Top Producers."
  },
  {
    "Review Date": "10/21/2019",
    "Reviewer Role": "Founder & CEO",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Interface is simple to use and the data quality is quite solid. We use UpLead's data as part of our marketing outreach to businesses as well as for developing new audiences for client campaigns.",
    "dislike": "It would be nice for their to be somewhat easier tracking of leads already seen but *not* downloaded. But this is very minor.",
    "problems solved": "UpLead is making our prospect research much much easier."
  },
  {
    "Review Date": "03/11/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I get to control the parameters and receive exactly the list I need in order to make significant return on my investment.",
    "dislike": "Nothing. My experience has been wonderful so far.",
    "problems solved": "Affordable bulk leads"
  },
  {
    "Review Date": "07/10/2019",
    "Reviewer Role": "Financial Advisor",
    "Company Size": "Enterprise(> 1000 emp.)",
    "like": "I liked the CRM integration that it allows for making seamless transition to contact leads.  I also liked that it allowed you to search multiple industries and titles of employees at once which would give you a much more complete list of people within your search criteria.  I also like the fact that you can look up companies by revenue, # of employees and their industry. being able to identify contacts this way works well for those trying to target a specific market or company size.",
    "dislike": "Locating leads and their region.  At times I was provided leads that we not within my physically and geographical location so I would have to sort through the list provided in order to find those contacts which were more relevant to my location.  I am also not a huge fan of the locating feature which does not allow you to sort through the leads based on location.",
    "problems solved": "I am looking to increase my lead generation to make more sales - I have realized more genuine contacts with the leads I got form UpLead.  The information provided as far as phone numbers etc. has been spot on within my experience so far.  I have used other services and some numbers are disconnected or the person is no longer with the company so the information I got from UpLead on their contacts was all up to date and very accurate."
  },
  {
    "Review Date": "08/21/2019",
    "Reviewer Role": "Head Of Growth",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like that the data source provides the option to only charge credits for valid emails. Overall, their system is logically laid out that any sales team can adopt.",
    "dislike": "Overall the UI could use some work. There are specific things that could potentially be manipulated better with state management and updating the view. I think its clunky how long it takes to search for a filter, then clicking done in-order to retrieve the updated list.",
    "problems solved": "Clean Data, we've realized that compared to other data sources they don't charge for bad data."
  },
  {
    "Review Date": "12/04/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Uplead is as good a lead generator that I have seen but is much for cost effective for my needs.",
    "dislike": "Sometimes there are no emails available for a contact, but then there is no charge for the download which is appreciated.",
    "problems solved": "We are new to the platform and are still working on integrating it into our regular lead follow ups, but I anticipate that it will work well for us."
  },
  {
    "Review Date": "09/25/2019",
    "Reviewer Role": "Sales Development Coordinator",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I think the price is absolutely justifiable for the results that you get. The interface is super easy to use. Search by title and geography are my go-to filters.",
    "dislike": "I don't like that there aren't direct numbers for contacts yet..but maybe that is roadmap??",
    "problems solved": "I'm able to get company emails and also search for prospects that would otherwise take a while to find through google searches and cold calls."
  },
  {
    "Review Date": "09/25/2019",
    "Reviewer Role": "Managing Director",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Uplead is very intuitive, easy to learn.  And it has extensive integrations into most CRM solutions.  I use Hubspot, and with the Uplead Hubspot interface, with one click I can upload the contact info for a target prospect into Hubspot with email address, contact info, etc!  Very easy to use, to learn, you get near immediate results and value.",
    "dislike": "Sometimes names and contacts you would think would certainly be found, are not.  So it is not a 100% end-all in prospecting, but it is accurate at least 90% of the time.",
    "problems solved": "Finding contact info for specific people within a target firm, and easily importing into Hubspot"
  },
  {
    "Review Date": "08/21/2019",
    "Reviewer Role": "Chief Operating Officer",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Excellent customizability of searches by many useful parameters, easy-to-use interface, transparent pricing, no big upfront commitment. Detailed data output.",
    "dislike": "Nothing. The experience was excellent from sign up to download of data.",
    "problems solved": "Need a starting point for developing a lead generation database to increase catering sales. The Upload data gives us an excellent foundation to build on."
  },
  {
    "Review Date": "02/12/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Easy to use and find contacts through search.",
    "dislike": "Some emails do not work for OEMS and larger companies.",
    "problems solved": "Building out contact list and important players."
  },
  {
    "Review Date": "03/18/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "After using many data sources.  I find that upload has accurate date.  They do not charge you if the emails are not verified.  A wide ranges of search criteria and industries allows us to focus on specific targets.  Good value for the money!",
    "dislike": "Lack of phone numbers. Mostly 800 numbers or general corporate numbers.",
    "problems solved": "Prospecting"
  },
  {
    "Review Date": "10/16/2019",
    "Reviewer Role": "Supply Chain Account Manager: Supply Chain Solutions (CPUs/GPUs/Memory/Storage)",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The ability to target business decision makers by Industry-Company-Department-Title-and level.\nThis really allows you to drill down into a company's org chart.",
    "dislike": "Have not found anything I dislike. Very easy to use.",
    "problems solved": "Getting to decision makers as well as getting to contacts I never knew existed at target companies."
  },
  {
    "Review Date": "09/11/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Enterprise(> 1000 emp.)",
    "like": "The way the data is organized and can be filtered is quite helpful and make data management a lot easier than other lead websites.",
    "dislike": "I wish I could load more results per page, since it made a lot of page reloads necessary to view all data without downloading lists.  I also wish they made peoples names, like names.  For example there are a lot of names that are like John Doe, MS, MBA ... or Dr. John Doe.  This ideally would already be cleaned up and defined as first and last names.",
    "problems solved": "A way to get data and augment and use it for filtering and email generation"
  },
  {
    "Review Date": "03/12/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The option to put in words for a \"title\" is very helpful, especially as titles have become so complicated lately.  So if I'm looking for someone specific to AI/ML, I can input that into the search field.",
    "dislike": "Sometimes I can't always find what I'm looking for.",
    "problems solved": "Getting the right contacts, cross referencing, market research."
  },
  {
    "Review Date": "01/29/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Ease of use and variation of leads. Price is great too",
    "dislike": "Not all the contacts I want to download are verified to not bounce",
    "problems solved": "Need for new contacts to reach out to, which I'm finding on UpLead"
  },
  {
    "Review Date": "05/08/2019",
    "Reviewer Role": "President and CEO",
    "Company Size": "Enterprise(> 1000 emp.)",
    "like": "The ability to identify that the firm is public as well as the ability to zero in on specific industry segments and sales and business development functions",
    "dislike": "would like to be able to download multiple contacts at a time when the exact email address cannot be verified - this requires me to do up to 10 individual downloads for a single company",
    "problems solved": "we are a startup and need cold leads to start the process of encouraging contacts to request a session with us to discuss how we can improve their sales success rate. We have had over 50 contacts click to request further information about our solftware and consulting solutions."
  },
  {
    "Review Date": "09/25/2019",
    "Reviewer Role": "Owner/ Yoga Instructor",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "It's intuitive and user-friendly. I love that I can sort out prospects by location, industry, titles ect... It also shows their LinkedIn profile so all the information is sorted out in one place",
    "dislike": "Absolutely, nothing. It's absolutely amazing!",
    "problems solved": "In just one month of utilizing UpLead database, I was able to open 6 new accounts with completely new clients simply by sending cold emails to let them know about the services that I can provide. So basically money in the bank!"
  },
  {
    "Review Date": "03/21/2019",
    "Reviewer Role": "Account Executive",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "When I first got into the freight brokering industry I did all my prospecting my self. It literally took me hours to get 10 good leads which drastically limited how much time I had to spend on bettering my customer service. With Uplead I can get 100 quality leads and send out emails to those leads in roughly an hour! Now I can spend almost all of my day strengthening the bonds with my customers rather than hopelessly searching the web for leads and guessing email addresses! Uplead give me the ability to find accurate, high quality leads in a flash!",
    "dislike": "I would like to see more industries/companies that I could use as potential customers. There are a lot of companies like nurseries, telecommunication companies, schools, and digital service companies that would have no use for my services so there information is pretty useless. I would like to see more companies on here that have large volumes of freight to move on a regular basis.",
    "problems solved": "As a freight broker I have two main duties, finding new customers and servicing current customers. Uplead helps me do both better! With Uplead I spend less time prospecting which gives me more time to take care of my customers."
  },
  {
    "Review Date": "04/08/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The verification of emails, which makes the platform trustworthy.",
    "dislike": "They should provide some more free credits.",
    "problems solved": "I'm reaching out to software engineers for having a view on potential job openings for me."
  },
  {
    "Review Date": "11/08/2019",
    "Reviewer Role": "Founder",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The Uplead dashboard accesses the data in a user friendly way allowing excellent drill down through all the filters you should need. The technology filter is my favourite and let’s the user focus in on users of specific tech.",
    "dislike": "inevitably there are some entries which are out of date but this does seem within acceptable limits",
    "problems solved": "Fast access to identifying members of my target audience"
  },
  {
    "Review Date": "08/21/2019",
    "Reviewer Role": "Sales Development Representative",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Interfaces are simple to use and takes about only 4 minutes of getting used to.",
    "dislike": "Color of texts are very light, sometimes its hard to see and read.",
    "problems solved": "Some emails are incorrect, and searches might be bugged under Contacts / Companys etc and some prospects are outdated\n\nMade my job alot easier with the linkedin button, address , etc (information is great)"
  },
  {
    "Review Date": "02/27/2019",
    "Reviewer Role": "Software Engineer",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "With uplead the interface is easy to use. I loved that fact that I can upload a list of URLs and it spits out contacts from those companies with verified emails.\nOther services want you to bring the first and last name of your target and sometime the company name as well.\nWith uplead, they do all the hard work for you. It is the easiest lead tool to use and by far the most accurate. And for the price, you can't beat it.\nI also like the fact that when I signed up one of support girls ( Nicole) checked in with me regularly to see how I was doing. She also offered to pause and extend my trial if I needed more time or if I wasn't ready to start.\nI asked her to pause the trial, which she did. When I was ready to get started agin she reinstated my trial so I could continue. I thought that was so thoughtful !",
    "dislike": "Nothing when it comes to the product itself. But their support could use some work!\nOh one thing I have to say is that, Initially I sign up for a free trial for 100 leads , I was getting used to the interface and must have made some kind of mistake while playing around with the data. but when I tried to get my 100 leads as promised I got a message saying I had already used all my leads. I emailed support twice with no response.\nI was surprised at how poor their response/support  team was. I still haven't heard back from them.",
    "problems solved": "I target tech companies for my business. I needed a platform where I can upload a list of the select startups and get all the contacts and email addresses I need based on the URLs I put in. Uplead did that and then more."
  },
  {
    "Review Date": "07/24/2019",
    "Reviewer Role": "Vice President of Enterprise Sales",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The multiple search capabilities is one of the biggest asserts to the system. I can search specific companies or contacts by a wide range of options.",
    "dislike": "I would like to to a dual export option. Spreadsheet and CRM at the same time.",
    "problems solved": "I am not trying to solve problems, I create opportunity. UpLead helps me create a robust sales pipeline that in a fraction of the time it would take a small team of people to do."
  },
  {
    "Review Date": "10/07/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Not a lot of unuseless features, only the ones you will need to generate, download to your CRM and get in touch with new leads/clients.\nNot a lot to say about uplead, but only that it does what it promises",
    "dislike": "nothing to be honest we like all upLead provides\nwe are really happy with upLead",
    "problems solved": "We are using uplead to generate new leads and get in touch with"
  },
  {
    "Review Date": "12/04/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Enterprise(> 1000 emp.)",
    "like": "Easy to see ROI. Shows me a direct path to the people I need to talk to.",
    "dislike": "It was exactly what I have been looking for.",
    "problems solved": "Made work easier and faster"
  },
  {
    "Review Date": "12/05/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Plenty of leads available which is already helping to improve my revenues.",
    "dislike": "The only negative that I have found is that there isn't an easy way to report errors in the information.",
    "problems solved": "No real problems. I have benefited from the leads that have been generated."
  },
  {
    "Review Date": "12/05/2019",
    "Reviewer Role": "SaaS Account Manager (Customer Success Manager)",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "They have almost every single contact at all of the companies. Theres no gaps with contacts and divisions or organizations missing",
    "dislike": "Nothing. It is priced so well for the value",
    "problems solved": "I'm trying to find targeted contacts to reach out to."
  },
  {
    "Review Date": "02/08/2019",
    "Reviewer Role": "Sales Rep",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Not only did I find so many leads, but when I needed a bit more time to decide if this would be the best lead generator for our team, the very helpful customer service reps actually reached out to me to see if I needed more time. They really seem to care about making sure I had the best tool to use on my sales efforts.",
    "dislike": "There were a couple places that I already had confirmed contact info for, and while these companies did show up on the UpLead search, a couple had some incorrect info. It would be great to have a 'suggest an edit' option, where users can offer correct info that they may already have, to better help others in the future.",
    "problems solved": "As our company grows we're expanding into other markets that we're not as familiar with. UpLead helps give us a head start at gathering contact leads in those markets."
  },
  {
    "Review Date": "07/24/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "well the company, location , email, people and specially their position",
    "dislike": "I guess its like the minimum and downloadable content. Im using other websites to generate leads which is more affordable but uplead is more accurate",
    "problems solved": "It made it easier for me to target the right companies like large industries."
  },
  {
    "Review Date": "11/06/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I can easily locate contact information for key targets",
    "dislike": "Some emails aren't available, which can be difficult.  However the \"typical\" format is available which is usually correct",
    "problems solved": "We are a start up, so finding good contacts to start soliciting to was very hard, UpLead has been a game changer for us"
  },
  {
    "Review Date": "01/30/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Ease of use. You will get even small and big companies leads easily.",
    "dislike": "Nothing such till now. Expecting some full fledged data for middle east and asia.",
    "problems solved": "I dont have to hire a lead generation which saves me with lot of cost savings"
  },
  {
    "Review Date": "09/25/2019",
    "Reviewer Role": "Principal",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The fact that I can segment by not only industry and role, but also by geographic region makes Uplead the most valuable tool I've seen yet for creating my digital ad agency's prospect mailing lists.",
    "dislike": "I haven't discovered anything I don't like about Uplead.",
    "problems solved": "No problems, however I've decreased my prospecting research costs by more than 65% per month."
  },
  {
    "Review Date": "10/03/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like the steps they take to ensure the info is accurate. It is easy to search and there are ways to really dial down your list. Also the price is great!",
    "dislike": "I wish there was more people in the database.",
    "problems solved": "Prospecting and email bounce rate"
  },
  {
    "Review Date": "12/05/2019",
    "Reviewer Role": "Business Development Executive",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "It's very intuitive, easy to use, and the data is accurate.",
    "dislike": "I would have liked to have seen more direct dial telephone #'s.",
    "problems solved": "Increasing the accuracy of our contact data for prospecting."
  },
  {
    "Review Date": "09/26/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I like how easy it is to navigate and the filters that enable quick targeting of lists",
    "dislike": "I don't like that there are no direct dial numbers and that the vast majority of numbers for contacts seem to just be the main corporate office number.",
    "problems solved": "It makes looking up corporate headquarters addresses and numbers easy. And it makes it very easy to search by job title."
  },
  {
    "Review Date": "07/24/2019",
    "Reviewer Role": "B2B Sales Rep",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I really like the LinkedIn feature that links the leads LI account to their UpLead info.",
    "dislike": "I don't like that you guys don't automatically erase an email address from your database when it is inactive or incorrect.",
    "problems solved": "UpLead is helping us get our name out to new industries and markets that we have had trouble penetrating in the past."
  },
  {
    "Review Date": "06/19/2019",
    "Reviewer Role": "Technology Environment Consultant",
    "Company Size": "Enterprise(> 1000 emp.)",
    "like": "Simply put, Uplead helps me find the people I am looking for. Their easy to use solution allows for quick lookups and fast finds. Reliable information on prospects help my sales funnel grow and my deals close.",
    "dislike": "I like everything! On very few occasions, a contact has left to go somewhere else and the old info has not been updated yet - but this is very rare.",
    "problems solved": "Helps me find the right people and contact information. This leads to a great Prospect funnel."
  },
  {
    "Review Date": "06/05/2019",
    "Reviewer Role": "Member",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "UpLead has allowed me to target from a variety of fronts.  I can build a list of companies to target based on industry, location, size, etc.  I can also dig into a company that I know I want to target and obtain emails for decision makers that I want to contact and/or follow-up with.",
    "dislike": "There is always the disappointment when I see the perfect lead and get an oops message that their email is not available :(",
    "problems solved": "UpLead interfaces with Zoho CRM seamlessly and it has proven to be a huge time saver - and for a small business that needs all the time they can get....that's huge!!!"
  },
  {
    "Review Date": "01/09/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The real time verification of emails and validity of working with current email ...better than all the rest",
    "dislike": "Not having enough personal time to extract more data",
    "problems solved": "The easy to use interface and not having to peel layer after layer"
  },
  {
    "Review Date": "09/11/2019",
    "Reviewer Role": "Sales Team Lead",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The fact that contact information is verified",
    "dislike": "The verticals are very broad making it difficult to dial down into our ICP.",
    "problems solved": "Finding contact information for potential clients."
  },
  {
    "Review Date": "01/12/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Filter options and save search results are very good.",
    "dislike": "Company detail page should be more improved.",
    "problems solved": "It's allow us to direct land on LinkedId page for respective contact/company which help us a lot and time saving for finding contact/company for requirement."
  },
  {
    "Review Date": "09/26/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Enterprise(> 1000 emp.)",
    "like": "The most useful aspect of Uplead is the quality of information I'm able to gather. It's usually an issue of finding current data when I've used other sources. Save time and become more productive with Uplead!",
    "dislike": "Not much to complain about. It's mostly finding time to do the deep dive and produce outreach mail and emails",
    "problems solved": "I've solved one major problem by using Uplead; quality of contacts. It's nice to know you're receiving current information vs old data that leads to nowhere."
  },
  {
    "Review Date": "08/21/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "There is a lot of good information and I like the direct link to LinkedIn.  I also like the direct import into Zoho CRM and the ability to export data into a csv or excel file.",
    "dislike": "If you accidentally get out of the search, it disappears and you have to start over.  It would be nice to have better batching export functions.",
    "problems solved": "We found a lot of contacts with not a lot of effort"
  },
  {
    "Review Date": "08/07/2019",
    "Reviewer Role": "Sale Account Executive",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The Search  feature works well and is easy to navigate . I like the drop down option",
    "dislike": "It took a while to learn how to narrow down searches . I didn't like that i could not export lists during my free trial. If you want someone to use you service. give them full access during a trial. this was really the only down side i was to this trial",
    "problems solved": "it's a good site to find prospects"
  },
  {
    "Review Date": "02/02/2019",
    "Reviewer Role": "Energy Advisor",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I love the fact that I am able to get verified emails for my marketing campaign. It's makes it very easy when you have verified emails.",
    "dislike": "As I use upleads and still learning the ins and outs, I have not come across any dislikes as of yet.  It is very simple and easy to use from my point of view.",
    "problems solved": "Upleads provide email addresses and that is what I need to make my campaigns successful to business owners. Not only are the email addresses are important, I am also able to get the name of the owner or owners for that company.  I can search for small or large businesses and it makes it so easy to do."
  },
  {
    "Review Date": "06/19/2019",
    "Reviewer Role": "Project Manager",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Very helpful so far to get us the leads that we need for email marketing!",
    "dislike": "The percentage of Valid emails is a little lower than I would ideally like, but other than that it's pretty darn good!",
    "problems solved": "It is immensely more helpful to be able to draw from UpLead's database instead of searching for pre-made lists from list vendors. And for a very reasonable price."
  },
  {
    "Review Date": "05/29/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Uplead is more affordable that most and produces solid, reliable contact info for our sales team to run with.  The search feature is great. I can search a company with the criteria I am specifically looking for. As broad or narrow as I'd like.",
    "dislike": "There are times when contact info is out of date or not verified. Fortunately Uplead lets you know before download their contact info!",
    "problems solved": "Our sales team can spend more time following up leads instead of trying to produce new leads. Letting my team know when a contact may be out of date or isn't verified is exactly what I am looking for. Other sites won't tell you if information may not be reliable."
  },
  {
    "Review Date": "05/22/2019",
    "Reviewer Role": "BROKER ASSOCIATE (SALESMAN)",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "UpLead gives me the ability to search across all 50 states for CEO's in my selected industries to execute a direct email campaign.  I am able to filter out all non-verified e-mail addresses cutting down on costs  as I am charged only for the leads I actually download to my CRM or Excel.",
    "dislike": "There is a learning curve to use UpLead. However, online support is quick and precise so very little wasted time getting the hang of it.",
    "problems solved": "I am able to easily identify high net worth prospective buyers of real estate in my area."
  },
  {
    "Review Date": "08/21/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I found UpLead to be easy & intuitive to use.  Contact information has been accurate and ip-to-date, and pricing is reasonable.  I am very happy with UpLead!",
    "dislike": "The only negative experience I had with the tool was when I exported directly from UpLead to Insightly (using the built-in integration).  The leads arrived in Insightly minus the company name.",
    "problems solved": "Providing \"current\" lead information to my salesperson."
  },
  {
    "Review Date": "05/08/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I love how easy it is to find the specific leads I need, that I can sort by geography, industry, revenue and management level - even which technologies they use! Company info and descriptions make it easy to do research very quickly, and helps me make more calls a day.",
    "dislike": "Not having company descriptions under the lead contact info is a little disappointing, although the platform does change pages quickly when you click on the company to get the description. There's currently no integration with our CRM, Close.",
    "problems solved": "I have a lot of targeted leads for a very reasonable price. Instead of manually building email and calling lists, or buying expensive outdated lists, I can pay a set amount and get exactly the contacts that I want. I also spend a lot less time doing company research, which means I can make more calls and close more deals."
  },
  {
    "Review Date": "12/04/2018",
    "Reviewer Role": "Sr. Business Development Manager",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I really like the built-in search ability and the way that things can be filtered.  I also like it that that Uplead offers an entry price level and monthly charge vs. having to make an outlay for the year with a commitment. Overall it's a great tool for helping me to find new target accounts and to get contacts to reach out to. It also has 30 Million Contacts which is 10M more than zoominfo offers.",
    "dislike": "Some companies that I want to target aren't in the database. I would like to see a way to request that some accounts that I am looking for to be added so that I could let your team know what I need from this product. We also use Sugar as a CRM and it would be great to have an easy way to transfer contacts to my CRM.",
    "problems solved": "Finding contacts at my target accounts more easily than before I had this product. I have been able to easily construct a list of target accounts and contacts that I wouldn't have been able to without having this database."
  },
  {
    "Review Date": "09/25/2019",
    "Reviewer Role": "Director of Recruiting",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "It has a ton of great companies and it feels like they are constantly updating the data",
    "dislike": "Some smaller startups can be harder to find even",
    "problems solved": "It makes it VERY easy to find contact information for the targets for our sales team"
  },
  {
    "Review Date": "04/10/2019",
    "Reviewer Role": "Founder",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I use subscriptions to sales databases to get clients.  I've used Addatabase, The List and Redbooks.  UpLead has very similar functionality at a fraction of the price.  I just couldn't justify the price for Redbooks or The List.  So far, I'm very satisfied with the quality and the functionality and most of all, the price.  I don't know how Redbooks/The List can continue!",
    "dislike": "So far, I'm pretty pleased.  There isn't anything I dislike at the moment.",
    "problems solved": "Back to scheduling calls, and in person meetings."
  },
  {
    "Review Date": "01/30/2019",
    "Reviewer Role": "International Sales Manager",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I have used many CRM tools in my line of work and they all seem incomplete or hard to use.\nWith Uplead you have names, titles, phone numbers along with photos and company logos so you cant miss it.",
    "dislike": "Cant really say much about a dislike of the product. It has everything I need.",
    "problems solved": "I have been able to search for companies where I could not get a hold on an employee.\nPerhaps that employee has left but did not update their account information or a simple time zone issue.\nI can find other employees and get directed to the right person to contact."
  },
  {
    "Review Date": "09/25/2019",
    "Reviewer Role": "Business Development Manager",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Very simple and intuitive interface. Information seems very current.",
    "dislike": "I can't find any direct integration capability for ACT.",
    "problems solved": "We were having problems with the accuracy of information. We now have faster access to good contact information."
  },
  {
    "Review Date": "04/16/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The look and feel of the website makes it easy to navigate, plus you can search for companies/contacts by numerous technologies.",
    "dislike": "There are two major issues here but they all go back to data quality. The data quality is very poor even when compared to the free alternative, Data.com. During my trial, I noticed two glaring issues.\n\nFirst, when searching for contacts at a company, I found many contacts that had left the company many years ago. A simple LinkedIn search of that contact confirms this too.\n\nSecond, while the Search by Technology feature has a massive list of technologies, it's not accurate. I found that 75-80% of the companies that appeared while searching for a particular technology did not actually have or use it. It's a cool feature but needs major re-tooling.",
    "problems solved": "We wanted to improve the quality of our data but haven't really been able to do that."
  },
  {
    "Review Date": "04/24/2019",
    "Reviewer Role": "Sr, Business Development Director",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "There seems to be a much larger pool of prospects within UpLead's database than most other solutions I've tried.  Both contacts and companies, but, more importantly, the emails supplied are very high quality with low bounce rates.",
    "dislike": "There is a bit of a rough area when trying to add on multiple filters to searches (i.e.multiple states) but I found it simple to workaround, so no problem at all.",
    "problems solved": "I am a heavy prospector and UpLead has given me a very robust resource to get what I need quickly."
  },
  {
    "Review Date": "12/04/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Ease of use and I can look at targeted industries.",
    "dislike": "Nothing to dislike, it is very straightforward.",
    "problems solved": "Having fresh leads to set appointments."
  },
  {
    "Review Date": "09/17/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Uplead helps us drill down to a specific person at a company to send a direct and focused email.",
    "dislike": "Seem to still fight the bounced emails.",
    "problems solved": "We are getting a better contact rate with our customer niche than other databases."
  },
  {
    "Review Date": "05/23/2019",
    "Reviewer Role": "vice president",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Simple to use Interface, Scaling Price Tiers, Credit Rollover per month.",
    "dislike": "I would be nice to adjust and save the width of columns.  I'd like to filter search result by multiple columns.",
    "problems solved": "Uplead helps us stay current on new companies in our area.  Uplead helps us find like customers that need our services."
  },
  {
    "Review Date": "11/06/2018",
    "Reviewer Role": "Director of Marketing",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The ability to define target attributes and see details about potential contacts before purchasing is very helpful. This allows you to verify that the contact meets your target criteria. I also like the ability to save searches and Uplead applies email validation to the selected contacts and allows me to choose to purchase or not based on email validation results - nice feature. Although I also apply additional email validation, this real-time updated validation is a good feature for this service. The direct integration with my email solution is beautiful and saves me a lot of time. The cost is very reasonable for the contacts I am able to target and the pay-as-you-go model is very flexible.",
    "dislike": "Nothing to dislike really -  it works as advertised for a very competitive price. I would like to see the database continue to grow, see the data validation continue and the price stay affordable.",
    "problems solved": "Targeted contact outreach, marketing qualified lead generation, growth of marketing database."
  },
  {
    "Review Date": "01/23/2019",
    "Reviewer Role": "VP, Client Partnership",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The UpLead website is clean, understandable, and more importantly easy to use. Within a few minutes, I felt comfortable utilizing UpLead's tools to help grow my sales pipeline.",
    "dislike": "It is sometimes difficult to identify a specific company when there are multiple search results with the same/similar name. UpLead does include logos when possible which does help significantly with clarity.",
    "problems solved": "I utilize UpLead to fill my pipeline with prospective clients with the long term benefit of increasing revenue for our company."
  },
  {
    "Review Date": "06/19/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "From the free trial to uploading my first list for data enrichment, I was impressed by how fluid the process was.",
    "dislike": "The database isn't as big as some of their competitors (which they are upfront about) but the experience and value is arguably better.",
    "problems solved": "Data enrichment. It's great for quick ad-hoc pulls."
  },
  {
    "Review Date": "09/25/2019",
    "Reviewer Role": "Director of Business Development",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "the software is very easy to use and they're quick to help",
    "dislike": "There happens to be quite a bit of bad data",
    "problems solved": "finding good  info"
  },
  {
    "Review Date": "08/08/2019",
    "Reviewer Role": "Growth Manager",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "it being user friendly and u can only see the data u want and not waste time on the unrelenting prospects",
    "dislike": "u dont have data by name. all the contacts are not direct numbers\nand there is less information on l&d",
    "problems solved": "its enabling the sales and marketing team"
  },
  {
    "Review Date": "05/22/2019",
    "Reviewer Role": "Insurance Broker",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like how its easy to create customization list by industry, employee title and location. Makes it easy to find the exact industry I want to target.",
    "dislike": "I wish there was integration with more CRMs. We use Applied Epic, a very popular insurance CRM, so it would be useful if it was included.",
    "problems solved": "I am solving the problem of a slow pipeline, when i need to hit he pavement and find good clients with reliable info I go to Uplead."
  },
  {
    "Review Date": "08/07/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "the fact I can gain access to good prospects",
    "dislike": "the CSV export file did not come as arrange as it is on the platform.",
    "problems solved": "the fact I can gain access to good prospects. Being able to export y refined search"
  },
  {
    "Review Date": "04/24/2019",
    "Reviewer Role": "Sr. VP of Business Sales",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Easily down load targeted lists. Find contacts that cant be found in Google. Often can help you find your contacts email address. Stop paying list generators thousands of dollars when you can get the same thing from UpLead for way way less!",
    "dislike": "Always with the direct dials and emails were there but nothing is perfect.",
    "problems solved": "List Generation and finding Correct Contacts. Spend way less time buying lists and finding the correct contacts. Way less phone calls need to be made when the info is right there."
  },
  {
    "Review Date": "06/19/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like the  speed of the searches and how granular you can get. You can find the right individual at the right company to reach out to every time.",
    "dislike": "Well there i snot much to dislike, but perhaps having to refine the single search criteria to get results is an issue. You have to remove things like spaces between companies with 2 names to find results",
    "problems solved": "We have no sales team but are always looking for businesses to partner with and individuals to work with. This tool helps us find those results very quickly."
  },
  {
    "Review Date": "04/10/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The Interface is clean and easy to navigate, the lists are complete with all company and contact info that was expected, emails were verified before leaving the application, and only the verified contacts were downloaded, it was just really quick and easy and painless and the price was right! highly recommended!",
    "dislike": "Nothing at all everything was satisfactory and as expected",
    "problems solved": "Lead generation/qualification."
  },
  {
    "Review Date": "04/10/2019",
    "Reviewer Role": "Client Strategy Manager",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "We have been able to easily find decision makers at potential clients at a very affordable price, especially for a branch office of only 2 people. The email formats and contact info are very accurate. Being able to create and save lists of both companies and contacts has saved us hours of creating our own spreadsheets as well.",
    "dislike": "Emails bounce back on occasion, but that is why you supplement this with other methods of finding names.",
    "problems solved": "It has made finding potential clients a much more time-efficient endeavor. From finding companies to contacts, we can do it all on UpLead"
  },
  {
    "Review Date": "10/09/2018",
    "Reviewer Role": "Creative Director",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like the interface, the functionality, and the overall quality of the sales leads. It's easy to navigate, and there are now international contacts as well.",
    "dislike": "Not much to dislike from my end.\n\nSometimes the system experiences a bug/glitch. But that's maybe once a week in a while. I like the interface. It's dependable. The quality of sales data is above average compared to Sales Info, or Sales Genie. Data quality is inferior to Sales Force. Although Sales Force is way more expensive. UpLead is a LOT  better in terms of the value for dollar ratio.",
    "problems solved": "As a new small business, our mission was to get notoriety with industry leaders, and gatekeepers. And we accomplished exactly that. The pairing of UpLead with an email marketing app was a great two punch combo for our business. Targeting industries is seamless, and intuitive."
  },
  {
    "Review Date": "03/27/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The interface design is easy to navigate. I don't have to waste time creating a dataset, I can easily narrow down a search and focus on my target audience. I don't struggle or waste time having to find criteria.",
    "dislike": "It would be nice to have a search criteria on last updated. This way we could know how old the data is or be able to verify the likelihood the data is accurate. Companies can have a high turnover so being able to see that the information has been updated recently or hasn't been touched for a year or two would be beneficial. Overall, the majority of the data has been useable and accurate.",
    "problems solved": "We use UpLead when we want to expand/grow our database. If we want to expand into a new industry or strengthen our outreach into specific areas or regions."
  },
  {
    "Review Date": "07/30/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Uplead have a great video that explained how to use their platform. After watching the video, I was able to dive in and test out their platform.  Had the option to search for what I needed and the ability to hand pick each records.  Have the option to avoid any catch-all records.",
    "dislike": "Not sure if there's an option, but I would like to sort the list to not list any catch-alls.",
    "problems solved": "Uplead would help with our marketing efforts in-house."
  },
  {
    "Review Date": "04/24/2019",
    "Reviewer Role": "Owner",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like that you have the ability to know your contact prior to engaging them. You also can limit the types of contacts you are targeting. This makes it much easier to set up strategic campaigns.",
    "dislike": "No much so far. The product has been pretty good. Pricing may be too high for the amount of credits you receive may be one issue.",
    "problems solved": "Reaching direct contacts in a short amount of time. It actually is cutting down the sales cycle."
  },
  {
    "Review Date": "07/29/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The quality I like best about UpLead is the way the data is organized.  I can search for leads using very granular classification by SIC and NAICS code which saves me time and money.",
    "dislike": "Not all of the leads within UpLead are qualified or valid so response rates are not as high as if I were to source leads by hand.",
    "problems solved": "Needing to source large amounts of leads under tight deadlines.  Have realized major time savings in my process."
  },
  {
    "Review Date": "05/22/2019",
    "Reviewer Role": "CEO",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "This platform is an all around great tool! It allows me to easily search key decision makers, and provides me with several forms of communication with them. I highly recommend",
    "dislike": "I don't currently have any issues with Uplead. I've been very happy with the results.",
    "problems solved": "I'm able to build my email campaigns and integrate Uplead with Woodpecker quite easily. This is saving me a ton of time, rather than manually copy & pasting."
  },
  {
    "Review Date": "04/24/2019",
    "Reviewer Role": "President",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Easy to set-up plan.  There is no pressure selling and I appreciate the month to month flexibility. I reviewed Zoominfo and B&D and uplead was superior in flexibility",
    "dislike": "during the trial period I could not download to an excel sheet. I suggest that you offer more features, possibly the leads prior positions and companies they worked for.",
    "problems solved": "finding industry lead names and e-mails.  I have done my own research in the web and can not find the information in linkedin."
  },
  {
    "Review Date": "07/24/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "We have enjoyed the very custom search capabilities.  The contacts we have gotten have been great",
    "dislike": "I would say the downsides are the same number being listed for the organization and not having extensions- if anything",
    "problems solved": "We are mapping out potential clients"
  },
  {
    "Review Date": "05/23/2019",
    "Reviewer Role": "Owner",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The targeting. It allows me to really dial it in.",
    "dislike": "Seems like some industries are a bit thin in leads.",
    "problems solved": "I have been able to solve my problem of getting ght to the decision maker."
  },
  {
    "Review Date": "03/26/2019",
    "Reviewer Role": "Sales Executive",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The ability to search and then narrow down that search to find the ideal client. The ease of use and layout.",
    "dislike": "I really didn't dislike anything. I know I wanted some info on a company and I couldn't find them listed.",
    "problems solved": "I am able to find numerous details that help with finding clients. Such as the size of the business, and key employees."
  },
  {
    "Review Date": "06/05/2019",
    "Reviewer Role": "Sales Partner",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I like that it not only provides you with contact information, but also the title of the employee so you know exactly who you are looking for.",
    "dislike": "Occasionally the information is not valid",
    "problems solved": "Contacting owners and C level employees that I struggle to reach via phone"
  },
  {
    "Review Date": "07/31/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "As a Sale/Marketing colleague it allows me to  research contacts at companies with emails included.",
    "dislike": "There are some additional companies that UpLead will want to include.",
    "problems solved": "Identifying decision makers at key accounts."
  },
  {
    "Review Date": "06/05/2019",
    "Reviewer Role": "Chief Commercial Officer",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The reliability of data, ease of navigation, and compatibility with our CRM system.",
    "dislike": "There really isn’t anything I don’t like.",
    "problems solved": "Prospecting organizations and qualifying leads"
  },
  {
    "Review Date": "12/06/2018",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I thank you a lot for developing Uplead. It has been my favorite data set for sales activity. For me it doesn't have any complicated features or is too much of information either and is easy to use when I just want to filter out our targets and collect contacts to reach out.",
    "dislike": "I don't or can't know if the data is old or frequently updated. I found some titles looked suspicious which led me to feel like I would have to double check the extracted data with the third party network.",
    "problems solved": "I purely used it to start building relationships with our new sales prospects. The benefit I appreciated the most was that I could get the detailed contact data of the target companies."
  },
  {
    "Review Date": "04/03/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like how you can narrow down your search through options (titles, location, etc) - no need for me to type in the specifics. I also like that I am provided with business contacts of the leads. So easy to navigate.",
    "dislike": "If only there's a way to completely eliminate invalid data from the get go; i understand that no credit is deducted, but it will still be helpful if only verified data can be maintained.",
    "problems solved": "Ensuring that I source valid lead information, it provides me the things that I need quick."
  },
  {
    "Review Date": "12/04/2018",
    "Reviewer Role": "Tele-consultants",
    "Company Size": "Enterprise(> 1000 emp.)",
    "like": "It shows all the results and as accurate as possible. You can search on how you want to get the results. This is really an awesome tool!",
    "dislike": "I can only think less credit for the first trial period. It could have been better if credit increase for first time users so that they can explore and enjoy more this tool. It will definitely higher chances to recommend this to colleagues and possible endorsement to use in the organization.",
    "problems solved": "Finding contacts just using the web url, name of tje company or person within the organization. It helps to call the business companies with confidence as you know whom you need to speak with without worrying that you cannot bypass the gatekeeper. Also it shows their contact details which is really helpful especially the email address."
  },
  {
    "Review Date": "12/04/2018",
    "Reviewer Role": "Co-Founder - Business Development",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "It is simple to use and very affordable.  I was able to sign and start using within minutes.  While the others took days just to call me back.",
    "dislike": "The only thing that is could do better is close my deals for me.  Honestly, I do get a little confused with searching for a company name.  Sometimes I have to clear the criteria before searching again.  Or I have had to click on a saved search list and then search.  I may be doing something wrong.  Other than that I have found the tool very useable.",
    "problems solved": "We have over 5 verticals that we are targeting for our solution and this tools allows us to quickly find our targets and effectively contact the appropriate people to sell our solution.  We have a total of 4 sales persons that need contacts.  200 is just the start to see if that is enough to get started, I have feeling we will upping our subscription.  I had two leads that I contacted in the first day and they responded."
  },
  {
    "Review Date": "08/21/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I love the ease of use.  i also love the fact that it utilizes and email verification tool before you download the names.",
    "dislike": "There isnt much to dislike about this software in my opinion.",
    "problems solved": "Uplead has made my research time diminish ten fold.  List that used to take days take mere seconds now."
  },
  {
    "Review Date": "03/21/2019",
    "Reviewer Role": "Senior Business Development Specialist",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Affordable & accurate information at my fingertips quickly. This platform can give the likes of Discover.org & Zoom Info a run for their money!",
    "dislike": "Sometimes the sort by job title is a little buggy and does not sort completely. This is the only issue I see.",
    "problems solved": "I am able to find contacts to complete my list development needs for multiple campaigns my company uses. There is also business intelligence info that is very helpful."
  },
  {
    "Review Date": "01/14/2019",
    "Reviewer Role": "Director of Sales",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I loved the multiple search options and filters.  I was able to uncover many leads and contacts for companies I have been trying to get better information on for months.  This tool will certainly lead to me spending my time better getting a ton of great, quality leads.",
    "dislike": "I cannot think of a single improvement I would make on this tool.",
    "problems solved": "We are able to get better insight on some key decision makers within the companies and organizations that are key to the success of our company."
  },
  {
    "Review Date": "12/13/2018",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I'm a small business, so my budget is also small, I've been able to find great leads to grow my business.  Info has been reliable and accurate.  Easy to use and fast results to start adding to your contacts and expanding your database.",
    "dislike": "The industry options are limited, and sometimes I receive leads in the wrong industry, but I just skip those leads when making decisions on which leads I'll choose.  Would love more \"industry types\" to include healthcare professionals as that is not an option.  It's not been an issue as I can make other changes to get what I'm seeking.",
    "problems solved": "Recruiting networking contacts."
  },
  {
    "Review Date": "06/19/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The level of user experience, everything is intuitive and super friendly. I understood how it works even without any guides.",
    "dislike": "Some of the leads don't have correct links to linkedin (very low of number).",
    "problems solved": "Finding prospects from my profile very easily."
  },
  {
    "Review Date": "05/22/2019",
    "Reviewer Role": "Director",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The cost is a no  brainer and the compatibility with so many CRMs .",
    "dislike": "None so far. It is a bit of a self service model which is new to me but again nothing to dislike",
    "problems solved": "I am trying to get \"Clean\" contacts for sales funnel development. Again, the ability to get accurate data means everything."
  },
  {
    "Review Date": "03/21/2019",
    "Reviewer Role": "President",
    "Company Size": "Enterprise(> 1000 emp.)",
    "like": "The ability to identify a company list and too, then an individual, and linked in connection.",
    "dislike": "The information is not a current as Zoom Info and too not as comprehensive as Zoominfo.",
    "problems solved": "I am identifying prospects for my searches."
  },
  {
    "Review Date": "03/21/2019",
    "Reviewer Role": "Operations Manager",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "the ease of the site with the info at your finger tips",
    "dislike": "have not come across anything yet that i don't like",
    "problems solved": "quicker lead information turns into better conversations/conversion into customers"
  },
  {
    "Review Date": "08/07/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I love it when I can easily filter the data that I need",
    "dislike": "I hope you could add more filter enable for us to specifically get our target our audience",
    "problems solved": "We've realized that we could easily all contacts in one website, where we could easily filter data to get our desired contacts"
  },
  {
    "Review Date": "05/22/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Contact names, titles, direct lines or corporate numbers and email addresses.  Very easy to navigate through the website for information.  Able to export data.",
    "dislike": "I would like to see more direct phone number to contacts.  Everything else is great!",
    "problems solved": "We are a unique organization and industry leads contact information is hard to locate with just phone calls and internet searches.  We are saving time and finding the information we need with UpLead"
  },
  {
    "Review Date": "04/10/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The ability to dive deeper into company details including company contacts, emails, size, annual revenues, and even better, the technologies that they have implemented.",
    "dislike": "Not every company that has been looked up are in the database.",
    "problems solved": "New customer leads and competitive landscape detail."
  },
  {
    "Review Date": "05/08/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I can use a number of criteria to research prospects and customers. Simple integration with HubSpot to push contacts into my CRM. List uploads to find new leads at scale.",
    "dislike": "Not every company I researched came back with a result, but I understand that they are aggressively adding data to the platform.",
    "problems solved": "We have challenges finding our ideal customers with other list/data providers that fit within our budget ... UpLead has a solid combination of names/titles with verified contact details at a price that works for a lean start-up like ours."
  },
  {
    "Review Date": "03/22/2019",
    "Reviewer Role": "Director - Financial Services Recruitment",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like how easy it is to navigate across different tabs",
    "dislike": "There could be a wider range of emails available",
    "problems solved": "I am looking to business develop in to new clients as I have started a recruitment firm"
  },
  {
    "Review Date": "09/12/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Inclusion of relevant individual email and private company size information for many companies",
    "dislike": "Exclusion of some smaller private company information",
    "problems solved": "Positively, adds value to our process"
  },
  {
    "Review Date": "04/10/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Most helpful aspect of UpLead for me is the search functions. The platform lets me quickly hunt for prospects by plugging in the company website address. I always keep at least two web browsers up at the same time and I just switch back and forth searching for more information.",
    "dislike": "Sometimes you see contradicting email formats within a company.",
    "problems solved": "I use UpLead to generate contacts to reach out to and the biggest benefit is the simplicity of the platform. There are no extra unnecessary aspects. Lead and Info...Perfect."
  },
  {
    "Review Date": "06/19/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Reliability of the e-mails\nEasy user interface\nQuick customer service",
    "dislike": "Nothing yet. It seems to work well and I look forward to continue my use.",
    "problems solved": "Lead generation."
  },
  {
    "Review Date": "02/13/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "UpLead is a great B2B lead database. From granular search queries to full contact data including 'valid' email addresses is very helpful for my insurance practice. Contact records also include the prospects LinkedIn profile which is a huge plus.\n\nThe monthly subscription is also very competitive making the cost per record very inexpensive. I highly recommend this platform for any lead gen initiatives.",
    "dislike": "I wish there was Chrome plug-in as I use LinkedIn Navigator extensively.",
    "problems solved": "I use UpLead to find specific prospects within local DMA's."
  },
  {
    "Review Date": "03/22/2019",
    "Reviewer Role": "Owner/CMO",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The simplicity of this software is everything we were looking for. Accuracy is also far better than many of the other platforms we've tried.",
    "dislike": "Can't say there's anything negative we can say about this software.",
    "problems solved": "Sales and lead identification and generation."
  },
  {
    "Review Date": "03/21/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "That the emails are verified before you have to use the credit and your not wasting crredits on leads that are no longer good..",
    "dislike": "The way that it is layed out and the way the search is.. It can be a bit difficult to figure out how to use but all in all it is a nice platform",
    "problems solved": "Prospecting and finding access to decision makers contact"
  },
  {
    "Review Date": "05/28/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "i don't see any upside of the site... i think the Uplead stand among the best.",
    "dislike": "there is nothing i dislike but i want the site to be more upgrade and more easier to use for searching",
    "problems solved": "the searching might be easily for a member without a demo of how to use the site"
  },
  {
    "Review Date": "02/27/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I love how easy UPLEAD makes it to search for companies or contacts and the information provided has been accurate.  I feel UPLEAD's pricing is very affordable for the service provided.",
    "dislike": "I've been using data services for a while and I haven't found anything I dislike about UPLEAD yet.",
    "problems solved": "We have to search for companies in a geographic area -- UPLEAD has been vital to our expansion into a new market this year."
  },
  {
    "Review Date": "10/23/2018",
    "Reviewer Role": "Owner",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I love UpLeads ability to filter their data via all the means I need to build the perfect data set. I had talked to numerous other providers of competing services, but onl UpLead could provide the powerful filtering that I required to isolate the exact data set I needed.",
    "dislike": "It did have to submit a couple of help queries to figure out how to download my datasets, and to understand how to exclude existing data. But, Customer Service was fast and Super Helpful and I got all my answers.",
    "problems solved": "I am using UpLead for Cold Email prospecting.\n\nThe filtering capabilities are exactly what I need for a few 'complex' queries that other companies could not help me with."
  },
  {
    "Review Date": "09/12/2018",
    "Reviewer Role": "Director of Marketing",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The portal comes ready to use out of the box. We were able to target very specific titles and gain access to leads very quickly. The ability to include exclusions by uploading a file or from previous downloads in UpLead is extremely handy. Finally, their addition of technologies listed is excellent and very extensive.",
    "dislike": "The database does have a few hiccups. First, the contact properties aren't completely standardized and can lead to issues upon importing to your CRM. Furthermore, even with an exact match specified, we found ourselves with irrelevant contacts that slipped through the cracks. Luckily the team at UpLead was quick to reimburse us the credits to make up for the odd miss.",
    "problems solved": "It's great for generating a list of prospects in your funnel. Keep in mind that if you are a really targeted business you may only find a limited amount of leads. However, UpLead doesn't lock you into a contract so you aren't tied to the platform after you have exhausted your searches. It allows you to get away for a short period of time and come back when they've updated their database with more contacts."
  },
  {
    "Review Date": "05/09/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "easy to browse and collect data works good, easy to explore .",
    "dislike": "nothing much to dislike, price could be little competitive, can concentrate more in US data",
    "problems solved": "IT Leads and helpful"
  },
  {
    "Review Date": "02/27/2019",
    "Reviewer Role": "Financial Advisor",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The ability to choose exactly what kind of leads you want.",
    "dislike": "Going back to page 1 after a lead download.",
    "problems solved": "Generating emails with a phone call follow up."
  },
  {
    "Review Date": "07/24/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "its ability to find the accurate information about prospect.",
    "dislike": "There is nothing to be dislike about this.",
    "problems solved": "I can now focus more on sales rather than thinking about data."
  },
  {
    "Review Date": "08/01/2018",
    "Reviewer Role": "Head of Operations",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I would have to say the simplicity of the platform is what I like best.  Not too many extra bells and whistles just what I need to do my prospecting",
    "dislike": "Not as much data as I like and questionable at times, I get revenue figures that seem out of line and I'll find inconsistencies like it telling me that a company has 1 to 4 employees but lists 150 email addresses, makes me less than confident about the freshness of the data.  Also when doing my cold emails I usually get 30 to 50% of my email addresses scrubbed after spending hours prospecting a list of candidates to reach out to",
    "problems solved": "I can affordably prospect, many tools out there that offer a similar service are very expensive."
  },
  {
    "Review Date": "04/10/2019",
    "Reviewer Role": "Vice President of Sales & Operations",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The search capabilities are extremely simple and easily can download into our CRM - HubSpot.",
    "dislike": "Wish the phone numbers were more up to date. It seems to give the company's main number more than the contacts.",
    "problems solved": "Building an intelligent CRM"
  },
  {
    "Review Date": "06/21/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Enterprise(> 1000 emp.)",
    "like": "The navigation part was very easy to use",
    "dislike": "Trail period and credit allotted was very very less",
    "problems solved": "Able to get list of companies.\nEasy to find out the decision maker"
  },
  {
    "Review Date": "03/21/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The system is easy to use.  You can figure it out without any training.  Uplead does provide simple videos to assist.",
    "dislike": "Wish there were more contacts available per company.",
    "problems solved": "Great place to obtain contact information for business professionals."
  },
  {
    "Review Date": "09/26/2018",
    "Reviewer Role": "Gerente",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "UpLead allows you to filter the search by several different criteria. The best part is that only e-mail addresses which are tested to be valid are deducted from your credits, so you don't waste credits on bad leads.",
    "dislike": "The trial is somewhat small, so to actually test the data quality of the platform you need a plan.",
    "problems solved": "We're growing our e-mail database with quality and focused leads."
  },
  {
    "Review Date": "02/13/2019",
    "Reviewer Role": "Founder",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I like that the companies are broken down by employees, position Titles and valid emails.  It makes communication much more effective.",
    "dislike": "Sometimes, the phone numbers do not appear to be verified and lead to nowhere.",
    "problems solved": "If nothing else Uplead has allowed me to see how a company is made up with respect to Decision makers and pertinent positions."
  },
  {
    "Review Date": "02/01/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "It's super easy to use and all the info is relevant and up-to-date. My favourite service",
    "dislike": "All is great! There is nothing I didn't like about UpLead",
    "problems solved": "The speed of searching for business contacts and leads is a priority in my job. And UpLead is beyond any other services - it makes my work super convenient"
  },
  {
    "Review Date": "11/01/2018",
    "Reviewer Role": "Digital Marketing",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Web based application with important features to sort out required database as per needed! I highly recommend Uplead as database provider. It provide lot all database which covers almost all industries!",
    "dislike": "Need to add more specific features like platforms, technology and also needs to increase scope of database",
    "problems solved": "Required database for marketing campaigns and here is my solution!!"
  },
  {
    "Review Date": "12/12/2018",
    "Reviewer Role": "National Sales Manager",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I’ve used a lot of products lie uplead non have stood close to the results I’ve gotten using this service. I’m very impressed how easy and fast results come back and I can verify all the information I need to find the lead and build my business. If you’re checking similar platforms and you don’t have the budget to pay $10K $15K per year check out UpLead first, highly recommended!",
    "dislike": "...my only regret is I didn’t find Uplead sooner!!!",
    "problems solved": "Transparency and critical information!"
  },
  {
    "Review Date": "03/21/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "It's brought leads to our sales team in minutes.",
    "dislike": "Nothing, it's been a great product and has worked for my company.",
    "problems solved": "Getting corporate account information that has reliable information."
  },
  {
    "Review Date": "12/04/2018",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Ive use many alternatives like Uplead, what I like the most is the seamless feel its simple and easy to use.",
    "dislike": "I don't necessarily dislike anything about it but I don't think they have a linkden plugin",
    "problems solved": "Getting in-touch with the right people and not the wrong ones"
  },
  {
    "Review Date": "04/24/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like that I can acquire the e-mails of all IT managers in a specific zip code and confirm they are valid.",
    "dislike": "I can not look up individual companies. I also cannot look up individuals.",
    "problems solved": "Creating lists in new zip codes that have emails"
  },
  {
    "Review Date": "04/17/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Enterprise(> 1000 emp.)",
    "like": "It gets me to the correct person to speak to with minimal clicks of the mouse. That is the key reason i use\nUP lead",
    "dislike": "There is nothing to dislike about this company, they do the job properly and with great implmentation",
    "problems solved": "Access to upper marketing directors"
  },
  {
    "Review Date": "01/22/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I find UpLead very intelligent and easy to use and provides lots of filters to specifically choose your target audience.",
    "dislike": "There’s nothing I don’t like about it I’m just waiting for additional features and integrations",
    "problems solved": "Finding prospect clients quickly and saves us a lot of time"
  },
  {
    "Review Date": "12/14/2018",
    "Reviewer Role": "Sales Manager",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I used this database for a trial period and was very pleased with the information and how it works.",
    "dislike": "The was nothing I do not like during use.",
    "problems solved": "I have got many contacts information which was useful for my business."
  },
  {
    "Review Date": "10/03/2018",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I used to be a client of Zoom Info but i wanted to find an alternative without be forced to take an one anual deal. UpLead is really easy to use and ergonomy is really efficient. It was easy for me to find my target persona. I would definitely recommand UpLead for your Outbound needs.",
    "dislike": "For some companies there is no data available which means there are still progress to be made.",
    "problems solved": "Try to find interesting contacts for Marketing Agencies in the USA."
  },
  {
    "Review Date": "08/01/2018",
    "Reviewer Role": "Director of Sales",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "UpLead is a very intuitive platform and cross references different filters to make fine tuning a search more effective.",
    "dislike": "It doesn't seem to integrate into our particular CRM but the download functionality makes up for that, but that is a small thing that we can live with.",
    "problems solved": "We can identify a target list based on the criteria and also we can validate a target to that we make the time we spend prospecting work for us"
  },
  {
    "Review Date": "01/22/2019",
    "Reviewer Role": "Unified Communications and Enterprise Networking Solutions",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Ease of search and matching contacts. Good value as well!",
    "dislike": "Nothing so far.  Only recommendation is to work on getting more direct phone numbers.",
    "problems solved": "Data appends became easier!  Saves time and money!"
  },
  {
    "Review Date": "12/19/2018",
    "Reviewer Role": "Salesperson",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Uplead gave me a lot of great leads to build my clientele, very happy with their platform. The information is accurate and efficient.",
    "dislike": "The search engine doesn't get every company",
    "problems solved": "Sales. The benefits of contacting buyers to expand my sales."
  },
  {
    "Review Date": "01/23/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I love how you get a list of current employees and you can decide whose email address you'd like to unlock.",
    "dislike": "Lack of leads in Central and South America.",
    "problems solved": "I am able to get contact information of c-level employees."
  },
  {
    "Review Date": "11/05/2018",
    "Reviewer Role": "Business Development Research Manager",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "UpLeads is very easy to navigate.The data seems to be both accurate and up to date. We received almost no email bounces which is great as we have been disappointed with the data quality of similar vendors in the past.",
    "dislike": "The tool does not have access to database of leads in Europe or other continents, so far you can only acces the database in North America",
    "problems solved": "research"
  },
  {
    "Review Date": "12/04/2018",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Can search by a huge variety of parameters that allows for a very specific and focused search.",
    "dislike": "There are really no features that I  have used so far that are negative.",
    "problems solved": "Sourcing a large list of leads in order to maintain and develop a pipeline as it pertains to my business channel."
  },
  {
    "Review Date": "01/30/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Easy to use, and great prices, and good search results",
    "dislike": "Nothing really,  just the industry search could be easier",
    "problems solved": "Email marketing"
  },
  {
    "Review Date": "10/30/2018",
    "Reviewer Role": "Associate",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Great information source for business professionals looking gather market intelligence",
    "dislike": "Nothing I can think of right now.  I used the site for a while and it has been a very pleasant experience.",
    "problems solved": "We are looking to gather more market intelligence. When we are better informed, we can be more competitive as a business."
  },
  {
    "Review Date": "12/04/2018",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I would recommend everyone to go with Uplead as it is the most reliable and best leads portal to rely upon. Please stop thinking and start using Upleads now.\n\nRegards\nSam Stephen",
    "dislike": "To be honest, there's nothing bad about Upleads at this moment.",
    "problems solved": "Medical Billing and Appointment Settings"
  },
  {
    "Review Date": "08/21/2018",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like that I am able to get phone numbers without having to do too much work and not use any of my available credits.",
    "dislike": "I think the interface could be a little simpler to use.",
    "problems solved": "Looking for leads who work at companies with a mobile app and a prominent video player as we have our own which could be better for them to use."
  },
  {
    "Review Date": "08/02/2018",
    "Reviewer Role": "Manager Business Development",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "It has never been so easy to search for prospects - and it has never been so accurate.",
    "dislike": "Nothing. Well, in the perfect world it would be 100% free - but still, the pricing is fair. Very good.",
    "problems solved": "My email campaigns are at the top now - thanks to UpLeads"
  },
  {
    "Review Date": "03/03/2019",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Leads are real i am happy with Uplead and always So much Happy",
    "dislike": "I dont dislike anything as of now i like moreAsqu",
    "problems solved": "We are trying to Market our Software Products"
  },
  {
    "Review Date": "12/13/2018",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Enterprise(> 1000 emp.)",
    "like": "This helps us in our internal lead generation which is vital for our business",
    "dislike": "All looks fine as of now. Might be when used extensively, I might find something",
    "problems solved": "Leads and contacts"
  },
  {
    "Review Date": "08/01/2018",
    "Reviewer Role": "CEO and Founder",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The search filters seem to work well and the system does not seem buggy. it's also ver affordable and easy to scale up and down",
    "dislike": "Salesforce intergration is super basic and the UX takes a bit of getting used to",
    "problems solved": "I source all my leads from uplead. So 90% of my business comes from it"
  },
  {
    "Review Date": "08/06/2018",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "We subscribe to countless services out there.  Uplead is by far the fastest and the filters blow everyone else out of the water.",
    "dislike": "I wish we could set a maximum of contacts per company to pull out.  On some big companies, it ends up pulling 10+.",
    "problems solved": "We run the top outsourced SDR firm in the US.  Although we only use Uplead of ~10% of our leads, it helps give us new ideas for lead lists and helps us really narrow in on DMs when other sources are having trouble."
  },
  {
    "Review Date": "04/26/2018",
    "Reviewer Role": "Account Executive & Digital Strategist",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I liked the idea of pulling solid leads based on current softwares that companies are using.",
    "dislike": "The vast majority of the information on UpLead (especially email addresses) are incredibly out of date or just flat out inacurate",
    "problems solved": "I was hoping to solve the problem of having to google individual companies, see who sits in specific roles with them and then find their contact info, but unfortunately the site doesn't give what is promised."
  },
  {
    "Review Date": "04/04/2018",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The search by sector and job position and of course searching by state and by city is very helpful.\nThe system is foolproof, but as always when you dealing with business most of the time is difficult to get through to the right person that replies to your emails.",
    "dislike": "Been an American website, the worldwide features are a bit limited, and just an example United Kingdom email/company are a bit limited, but i am sure it will be improved.",
    "problems solved": "My contact database is growing exponentially, and I can reach more people in my area. Reaching more people gives me the ability to talk to more prospect and generate more business."
  },
  {
    "Review Date": "10/23/2018",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Easy and quick to use. Customer services is always available to help with any questions. We've used UpLead as a tool to assist with targeted campaigns.",
    "dislike": "The email database could use some improvement, but overall the quality is great!",
    "problems solved": "Generating a very specific list of prospects to add to marketing/sales efforts, which has already produced $$$ for us! There is no contract with Uplead and the interface is really easy to use. We will continue using this as an essential prospecting tool."
  },
  {
    "Review Date": "04/03/2018",
    "Reviewer Role": "Director of Marketing",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I have used UpLead with our sales team to get data for a highly targeted could outreach email campaign. The data seems to be both accurate and up to date. We received almost no email bounces which is great as we have been disappointed with the data quality of similar vendors in the past. Also, we were looking for very specific titles within a small niche and uplead delivered.",
    "dislike": "Including Twitter handles for the leads would be nice.",
    "problems solved": "As a marketer, Uplead helps me to generate leads for our B2B sales team's email outreach."
  },
  {
    "Review Date": "08/01/2018",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Uplead can get granular with desired criteria. I like being able to select 1 contact per company.",
    "dislike": "I wish Uplead used NAICS codes and also had a better way to search for an industry of leads. EX: I want Food Safety leads but there is no SIC for that. It makes it very difficult to find these specialized leads.",
    "problems solved": "I'm finding new leads, which is nice."
  },
  {
    "Review Date": "10/30/2018",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "UpLead allows you to use SIC codes to find exactly the niche you are after and then you can use their other filters to tighten up on your target.",
    "dislike": "In order to integrate with Copper it requires an API code.  So I guess I dislike Copper's stance on this - lame!",
    "problems solved": "Identifying people within organizations that can benefit from our live webcasting service and software."
  },
  {
    "Review Date": "09/20/2018",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Simple clean interface, easy to use. Filtering out details was fun to work with.",
    "dislike": "dislike is a strong word, though the quality of info is something that can be worked on.",
    "problems solved": "Trying to find an additional sources to gather relevant contact details."
  },
  {
    "Review Date": "02/13/2018",
    "Reviewer Role": "VP Marketing",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The price per lead of $0.29 with their monthly professional subscription is a very good deal. It's also great that they allow you to cancel anytime without the need to sign a yearly contract which is quite important especially for startups. UpLead is also very easy to use but at the same time quite powerful",
    "dislike": "The tool does not have access to database of leads outside of the North America region, It would be helpful to see this expanded to Europe.",
    "problems solved": "I have used UpLead to generate a list of high-quality leads for our ABM / outbound campaign. We were looking for very specific titles within a group of specific companies, and the tool managed to provide us with very good results. It was very quick and easy to generate the list."
  },
  {
    "Review Date": "09/10/2018",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The way how they structure Uplead makes it very user-friendly, you can easily narrow down your options.",
    "dislike": "For improvement (but I know they're working on it): Database outside US.",
    "problems solved": "Industry/competitor research. Technology solutions."
  },
  {
    "Review Date": "08/06/2018",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Their validation tool works very well for cleaning bad emails!",
    "dislike": "Nothing at all, everything works and performs beyond my expectations",
    "problems solved": "Getting valid emails for my prospects!"
  },
  {
    "Review Date": "10/30/2018",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Ease of use and pricing structure.  Love the api.",
    "dislike": "Not much to dislike about it.  Some additional selection criteria in api would be nice.",
    "problems solved": "We needed a way to prospect into specific positions in specific companies.  UpLead allows this."
  },
  {
    "Review Date": "08/20/2018",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "My research was really specific and UpLead brought me high quality contacts. Really user friendly.",
    "dislike": "I would like to obtain a bigger variety of industries in my field of research.",
    "problems solved": "Reach more potential clients/ideal customers."
  },
  {
    "Review Date": "08/10/2018",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The ability to fill in missing information on existing contacts in our database",
    "dislike": "Nothing at this point, tool is very simple to use",
    "problems solved": "Appending missing information for contacts in our database"
  },
  {
    "Review Date": "08/01/2018",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The ease of use on finding the leads, and the automatic removal of bad leads that are tested before assigning.",
    "dislike": "There is no consolidate list of all the names we have unlocked.",
    "problems solved": "Lead generation"
  },
  {
    "Review Date": "09/04/2018",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "How easy it is to use. Information is easy to find and valid most of the time. Customer service is great.",
    "dislike": "So far I can't find anything to dislike.. I love this software.",
    "problems solved": "Generating leads a lot quicker and easier."
  },
  {
    "Review Date": "05/04/2018",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like the most the search criteria and how easy it is to access them.",
    "dislike": "I think the UI could be a little bit improved",
    "problems solved": "UpLead helps me to find contact details of the person of interest for our business and it works like magic till now."
  },
  {
    "Review Date": "03/30/2018",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "User friendly interface for isolating the leads you need.  Great pricing to enable building a custom tailored database at reasonable cost.",
    "dislike": "Had a few initial bumps with dupes that were made good and 5 to 6 % bounces.",
    "problems solved": "Expanded access to relevant targeted prospects for our services and better lead flow."
  },
  {
    "Review Date": "02/02/2018",
    "Reviewer Role": "Head Of Design",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "UpLead has verified B2B emails for the contacts. UI is easy to navigate, search criteria is very detailed.",
    "dislike": "Nothing so far. Everything works as described and i never had any issues.",
    "problems solved": "Finding fresh contacts for our email outreach campaigns. Closed 6 new deals so far."
  },
  {
    "Review Date": "08/01/2018",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Enterprise(> 1000 emp.)",
    "like": "UpLead is very easy to use and provides great business intelligence information.",
    "dislike": "There isn't anything that I dislike about the program.",
    "problems solved": "Identifying companies and contacts for sales prospecting."
  },
  {
    "Review Date": "03/30/2018",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The UI is easy to use and navigate to what I need to do",
    "dislike": "Nothing so far really.  I know they just upgraded the targeting on the businesses so I will be going in and trying the new feature.",
    "problems solved": "We are using to prospect new leads.  It cuts prospecting time down."
  },
  {
    "Review Date": "03/30/2018",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Uplead has been very easy to use and has helped build our lead database.",
    "dislike": "There's not really much that I dislike about Uplead.",
    "problems solved": "Difficult to gather leads for the type of industry we are in and B2B in general.  Our lead generation has greatly benefited from this tool."
  },
  {
    "Review Date": "03/30/2018",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Pricing is incredibly competitive vs. other alternatives in the marketplace",
    "dislike": "Data availability doesn't match competition; however it appears to be improving over time",
    "problems solved": "Sourcing missing contact info for key prospects and/or sourcing prospects"
  },
  {
    "Review Date": "03/30/2018",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The addition of the \"most common email address used\"",
    "dislike": "Contact names are often old and outdated.",
    "problems solved": "insight into companies like revenue, location, etc."
  },
  {
    "Review Date": "04/05/2018",
    "Reviewer Role": "Co-Founder",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Easy to search, UpLead is least expensive compared to other options, UpLead verifies leads before export which is fantastic.",
    "dislike": "Not all leads are accurate, some are outdated.",
    "problems solved": "Finding prospect information effortlessly"
  },
  {
    "Review Date": "03/30/2018",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The search can be narrowed and really specific.",
    "dislike": "Some emails and contact information is not up to date.",
    "problems solved": "We are able to widen our Business relationships"
  }
]
