[
  {
    "Review Date": "01/13/2023",
    "Reviewer Role": "Marketing Consultant",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Being a new user with relatively simple needs to start with Uplead really makes it easy. The queries are simple to formulate...I needed to contact people with specific keywords in their titles in specific geographical areas. This took only a few seconds to do. Also used the exclusion feature......Really great UX for new users!",
    "dislike": "We have not encountered any downsides yet. I assume this may happen as I progress to sophisticated queries.",
    "problems solved": "Finding new leads"
  },
  {
    "Review Date": "02/07/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Technology choices and the filtering allows you to get the data you need.",
    "dislike": "Not much to be honest I think it's a great product.",
    "problems solved": "Finding accurate inexpensive data"
  },
  {
    "Review Date": "11/18/2022",
    "Reviewer Role": "Co-Founder and CEO",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Uplead is helping us to build lists of prospects for our company optimally, with accurate data.\n\nThe feature I love the most is the real-time validation, which helps us to ensure that the data we get is the real data we need.",
    "dislike": "The cost is a bit high, but this is an excellent investment to provide valued prospects to our sales team.",
    "problems solved": "It is easy to find emails of people for free, but prospecting with detailed filters and ensuring the data we get is real can be difficult.\n\nThe ability to search with a wide variety of filters and real-time validation are very good features."
  },
  {
    "Review Date": "11/29/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I LOVE UpLead.    It is simple to use, provides me tons of flexibility, has accurate information, and is a very good value.   I love the flexibility of my account management as well.    Even when I screw-up they come to my rescue and help answer my questions.",
    "dislike": "I can't save my search to an old search name.    Or I just don't know how to do that.    It isn't a show stopper.    I really like UpLead.",
    "problems solved": "I'm using it to find leads.    I started my small, sole proprietor, firm over two years ago and UpLead has been with me all along."
  },
  {
    "Review Date": "02/08/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Tons of manufacturing contacts.\nThe cost is low compared to other tools.\nThe info is accurate.\nA lot of data on companies.\nEasy to use.",
    "dislike": "Sometimes the info gets messed up when downloaded to a CSV file. I wish there were more companies. Overall it is a great tool.",
    "problems solved": "Determining the point of contact and other similar companies we may not have known otherwise."
  },
  {
    "Review Date": "02/21/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "They ability to search not only by company name, but industry, titles and NAICs codes.",
    "dislike": "Phone numbers are generally main phone line at corporate, minimal direct phone numbers and mobile phones are not always accurate.",
    "problems solved": "Its helping me identify contacts higher up in the company that are able to connect me to the right people in transportation"
  },
  {
    "Review Date": "11/22/2022",
    "Reviewer Role": "Managing Consultant",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Very easy to use and the data extraction is linkable to multiple systems.",
    "dislike": "Nothing so far.  I believe the system works well for my current needs.",
    "problems solved": "Helping us solve the difficult task of finding sales leads by using other systems like linked in or facebook.  The ease of use a good date is helping us when we are trying to grow our customer base."
  },
  {
    "Review Date": "12/29/2022",
    "Reviewer Role": "sales marketing",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Hello, Uplaid Team I am very well made in your conversation secondly this can be very useful in business I found it and marked about it which upload really help us to find out what it does one hundred percent. gives me the right information",
    "dislike": "I don't like the design of the software a bit",
    "problems solved": "I get a lot of sales marketing related information in it and perform very well in it."
  },
  {
    "Review Date": "04/17/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Love the accuracy of the contact info! Highly recommend! Much cheaper than ZoomInfo!",
    "dislike": "Nothing! Highly recommend Upleads services!",
    "problems solved": "Allows us to quickly find the proper email structures for leads."
  },
  {
    "Review Date": "07/12/2022",
    "Reviewer Role": "Senior Content Writer",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I love the database quality of the software. Also, the data is just accurate and a perfect fit to target the right B2B clients. The data is verified and helps on connecting with real qualified leads.",
    "dislike": "The only problem I faced was that sometimes the data was out of the region. Though, it was accurate but the geographical location was way too far than my target audience. So, it was the only problem I faced while using the software.",
    "problems solved": "The struggle of getting the right leads is only understandable if you are running a target specific business. When I started using Uplead, i was able to get in touch with the people who were actually great fit for my products. It also saved me a whole lot of time."
  },
  {
    "Review Date": "02/02/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Easy to navigate dashboard and accurate results.",
    "dislike": "I have enjoyed everything thus far.  I can't think of anything.",
    "problems solved": "This service allows me to quickly find email addresses."
  },
  {
    "Review Date": "12/13/2022",
    "Reviewer Role": "Roofing Contractor",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "It's very easy to comprehend and take action. You don't have to be advanced to take their steps and put them into action to see great results.",
    "dislike": "There was absolutely NOTHING I disliked about UpLead. They are a great company",
    "problems solved": "Helping me to get leads I otherwise wouldn't have got. That's priceless"
  },
  {
    "Review Date": "11/27/2022",
    "Reviewer Role": "Sales Executive",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The communication and support from the team are excellent for my business, and they offer one on one sessions on how to grow my business and make the most of my time and leads. Thanks, Uplead",
    "dislike": "I think Uplead can and should offer credits ina more budget friendly package so small businesses can also benefit from the advantages of Uplead and increase their business revenues.",
    "problems solved": "Getting me good and genuine leads without wasting my credits and money and allowing me access for a revert. Also helping me to choose the charges wisely with their tips and advice."
  },
  {
    "Review Date": "09/06/2022",
    "Reviewer Role": "Customer Support Specialist",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Uplead makes sales and lead generation easy, I love the fact that it is less expensive and user-friendly. The database and emails are very accurate. Highly recommended",
    "dislike": "Nothing really. Great tool. I would find my way around it and I got my solution. No fault for now",
    "problems solved": "Upleads solves a lot of sales and lead generation problems and I benefits most from been able to access an accurate and active B2B database that helps me to deliver great jobs to my clients as a lead generation specialist and a customer support expert. Makes working absolute easy for me, super amazing."
  },
  {
    "Review Date": "10/10/2022",
    "Reviewer Role": "State Coordinator",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "It is a great platform for data gathering and sales intelligence with access to numerous verified business contacts. There are also many packages to choose from.",
    "dislike": "I haven't really experienced any downside using UpLead. If I do encounter any issues in the future, I will definitely come back to write another review with the updates.",
    "problems solved": "UpLead has been helpful in tremendous ways. It helps me to verify emails, generate contacts from different countries, increase sales. It is a great account based marketing tool."
  },
  {
    "Review Date": "02/07/2023",
    "Reviewer Role": "Managing Partner",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Saves our team a lot of time trying to look up or guess a contact in our Zoho database.  Emails and phones are key to connecting with our clients and our data needs to be up to date!",
    "dislike": "Sometimes contacts aren't update but for the most part it's correct.",
    "problems solved": "Updated data management and missing contact fields for our clients.0"
  },
  {
    "Review Date": "09/28/2022",
    "Reviewer Role": "Supermarket Cashier",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "A simple yet amazing lead generation tool. I enjoy its user interface the most as it makes it easy to use the software without wasting too much time trying to figure out how to utilize it. It provides a wide range of search options that will unquestionably assist you in expanding your company at a reasonable cost.",
    "dislike": "None as of yet. I might change my review if I find something objectionable.",
    "problems solved": "It assists me in locating businesses looking for someone with similar skill sets to mine."
  },
  {
    "Review Date": "11/29/2022",
    "Reviewer Role": "Director, Business Development",
    "Company Size": "Enterprise(> 1000 emp.)",
    "like": "UpLead grants me instant access to the contact details I need while sharing valuable insights for me to use in my rapport building.",
    "dislike": "My only complaint is the limited hours in the day to use UpLead.",
    "problems solved": "UpLead connects the information gap from prospect to contact and allows rapid outreach to grow and expand my network."
  },
  {
    "Review Date": "01/23/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "That is verifies the emails and does not just give you bad data.",
    "dislike": "There is not much to dislike about the system. If you need contact information this is the system for you.",
    "problems solved": "I have been trying to guess emails up until now. I am able to save so much time by not having to send out a bunch of emails to wrong addresses."
  },
  {
    "Review Date": "02/24/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "UpLead is a very easy friendly to use  B2B data builder system. Data is critical to grow business and in that sense UpLead works for us as a network builder",
    "dislike": "I can not think about it as I am very satisfied with the system",
    "problems solved": "Lead targetting, data collector"
  },
  {
    "Review Date": "09/30/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Uplead is an absolutely amazing tool in generating business leads, it has a very friendly user interface which makes it easy for non tech-savvy people to use. The quality of the generated leads is unmatched by any other tool that I have previously used for my business.",
    "dislike": "So far, there is nothing to dislike about uplead, it has made reaching out to potential clients so much easier for my team and me. It is just excellent and easy to use",
    "problems solved": "Uplead is helping my business solve the problem of generating quality leads. As a business owner, the ability to reach out to as many clients as possible remains one of the determining factor of how successful my business would become"
  },
  {
    "Review Date": "07/12/2022",
    "Reviewer Role": "Wordpress Developer",
    "Company Size": "Enterprise(> 1000 emp.)",
    "like": "UpLead is my favorite tool for lead generation and organizing them, The most popular thing about UpLead is, its interface and UX at very reasonable prices. I highly recommend UpLead for startups and next-level organizations to use this tool for their purposes.",
    "dislike": "Nothing is perfect, but UpLead covers most features at less prices than other competitors so we can bear minor issues with UI styles. I hope UpLead team will update it soon.",
    "problems solved": "UpLead helped me in Lead Generation in my particular business niche, So I used it mostly because Its straightforward and easy to use than other similar softwares"
  },
  {
    "Review Date": "01/09/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Up to date data that is verified before you download the information and use a credit",
    "dislike": "Nothing negative to report as yet! Very happy",
    "problems solved": "Getting the contact details of key decision makers is always a challenge. Uplead helps us to identify these people quickly and in most cases, enables us to reach out to them."
  },
  {
    "Review Date": "09/06/2022",
    "Reviewer Role": "Direct Sales Agent",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Great experience with upload. Our sales increased through building connections with this tool. Prices more affordable than the alternatives and much more in stock.",
    "dislike": "There should be more awareness about this tool. Wish I had it easier.It is serving all my needs. So am good with uplead. It might not not be entirely perfect but uplead is best among others.",
    "problems solved": "It is helpful in building my connection and expanding my business. As a new company I don't find it difficult anymore reaching out to companies I want with their verified emails."
  },
  {
    "Review Date": "01/02/2023",
    "Reviewer Role": "Account Executive",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The most helpful part of UpLead is being able to search contacts based on companies or past companies candidates may have worked for.",
    "dislike": "Very few numbers are not accurate, but every now and again, we come across a bad cell phone number. This is common with lead generating tools.",
    "problems solved": "UpLead is helping our business to find qualified candidates and place them."
  },
  {
    "Review Date": "05/01/2022",
    "Reviewer Role": "Virtual Assistant",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "UpLead is really simple to use. When looking for leads, you may construct a filtered view of leads by job level, industry, income, title, business size, and so on (including very specific ones). In my opinion, the opportunity to cancel if required (without a contract) is a really nice offer. I created a list of leads for our campaign using UpLead. In addition, you can easily integrate it into a spreadsheet or import it in whatever format you desire.\n\nOverall, it's an excellent prospect database for future B2B businesses. Depending on your business type, such as Mid-Market (51-1000 employees) or Enterprise (> 1000 employees), and (this lead database is significantly less expensive than competitors in the market.",
    "dislike": "The biggest downside of UpLead is that it caters to the masses, collecting data from many platforms and websites, some of which are outdated and do not correspond to the age of information. It would be helpful if UpLead included mobile phone numbers for contacts.",
    "problems solved": "It's highly cost-effective, and there's no obligation. It is easier to find leads according to niche and sub-niches. Love to see our competitors in the market that are good fits to target them."
  },
  {
    "Review Date": "07/15/2022",
    "Reviewer Role": "Senior Business Developer",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "As a business development manager, lead generation is the most important daily activity for me and UpLead has solved a number of my problems by streamlining and making my lead generation procedures efficient and fast. The best feature that has made work easier for me is the accurate data of the company's employees. Before UpLead, I struggled with inaccurate data resulting in emails bouncing back and no productive lead generation but UpLead took away this headache with its robust API. The interface is super easy to use and lets you apply several filters to mould data according to your requirements.",
    "dislike": "The feature that needs improvement is in regards to updating data more often as sometimes it shows the information of the employees who have left the company because having updated information is helpful when building out lead lists to make sure we are contacting the right people and companies.",
    "problems solved": "Our lead generation team was in a rut as we had exhausted our database of leads by contacting them again and again and investing so many resources in building the contact database. UpLead gave our team a new perspective and a fresh start needed to turn the leads into sales. It helped us in saving our time by generating specific leads for us rather than wasting countless hours combing social networks and updating databases. It's an excellent value for money and has been the best decision for my company."
  },
  {
    "Review Date": "07/15/2022",
    "Reviewer Role": "Professional Freelancer",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I love growing my own and other people's businesses which UpLead makes it so easy. To grow your business, you need to know about other people and organizations and find them, which UpLead does very easily.",
    "dislike": "I haven't found anything to dislike UpLead yet. Because it helped me in a very nice way. So I like it very much and will suggest it to everyone. But it would be great to reduce the price a little bit.",
    "problems solved": "Finding leads from other organizations has been a great help in increasing sales in my business. As a result, I was able to showcase my products and other content with other organizations and their owners."
  },
  {
    "Review Date": "01/24/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The simplicity of the program. Unlike Zoom, its straight forward, easy and fast integration with HubSpot.",
    "dislike": "Nothing so far. Seems very straight forward and they are fast to respond to all quesitons in chat.",
    "problems solved": "We needed proper lead generation that was easy to sort, import and fresh. They are doing a great job here!"
  },
  {
    "Review Date": "07/12/2022",
    "Reviewer Role": "Assistant Chemist",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "UpLead is inexpensive and very reliable. Uplead is the best lead generation tool that I have used among the many tools used before. It has a very robust API and companies' contact data is very accurate. Data Reporting of the Uplead is very understandable and beutifully arranged. Furthermore, you can get the data of your own choice by applying filters and narrowing down your research even more. I am glad that I am a user of this software. This has made my work so easy than before.",
    "dislike": "I must say that I am a big fan of this software but in the beginning when I started to use this software I find its interface a bit confusing but once I get used to it it was like a piece of cake for me. Highly recommended for lead generation.",
    "problems solved": "UpLead has helped me in getting useful leads that have increased my Freelance business over the past many years. With UpLead I got potential clients from all over the world. Due to Uplead's excellent lead generation tools like search criteria, robust API, and customer-based intelligence I was able to narrow down my searches and find potential clients which was not possible before and I scaled up my business to 150 + people."
  },
  {
    "Review Date": "12/01/2022",
    "Reviewer Role": "Chief Operating Officer",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The simplicity of the platform and the value of paying for incremental leads as needed.",
    "dislike": "No downside to using UpLead - the service is exactly what they describe.",
    "problems solved": "The ability to gather leads in our area of business and demographic."
  },
  {
    "Review Date": "03/01/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I can refine my searches to specific titles & companies.",
    "dislike": "Some of the leads have moved companies. Many mails are not available",
    "problems solved": "Uplead simplifies the process of obtaining specific contacts within the company."
  },
  {
    "Review Date": "07/05/2022",
    "Reviewer Role": "Online research analyst",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "UpLead is the industry leader in business-to-business marketing. Its database contains more than 90 million contacts, which makes it perfect for business-to-business (B2B) outreach. Most connections have a wealth of information, including ways to get in touch with them, including phone numbers and email addresses. The availability of the contact information facilitated me getting in touch with potential clients that helped me expand my business. Moreover, the customer service was great and resolved all my queries. I acknowledge the support from Uplead and recommend it to others.",
    "dislike": "I believe that Uplead performs admirably for the purpose for which it is designed. But it has room for improvement in terms of user experience. The user interface (UI) is somewhat confusing and challenging to use. I think that it could be a bit more friendly to use.",
    "problems solved": "My team required an effective system to manage the workload with the expansion taking place so quickly. We needed a lot of leads to convert them into sales to increase our revenue. I am grateful for the prompt support responses because my team didn’t have the luxury of time. By forgoing the cost of potentially erroneous market research or contact lists, I saved a lot of money. Finding the ideal people to chat to can be accomplished with a few mouse clicks by using Uplead Services."
  },
  {
    "Review Date": "11/30/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like that you can refine your search before buying the leads.  Sometimes I spend hours refining my searches.  You can save you searches. As nd continue refining the next day if you like.  Once purchased you can download the leads multiple times.  Upload.com is a great platform.",
    "dislike": "The individual search criteria can be more descriptive.",
    "problems solved": "It is allowing me to identify sets of leads to add to my email and LinkedIn target lists."
  },
  {
    "Review Date": "08/30/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The quality of the leads they have is fine, there are tons missing",
    "dislike": "I bought a bunch of credits and didn't use them all at once, they said I could \"hibernate\" my plan to stop paying for more credits and finish out the ones I had. When I went to download the ones I had already paid for they said I cannot because I need to have an active paying plan (to use the credits I already paid for). So they will not let me access the data that I already paid for without paying them for more that I don't need.",
    "problems solved": "They're solving a problem that dozens of other companies are solving better. Try Slintel or Zoominfo instead"
  },
  {
    "Review Date": "02/28/2023",
    "Reviewer Role": "Employee Benefits Broker",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "How fast I can find company information.",
    "dislike": "Sometimes the information is not always correct.",
    "problems solved": "I mainly use uplead to get the contact information for the employee I need."
  },
  {
    "Review Date": "11/21/2022",
    "Reviewer Role": "Dir. of Business Development",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I enjoy having a \"go to\" tool to track down potential contacts.",
    "dislike": "Like any database, updating information within companies, adding new companies, etc., needs constant management.",
    "problems solved": "Tracking down contact numbers, email formatting, updated positions, confirming specific people and companies."
  },
  {
    "Review Date": "04/13/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "- Easy to use\n- Audience segmentation\n- Ability to review some details to ensure the list is exactly what you are looking for\n- Saved searches",
    "dislike": "- Include mobile phone numbers, not just landlines",
    "problems solved": "- Ability to reach our target audience, easier"
  },
  {
    "Review Date": "07/20/2022",
    "Reviewer Role": "Accounting Bookkeeper",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The experience with Uplead has been an amazing tool. This tool has better insights and a simple-to-use website especially ensuring the verification of emails and has excellent data accuracy. We’re always looking for ways to leverage our time.UPlead is a prospect database containing (B2B) businesses. Depending on your business types, such as Mid-Market 51-1000 employees or Enterprise > 1000 employees and this lead database are significantly less expensive than competitors in the market.",
    "dislike": "For me, UpLead hasn't found any dislike so far. Having updated information is helpful when building out lead lists to make sure we are contacting the right people and companies.  I highly recommend it.",
    "problems solved": "We’ve saved so much time, we were manually researching contacts before on Google now we can find emails and numbers for potential prospects fast. Using emails we run marketing campaigns."
  },
  {
    "Review Date": "11/29/2022",
    "Reviewer Role": "Account Executive",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "User friendly tool which has helped my organization sav thousands of rupees on marketing spends for leads. Very precise leads with verified emails and mobile numbers",
    "dislike": "Lack of variety in themes which could make the software easier on the eye. Nothing else to point out",
    "problems solved": "Email verification is a feature that seperate this tool from other B2B tools on the market. Yes we are more productive and the performance increased by 2x"
  },
  {
    "Review Date": "01/24/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Buyer intent data helps us target high probability companies.",
    "dislike": "Not many that I can think of.   A small quibble is the number of contacts that have left the organization, that we have to end up removing from the list.",
    "problems solved": "Too early to tell."
  },
  {
    "Review Date": "11/21/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Amount of leads per company plus Ease of use the ability to search persons and companies annd areas such as state countries cities etc. Good tool and easy to use",
    "dislike": "Sometimes it can be difficult if yu do not have correct spelling Interface is a little wacky and it is not as fast as I had  hoped for",
    "problems solved": "Some companies are not loaded  but many are so I can use to find info"
  },
  {
    "Review Date": "12/02/2022",
    "Reviewer Role": "Direct Response Copywriter",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "What was most helpful for me was the ability to narrow down my desired niche more specifically than other mediums like LinkedIn",
    "dislike": "I already have a CRM so there was no need for me to utilize that feature.",
    "problems solved": "Before Uplead I was searching other mediums for leads like LinkedIn and the Book of Lists for my area but Uplead allows for a greater number in one place."
  },
  {
    "Review Date": "04/12/2022",
    "Reviewer Role": "Consultor de investimentos",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "A tool that provides an exponential gain in prospecting customers in a fast and personalized way with a selection of the type of contact, company or title. Agile, simple and intuitive platform that makes it easy to find new contacts with quality and precision.",
    "dislike": "The platform met my expectations, it provides me with the main tools for daily use. It is not complete, but it meets the needs as a source to identify contacts.",
    "problems solved": "Uplead brought me quality in the search for leads in a more agile and specific way. I wasted time looking for contacts through social networks that most of the time are not updated. Uplead helped me identify contacts much more efficiently in my region. It is currently my main source of research."
  },
  {
    "Review Date": "09/29/2022",
    "Reviewer Role": "Virtual Assistance",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "UpLead saves a significant amount of time by providing accurate information and contacts. I can search by industry, company, location, title, and so on; select the contacts I require, and export them to Excel. Email verification is also a great addition!",
    "dislike": "So far, so good; I haven't discovered anything I dislike.",
    "problems solved": "Helps to find up to date information, contact details."
  },
  {
    "Review Date": "11/30/2022",
    "Reviewer Role": "Adjunct Faculty/Political Science",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "UpLead's services are first rate. Quick response time. Platform provides exactly the type of info and data to grow my small business. Better value than competitors.",
    "dislike": "Monthly purchase info on their website is confusing - sounds like they are rectifying the issue.",
    "problems solved": "Looking to grow a \"mom and pop\" business - UpLead is providing the emails and background info to delve into new nonprofits domestically and globally."
  },
  {
    "Review Date": "03/06/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Clean data to connect with industry contacts.",
    "dislike": "Points per lead are expensive, however, high quality",
    "problems solved": "Keeping our pipeline full"
  },
  {
    "Review Date": "09/15/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The data looks good and incorrect lead data is replaced",
    "dislike": "It is useless to me because the specific filter I asked for was locked after the money was paid for a year, asking to pay more if I wanted that feature. I reached out to CEO and seems he wouldn't respond. The same guy who would instantly revert(within minutes) before I bought the product.",
    "problems solved": "I was looking to get some leads but am not able to use the product as the filter was locked."
  },
  {
    "Review Date": "09/28/2022",
    "Reviewer Role": "Business Developer",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like that when you unlock the mobile number, if available, it is the actual number. Has increased my sales this month by 20%.",
    "dislike": "Sometimes the number listed isn't their actual location. For example if headquarters are in Michigan it will list that number when they are actually working from California office",
    "problems solved": "Getting direct numbers bypassing the gatekeeper"
  },
  {
    "Review Date": "06/07/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Uplead is a great platform for B2B. Our team utilizes the filters a lot and loves the flexibility the platform has to offer. It is a great value for the price, and the support team is always available for any questions my team members have. Sales reps have let me know they love the design of the platform and it is very user-friendly. It seems to be intuitive and it is easy to navigate.",
    "dislike": "I wish the data was updated more often. Sometimes we receive a lead that is out of date. It would also be great to integrate cell phone numbers into the contact details seeing everyone has cell phones now. Having updated information is helpful when building out lead lists to make sure we are contacting the right people and companies.",
    "problems solved": "Our team needed a solution because we are growing really fast. We need to generate many leads to turn the leads into sales. I love the value for the price. Uplead has a lot to offer for the price and my team is very happy with the program. It has helped my business grow and my sales teams are getting many leads and growing rapidly. Support is always quick to answer which is great because we do not have a lot of time to wait for answers."
  },
  {
    "Review Date": "07/08/2022",
    "Reviewer Role": "Facebook Ads Strategist",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The UX's simplicity and ease of use. And it's saving me a lot of time and frustration. The email verification prior to download is awesome!",
    "dislike": "Haven't found anything so far. I'm sure they'll be something but I haven't found it yet.",
    "problems solved": "Email verification before download. Reduces the risk of bounces. Easy to search and save leads. Saves me a lot of time and frustration."
  },
  {
    "Review Date": "05/28/2022",
    "Reviewer Role": "Senior Process Specialist in SAP-ERP",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Amazing way to get contacts and generate Leads. A very intuitive way of research the Market, results come quickly and filters make it easier to clean your required information. Also, one can research companies' revenues employee profiles, leads profiles, CEO contacts etc...",
    "dislike": "Could use some tweaking here and there so one could have more themes to choose from, but  this is nothing to consider as a negative point overall all works like a charm",
    "problems solved": "It saves you money because if you buy market research or contact lists they can be expensive and maybe the data is not even accurate. You can get your desired contact persons in a few clicks saving you hours of research."
  },
  {
    "Review Date": "03/16/2022",
    "Reviewer Role": "S",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I can search by contact, by company or by title.  I can find phone numbers as well as emails for potential prospects.  I am new to the platform but so far looks great!",
    "dislike": "I have not really found anything I dislike.  It works fine.  I know how hard it is to get this information, I set my expectations in line with what it delivers.  Not everything I am looking for is in there but a great deal is.",
    "problems solved": "I use LinkedIn Navigator, ZOHO CRM and always am frustrated that people don't put their contact information in LinkedIn.  So Uplead is providing me another source to identify contacts in my own industry and in my profession that I didn't have before.  These tools complement each other."
  },
  {
    "Review Date": "06/09/2022",
    "Reviewer Role": "Especialista em marketing digital",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Excellent tool to create lists of the best customers, it helped me a lot, you can send me information, close more deals, my billing has increased, no email errors with disqualified emails, or spam and errors in receipts.",
    "dislike": "At first it was difficult, until I migrated all my existing list, but after the system was implemented and everything was running, with the help of Ulead support, everything became much easier.",
    "problems solved": "Uplead, with the ease of customer lists, brought to the company the most intelligent and less manual system, which is possible for my agents to improve a more adequate support with better quality and agility for our customers."
  },
  {
    "Review Date": "01/19/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "How integrated it is... with LinkedIn, how to build lists, the information, etc",
    "dislike": "Nothing at all... wish I knew about you a long time ago!",
    "problems solved": "Find leads with accurate information, i.e, personnel, contact info, etc"
  },
  {
    "Review Date": "05/30/2022",
    "Reviewer Role": "SEO",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "There are a lot of reasons why I like Uplead. First, it is a great way to keep my leads organized and safe. Second, it allows me to easily connect with new prospects and customers. Finally, the support team is amazing and always available to help me with any issues I may have. Overall, I highly recommend Uplead to anyone looking for a great lead management tool.",
    "dislike": "There are a few things that I dislike about UpLead. First of all, the interface can be a bit confusing and difficult to navigate. Additionally, the search function is not as robust as I would like it to be, and the results can be somewhat limited. Finally, I have found that the leads generated through UpLead are often of best quality than those generated through other lead generation platforms.",
    "problems solved": "UpLead is solving the problem of lead generation by providing a powerful, easy-to-use platform that helps businesses connect with their target audiences. This is beneficial to you because it provides an efficient way to generate leads, which can then be converted into customers. Additionally, UpLead offers valuable insights and data that can help you better understand your target market, which can ultimately lead to more successful marketing and sales efforts.Overall, UpLead is providing a valuable service that is helping businesses connect with their target audiences and generate leads more effectively. This is resulting in improved results for businesses, which is benefiting both the companies and the consumers they serve. Thanks UpLead!"
  },
  {
    "Review Date": "02/24/2023",
    "Reviewer Role": "T",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "UpLead provides accurate email addresses and pertinent background information on contacts,  job titles and companies. I have found it easy to upload names or company urls and populate my crm.",
    "dislike": "UpLead has the same issues as other prospecting software: lack of email addresses.",
    "problems solved": "UpLeads support has been excellent and responds promptly for issues I may have. They have even gone to the trouble to manually improve my market segment search."
  },
  {
    "Review Date": "12/01/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Getting to the contacts with the correct titles, thereby minimizing the time for research.",
    "dislike": "There are instances where the lead or even the company is not in the system, even if you know who that particular lead is. A bit frustrating at times.",
    "problems solved": "The problem of finding the contact information for a particular lead saving valueable time."
  },
  {
    "Review Date": "12/01/2022",
    "Reviewer Role": "Business Development Manager",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "all contact info all contact info is available, as well as using emails and getting in touch with decision makers.",
    "dislike": "not being able to get a human immediately and having to fill out a form to talk",
    "problems solved": "Not sure what problems it's gonna solve yet. I'm going to work on trying out some leads and contact info."
  },
  {
    "Review Date": "09/28/2022",
    "Reviewer Role": "Digital Strategy Senior Consultant",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Uplead was good for searching and exporting data on leads",
    "dislike": "They make it difficult to adjust to monthly pricing versus paying for annual. They hide some of their billing options. Customer support is also unavailable beyond a bot chat feature and FAQ.",
    "problems solved": "It's helping find contact information for our marketing campaign"
  },
  {
    "Review Date": "07/22/2022",
    "Reviewer Role": "Search Engine Optimization Specialist",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I highly recommend UpLead for startups and next-level organizations to use it's user-friendly lead generation tool. I created a list of leads for our campaign using UpLead The best thing is you can get the data of your own choice by applying filters.",
    "dislike": "I am a big fan of this software but the search function is not as robust as well",
    "problems solved": "It has a very professional interface and has updated data of market. There are also CRM tools to reach out for easy communications."
  },
  {
    "Review Date": "01/26/2023",
    "Reviewer Role": "Managing Director",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "User friendly and easy on the eye. Would be better with more free text searching",
    "dislike": "More free text searching on keywords....",
    "problems solved": "Mass import of potential clients and leads"
  },
  {
    "Review Date": "03/16/2022",
    "Reviewer Role": "VP, Sales Enablement",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I like that Uplead has an easy URL upload feature where you can upload a list of accounts or company URLs and get a list of account information and contacts. Simple to use filters, too. It's a great way to quickly append hundreds, if not thousands of accounts at once. Can't beat the pricing model either - paying by credit or contact vs. a long-term \"use it or lose it\" contract. I may need to grab a few hundred accounts one month and not be back in the solution for a couple more months, and my credits are still there waiting for me.",
    "dislike": "That I'm locked into a competitor solution and didn't find Uplead until I got mired in contract negotiations.",
    "problems solved": "Great tool for appending accounts and contacts for Marketing purposes. Give uplead a list of URL and you get a really rich data set."
  },
  {
    "Review Date": "08/24/2022",
    "Reviewer Role": "Vice President of Sales and Business Strategy",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The best portion of UpLead is the integration with HubSpot. This makes prospecting and finding new contacts extremely easy. I also think the quality of leads in UpLead is also pretty solid.",
    "dislike": "Wish there were more companies and data in UpLead! I feel like it covers less than 20% of what I suspect would be the total addressable pool of companies and prospects.",
    "problems solved": "Phone numbers and emails at target prospect companies. Also being able to quickly and easily pull data into HubSpot so that I don't lose a lot of time doing research, when just calling a prospect can be most effective."
  },
  {
    "Review Date": "03/07/2022",
    "Reviewer Role": "Regional Head of Marketing",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I like the interface and it's quite easy to use. Uplead is also cheaper than Zoominfo.",
    "dislike": "Auto-renew without informing customers, no refund policy,  the actual number of contacts exported is less than 30% of what you see after you filter. Eg: It show 1000 contacts, but when exported, there are only have 200-300.",
    "problems solved": "All subscriptions will usually send a courtesy email to inform customers when a subscription is due for renewal, but Uplead will not send any and will charge automatically when your subscription is due. Even if a customer is not happy with the software, they have a no refund policy.  Uplead does not have a dedicated customer success manager to care for its customers.  Unfortunately, we did not gain any value from it. We left with lots of credit unused, and got charged again without any pre-notification that our subscription is due for renewal."
  },
  {
    "Review Date": "11/02/2022",
    "Reviewer Role": "Business Development",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "More up-to-date information for the contacts.",
    "dislike": "Some of the builder accounts you do not have on the program.",
    "problems solved": "I am looking to expand my builder contact information."
  },
  {
    "Review Date": "07/18/2022",
    "Reviewer Role": "PCR Loan Review Specialist",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like that the information that I research is updated and accurate.  UpLead will let you know if the information you selected is not current or invalid. Also,  I like that I have a variety of businesses that I can reach out to and research.",
    "dislike": "I am currently a beginner at using  UpLead; I can't compare it with other systems.",
    "problems solved": "The information that I received in my research is valuable. For example,  UpLead gives you information concerning the company's stock value, sometimes pictures of the business and news articles about the business.   The news articles of the business help a lot because I can see how the company is doing and their involvement in the community."
  },
  {
    "Review Date": "05/10/2022",
    "Reviewer Role": "Administrative Assistant",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The interface is very easy to use, and the efficient search engine is most commendable. Its searches have great precision, especially ensuring the verification of emails, and have excellent data accuracy. Definitely worth recommending.",
    "dislike": "Nothing to dislike so far! It has catered to my professional needs and is performing well up to its expected service. It was easy to navigate even at first use.",
    "problems solved": "I've further appreciated the importance of email verification of prospective clients and businesses, and UpLead's searches providing such validation have allowed for better communication with my clients. Before UpLead, I had unpleasant experiences where incorrect emails were used and the sharing of information with my clients was crippled."
  },
  {
    "Review Date": "11/30/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "the fact that you can filter the contacts based on technology and section that shows any latest news or tweets the company has",
    "dislike": "The quality of the email addresses are not very good, and bounce rate is quite high when I use these prospects in my email sequences and sometimes email address of prospects are completely diffeent with the common email pattern provided right underneath the name of the company.",
    "problems solved": "contact details of prospects I would like to contact for my campaigns (cold emailing, cold calling)"
  },
  {
    "Review Date": "01/26/2023",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Easy to use system, list storage and easy searching",
    "dislike": "Working out if the numbers are mobile or not",
    "problems solved": "Sales leads"
  },
  {
    "Review Date": "10/03/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "It is a simple, dynamic and easy to use software for people like me. Any Internet user can use it. I recommend it, it makes my work easier and makes the experience within the platform more fluid.",
    "dislike": "In my opinion I have not detected anything I don't like about this fabulous platform. It works perfectly. An extraordinary tool, it never ceases to amaze me every day I discover new tools that make my work easier.",
    "problems solved": "It helps me to locate everything I'm looking for and interact with companies and customers making my work faster and more professional, I also notice that my commercial portfolio has increased which makes me recommend this platform with ease."
  },
  {
    "Review Date": "08/18/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The UI is good, and they have lots of search features.",
    "dislike": "We signed up and ran some searches, but a majority of the leads that came up didn't match the criteria we selected  (mainly company size and revenue). So we cancelled our subscription after a day. Asked for a refund and they said 'all sales are final'. Which was a bit disappointing as the service wasn't delivering what we asked and we only used it for a day. I used to recommend this platform to people, but I'm really disappointed with their customer service and I won't be recommending it anymore. I never write reviews for SaaS platforms. But it has annoyed me I spent $99 to be let down.",
    "problems solved": "We wanted leads for cold outreach and needed more accurate search criteria."
  },
  {
    "Review Date": "04/24/2022",
    "Reviewer Role": "Specialist",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Uplead has great data accuracy. They provide you with valid and verifiable emails to be able to connect to prospective clients or businesses.  Provides data from companies and high-quality B2B information. Verification of emails in real-time, technology monitoring, marketing based on accounts, and associated profile links are services that you get. It is easy to use and efficient. Being able to filter variable helped in being able to find contacts .pricing was right, they also have a trial that allow me to see the quality of information given",
    "dislike": "Nothing! It works fine. I absolutely love Uplead and would recommend it to any salesperson or business owner. Uplead provides data from companies and high-quality B2B information",
    "problems solved": "uplead is a great provider of reliable data to get information or leads on prospective clients for marketing and sales. Very easy to use and efficient. Help increase sales"
  },
  {
    "Review Date": "11/30/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Robust database, high quality, accurate data about businesses.",
    "dislike": "navigating between pages in reading through data.",
    "problems solved": "saves me critical time in searching target companies."
  },
  {
    "Review Date": "12/08/2022",
    "Reviewer Role": "CEO and Founder",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The contacts that you find are reliable and they work, very few bouncebacks.",
    "dislike": "Wish there was more contacts available in the logistics space",
    "problems solved": "Being able to find a contact and reach out for lead generation."
  },
  {
    "Review Date": "07/13/2022",
    "Reviewer Role": "Owner",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Easy to use interface, knowledge and willingness to help from support staff.",
    "dislike": "Credits for leads are used as a gate before knowing if the lead has a verified email address",
    "problems solved": "Cost-effective lead generation is essential for the SMB market. This is one of the only companies doing it this well for the money."
  },
  {
    "Review Date": "12/15/2022",
    "Reviewer Role": "Chief Philanthropy Officer",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The quality of the data, and the easy export to HubSpot.",
    "dislike": "Intent data is only available on the highest accounts.",
    "problems solved": "Prospecting and pre-qualifying lead before expending sales resources on reaching out."
  },
  {
    "Review Date": "05/18/2022",
    "Reviewer Role": "Sole proprietor",
    "Company Size": "Enterprise(> 1000 emp.)",
    "like": "UpLead is the finest tool I’ve used ever with an average budget. The results of filtration are efficient and meet my requirements. The best part is it allows you to make the time more productive.",
    "dislike": "The UI is perfectly fine but missed the dark mode so looking forward to work on the dark mode for future leads. As far as my concern nothing is bad.",
    "problems solved": "I generate the new leads which is one of the major purpose of using UpLead. The AI program running in the back is a benefit that ultimately filters out the fruitful results."
  },
  {
    "Review Date": "07/31/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Uplead provides valuable contacts that I",
    "dislike": "would not know about or find otherwise. Uplead is a more economical contact source than their competitors. Updead is not cheaper, it is less expensive than its competitors, providing the best value in my opinion.",
    "problems solved": "Uplead provides the e-mail pattern that is needed to contact new potential customers. This is important because if you guess and try multiple e-mail patterns for contact or contacts at a particular company, and you guess wrong and/or too many times, you run the risk of being flagged as a spammer by that company's server."
  },
  {
    "Review Date": "03/18/2022",
    "Reviewer Role": "B",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "At first, I was skeptical due to my experience using lead gen services.  Uplead is by far the best lead generation service I have used. Although the mobile numbers are not  100%  perfect every time, being 85%-90% reliable on that front is an impressive feat. The sheer amount of information collected is mindboggling, million up millions (maybe billions) of data points. It's worth every penny!",
    "dislike": "I can't think of anything. I'm very pleased with Uplead.",
    "problems solved": "We currently have a lead dept within my company. Our sales force consists of about 100 people, We all use Uplead and it has been a game-changer for reliable data. You can stay on top of the latest news from companies you follow which allows initial rapport with potential prospects."
  },
  {
    "Review Date": "09/10/2022",
    "Reviewer Role": "Human Resources Assistant",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "It help to have large connections and engagement within short time",
    "dislike": "It consist of so many links and it has many instructions that can cause a person to get lost.",
    "problems solved": "To reach the customer and employe"
  },
  {
    "Review Date": "12/13/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Identifying key target customers in an easy multistep process.",
    "dislike": "Sometimes the emails are not updated on Uplead.",
    "problems solved": "Transferring the leads onto Sales Force."
  },
  {
    "Review Date": "08/24/2022",
    "Reviewer Role": "Director of Product",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The simple interface makes it incredibly easy to search for contacts.",
    "dislike": "It would be nice if I could do some of these searches in bulk.",
    "problems solved": "UpLead helps me find contact information for potential clients and partners."
  },
  {
    "Review Date": "06/03/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I enjoy the software's capabilities to build prospecting lists free from dodgy data, bad-fit buyers and low-qualified leads. It is very useful when it comes to time crunch deadlines.",
    "dislike": "Nothing at the moment as the software is helping the team to improve efficiency in the way how we work as a team to clean and manage our database. We find the system easy to use.",
    "problems solved": "Previously when we were running the team without the software, it was tough as we were spending +1 Day just to clean data with the whole team. Leads generated and the information from the system is tough to actually go through one by one. But with UpLead it has helped us to reduce that by 90% and all we have to do is review the database at the end of the day and we are good to go. It has certainly improved our efficiency."
  },
  {
    "Review Date": "07/31/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The Accuracy Rate of uplead is too good. Even I found it's near about 90% in all cases, And also the Industry Selection and Job title selection part is too easy. The customer support with any type of new request come in short period of time",
    "dislike": "The total database of contacts are much less than its competitors. And the mobile numbers of leads are less available than ZoomInfo. And also you cants able to select alternative filters where your are looking for those contacts those have Mobile OR Direct No...",
    "problems solved": "It's solving the accuracy problem. Which currently many similar products not offering and also a better support to get a new database request from there team side. Which is unbelievable"
  },
  {
    "Review Date": "12/07/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The search engine filters are alot which make it easier to search\nThe tool is very useful and easy, however many Arabs email are not there and i can't search for companies",
    "dislike": "that alot of arab's or MENA region emails are not there.\nand alot of invalid emails",
    "problems solved": "finding contacts and filling my contact list"
  },
  {
    "Review Date": "05/27/2022",
    "Reviewer Role": "Cloud Security Analyst",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "the reliable and trustworthy platform for account-based marketing and marketing Analytics .",
    "dislike": "as a user, i didn't feel any ambiguity using this product",
    "problems solved": "facing issue regarding account marketing and security concerns related to identity verification  for security check and now i am using this with all tools available"
  },
  {
    "Review Date": "12/05/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Easy to sort and find specific contacts within companies. Easy-to-use site",
    "dislike": "Searching for anything except exact company names will not yield results. It would be nice if there were a broader search window to find companies",
    "problems solved": "FInding contacts for businesses that we are prospecting. Helps with finding the decision makers  within a company."
  },
  {
    "Review Date": "11/21/2022",
    "Reviewer Role": "VP of Sales & marketing",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Ease of use and cost-effectiveness......",
    "dislike": "Nothing so far...but we will will see...",
    "problems solved": "It has provided us with that hard-to-find market intelligence"
  },
  {
    "Review Date": "07/10/2022",
    "Reviewer Role": "A",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "It is easy to use and specially very user friendly it's customer support is 100% + the data leads we get are authentic in means of the requirements we submitted.",
    "dislike": "Not that much just we need to get more sectors of data like all doctors specialist leads all kind of business weather it's software engineer market trends and challenges",
    "problems solved": "The additional data and fields of professional experience are being offered by upload new ways to make outbound calls to the next level with the passage of time"
  },
  {
    "Review Date": "03/31/2022",
    "Reviewer Role": "Secondary research associate",
    "Company Size": "Enterprise(> 1000 emp.)",
    "like": "It is very helpful i can search required information about companies. Which saves time and work easily.I can easily search contact information and official emails",
    "dislike": "I didn't find anything dislike upto now. All are working fine upto now. The information which provides it is correct and aqurate which helps in B2B contracts and agreements",
    "problems solved": "I used LinkedIn and other websites to get contact details but many companies didn't provide detailed information so i used to get frustrated so i got uplead where I can get every information what i required"
  },
  {
    "Review Date": "07/13/2022",
    "Reviewer Role": "Employee Benefits Specialist",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Working with the uplead team to customize my experience. The product offered a different solution set than our existing vendor.",
    "dislike": "I would encourage the team to allow a customized set of columns during the initial search.",
    "problems solved": "Connecting with the right people to streamline our engagement process."
  },
  {
    "Review Date": "07/13/2022",
    "Reviewer Role": "Senior Innovation Manager",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "helpful customer service and comprehensive database",
    "dislike": "It is relatively new compared to zoominfo but i find that the underdog companies are more interested in your business need. zoominfo has very bad customer service.",
    "problems solved": "helps me with lead generation"
  },
  {
    "Review Date": "04/30/2022",
    "Reviewer Role": "Asistente General",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "It helps to prospect customers in the fastest way I've seen and the best of all it's personalized (you can choose the type of contact you want, company, etc). It really doesn't have comparison.",
    "dislike": "Sincerely I dislike nothing about this! Is a great (trust me) find to connect with companies, people, businesses, etc.",
    "problems solved": "I can find the right target for what I'm looking for, which is a life changer to be honest and it is really easy to use"
  },
  {
    "Review Date": "11/02/2022",
    "Reviewer Role": "VP of Sales",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Updated information, contact and email for any type of industry",
    "dislike": "Monthly plans with diffrent fields in different industries",
    "problems solved": "Great leads for transportation or logistics"
  },
  {
    "Review Date": "09/06/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Contacts are linked to their LinkedIn profiles for easy verification. The Chrome extension is handy; the companies' URLs are active and integrated into google search.\nOutstanding customer training and friendly support are available at all times.",
    "dislike": "There aren't any downsides to using UpLead",
    "problems solved": "Having access to companies and the key contacts"
  },
  {
    "Review Date": "07/14/2022",
    "Reviewer Role": "Founder & CEO",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Uplead is trying to get their customers happy. This is the way to run a company.",
    "dislike": "After a couple of searches, I managed to get some insightful contacts.",
    "problems solved": "Uplead provides contact details on potential leads."
  },
  {
    "Review Date": "09/07/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The platform is very user friendly and contains tools that allow for easy sorting.",
    "dislike": "Data accuracy is always a challenge. More frequent telephone accuracy checks would be beneficial.",
    "problems solved": "Upleads is providing us with a targeted lead list that will boost our sales and marketing efforts."
  },
  {
    "Review Date": "11/29/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Uplead is a great resource to help our sales teams find key decision-makers when prospecting!",
    "dislike": "We just started using it and have not found any problems so far.\n\nBut, nothing is perfect these days.",
    "problems solved": "It reduces our time prospecting."
  },
  {
    "Review Date": "05/17/2022",
    "Reviewer Role": "National Sales Lead",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "This tool is easy to use and flexible. I found it to be self explanatory.",
    "dislike": "I'm not always sure the email addresses are kept current, I often have bounced emails.",
    "problems solved": "I have not had any problems with upleed, this tool came recommended from a sales professional friend.  As. start up company we are always looking for value for the money."
  },
  {
    "Review Date": "07/12/2022",
    "Reviewer Role": "Project Manager",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "UpLead is very user-friendly, has an array of applicable functions and features, an incredible customer service/success team, and most importantly good data.",
    "dislike": "I have nothing to add here as I've had nothing but positive experiences with UpLead.",
    "problems solved": "UpLead is used in our process to help fill in the gaps of buying-persona data which allows us to constantly perform for our client roster."
  },
  {
    "Review Date": "08/30/2022",
    "Reviewer Role": "Marketing",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like that I can get an appointment almost any time I need one.",
    "dislike": "Unfortunately, Uplead has a no phone policy and I find that frustrating at times.",
    "problems solved": "Uplead provides access to current industry information, which allows my company to prospect more accurately."
  },
  {
    "Review Date": "06/24/2024",
    "Reviewer Role": "Product Management",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Uplead has an intuitive simple to use UI.  You can up and running in less than an hour. The search criteria are simple yet quite powerful. CRM integration (e.g. export direct to Hubspot) saves time and effort.\nPricing is friendly to startups.",
    "dislike": "In the gig economy, independent contractors are a key segment. Uplead focuses only on contacts who are employed by companies.",
    "problems solved": "Build a database of leads to funnel into email marketing campaigns."
  },
  {
    "Review Date": "08/24/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Accuracy of the Database! Simple & Easy.",
    "dislike": "N/A. We are happy with the quality/Spend.",
    "problems solved": "We are using one database instead of several. When we have an issue the support team is available and responds quickly, solving the issues in a timely fashion."
  },
  {
    "Review Date": "04/06/2022",
    "Reviewer Role": "Accounting Bookkeeper",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Thank you for this. It is very helpful. I can easily find company email and contact numbers accurately. This is very helpful to everyone.",
    "dislike": "I think the subscription is expensive but it is reasonable.",
    "problems solved": "It is very easy to use. Highly recommended for people who use email and can easily find new prospects for marketing and sales."
  },
  {
    "Review Date": "03/22/2022",
    "Reviewer Role": "Educational Advisory Board- Pharmacy Times",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like how I can narrow down my exact search to the specific people in my profession whom I am trying to reach. It was specific and very easy for me to us, which I appreciate.",
    "dislike": "That some emails do still bounce. It is a very small number, though.",
    "problems solved": "I'm solving the problem of reaching more of my ideal client avatar in my profession. I'm more productive and can reach people I'm looking for in a fraction of the time."
  },
  {
    "Review Date": "12/05/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "system is easy to use and the search criteria",
    "dislike": "alot of kick back on leads coming back restricted and blocked emails",
    "problems solved": "finding direct emails to customers"
  },
  {
    "Review Date": "05/12/2022",
    "Reviewer Role": "CMO",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like the easy of use and affordability. I also find the technology filter adds an added level of sophistication to my prospecting.",
    "dislike": "I wish Uplead had a longer trial period.",
    "problems solved": "I do a lot of email marketing. Accuracy is important because bounces hurt my standing with my email service provider. Since switching to Uplead I've had to alwnd less money on list cleaning tools."
  },
  {
    "Review Date": "04/27/2022",
    "Reviewer Role": "National Partner Manager",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "It has a very professional interface and has updated data of market. If you are in search of Updated platform then choose uplead.",
    "dislike": "It did take me a few tries to figure things out. But support is terrific in helping me  in handling their software.",
    "problems solved": "Generating leads at an incredible value. I would highly recommend giving Uplead a shot."
  },
  {
    "Review Date": "04/08/2022",
    "Reviewer Role": "Administrative officer",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Uplead is a super-efficient and effective platform. Easy to use with a good amount of informations such as company and contact data, social profile links are available. Being able to sort and filter valuables is also very helpful.",
    "dislike": "The availability of a free trial kick me off here. Everything is perfect.",
    "problems solved": "Uplead solves several problems which I will mention few here; such as getting the right contacts of the company, and company URL which is one of the major problems of business owners. There are also CRM tools to reach out for easy communications."
  },
  {
    "Review Date": "06/17/2022",
    "Reviewer Role": "Co-founder",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Uplead is a rip-off company, they charge automatically without getting your final approval while ignoring your emails and replying late",
    "dislike": "Lack of communication, bad support to understand your situation and not change for a refund even when it's there mistake",
    "problems solved": "Nothing\nuseless"
  },
  {
    "Review Date": "01/16/2022",
    "Reviewer Role": "IT Officer",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Our company was looking for very specific titles within a group of specific personnel and companies, and Uplead managed to provide good results. However, Uplead should improve the lead accuracy rate and update the leads regularly. We got 10-12 bad leads per 100 exports. The filtering system of Uplead is pretty good, and it helps us reach our targeted leads within a few clicks. Uplead allows us to integrate with Salesforce which makes the process easy for us.",
    "dislike": "If you don't have a clear idea about your targeted leads, you may start wasting credits which results in high cost per lead. So, make sure you are filtering properly.\n\nAlso, Uplead should update the database for  Non-US leads. However, it's an awesome platform for US lead generation.",
    "problems solved": "Uplead helped our internet marketing and sales team to boost productivity and increase the company's sales."
  },
  {
    "Review Date": "04/28/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "It is a very easy platform to navigate, and I especially like the fact that I can save all of my queries to come back to later. This is handy once I find an industry that I am particularly effective in selling to.",
    "dislike": "There is not much missing from this platform. It meets all of my needs and everything works properly.",
    "problems solved": "It is helping get in contact with the appropriate decision makers. It has also helped me define my ideal customer profile. This has helped me tremendously in my conversions rates"
  },
  {
    "Review Date": "05/17/2022",
    "Reviewer Role": "Vice President Of Strategic Sales",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Easy to navigate, great content and ease of navigating data",
    "dislike": "The credit-based model vs an unlimited subscription.  This appears to be standard in this industry.   Other than that no issues",
    "problems solved": "Creating useful contact data that other social network sources cannot provide."
  },
  {
    "Review Date": "08/05/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Simple easy to navigate essential business tool.",
    "dislike": "Nothing. It has been a pleasure to use and interaction with customer support is fast and efficent.",
    "problems solved": "Uplead allows us to get industry insight that is filled with accurate account and contacts."
  },
  {
    "Review Date": "12/08/2021",
    "Reviewer Role": "Marketing Director",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "We checked out several different lead companies and UpLead is superior to them all. Their payment structure is fair, the leads are real, the platform is super easy to use and the customer support team rocks. UpLead offers a wide array of filtering options. Once you've pulled up a list, you can choose which contacts you would like to download, and you are charged accordingly. So you aren't paying for leads that you didn't choose. And the contact information is valid. Their API works with CRMs like SalesForce and Pipedrive. Totally happy with UpLead.",
    "dislike": "Can't think of anything at the moment. All is good.",
    "problems solved": "UpLead helps us obtain contact information for people and companies we wouldn't have gotten otherwise."
  },
  {
    "Review Date": "07/04/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I liked the simplicity and intuitive user experience",
    "dislike": "Refund policy and customer support are minimal and the representative does not seem interested in following up with our issue.",
    "problems solved": "I am hoping to solve sales/account targeting but unsure that their database is complete."
  },
  {
    "Review Date": "12/11/2021",
    "Reviewer Role": "President",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "What I liked best was the power of the search function, you can get as narrow or as broad as you want. Then you can decide how many of the contacts to download along with their email.  The tips offered along the way make sure you're spending your money on contacts that are reachable.",
    "dislike": "There isn't much I don't like. The UI is intuitive and it keeps track of contacts you've already downloaded :)  The learning time to use Uplead is a few minutes and I love that unused credits rollover to future months.",
    "problems solved": "We were not doing outbound campaigns to new prospects and markets. UpLead got us going very fast with high quality contacts."
  },
  {
    "Review Date": "04/07/2022",
    "Reviewer Role": "Digital Marketing Assistant",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "What I like about Uplead is how you can get the quality leads and detailed data of your prospects which is very significant. This saves time and effort to look for the right market.",
    "dislike": "Nothing in particular that I dislike about it. Everything works perfectly when using it. Of course, it's great to look forward for any improvement on the current.",
    "problems solved": "The problem of reaching the right niche and getting the best results since you have a quality lead. It also definitely saves time which you can use for other goals."
  },
  {
    "Review Date": "12/08/2021",
    "Reviewer Role": "Managing Director",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Obviously being able to filter on multiple variables is super helpful, and uploading company URLs to find contacts is a quick/easy way to find leads too, but the best part is the billing structure... when selecting your leads to download, you have the option to only select leads with verifiable email addresses, which allows you to only use your credits on the best possible leads.  Other lead sourcing tools force you into paying for a bunch of garbage along with the good stuff.  Customer support is very helpful too, and they allow you to \"pause\" your account during months when you're not using it as much.  Clearly, they are designing around the end-user, which every business should be doing.",
    "dislike": "There are still some caching bugs that make it so I have to clear my cache from time to time to get Uplead working optimally again... but that's really the extent of my complaints, and I can solve that issue pretty easily.",
    "problems solved": "With Uplead, I can segment my target customers and pursue only the highest value leads first by using the filtering tools judiciously.  The hidden value is that Uplead forces me to think more deeply about who EXACTLY I want to target, which I should be thinking about in the first place."
  },
  {
    "Review Date": "12/12/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Being able to find contacts that are in the company listing that actually work there.",
    "dislike": "Sometimes there are manufacturers here in the US who's Corporate Offices are Overseas.  Would be Nice to know the contacts here in the US.",
    "problems solved": "Finding Actual Contacts."
  },
  {
    "Review Date": "03/21/2022",
    "Reviewer Role": "Principal",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I was disturbed because of my bad experience using lead generation services. And then one of my friends told me about Uplead. It is the best lead generation service I have used. Almost every contact detail is exact. Huge amount of information is available. Spending money here is worth every single penny. Go for it guys if you are looking for services to grow your business. Happy with Uplead services.",
    "dislike": "I did not find any issue while using this website. It is easy to use and create new connections using the contact information.",
    "problems solved": "Lead Generation for my business."
  },
  {
    "Review Date": "03/17/2022",
    "Reviewer Role": "Financial Advisor",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "very accurate contact numbers, emails and adresses.It is very easy to obtain information on prospective clients with real-time information provided on the website",
    "dislike": "Subscription packages, prices are too expensive and steep and not easily affordable for start-up medium and small-scale sales agencies.",
    "problems solved": "obtaining directer contacts of executive staff , direct office lines and cell phones for clients"
  },
  {
    "Review Date": "03/16/2022",
    "Reviewer Role": "Director",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "For the price, there is no better tool that easily integrates and has the support you need to be successful.",
    "dislike": "Limited data and accuracy. Phone numbers sometimes are general or not in the US.",
    "problems solved": "Quicker  turn around finding names and numbers and has helped build my pipe line"
  },
  {
    "Review Date": "12/08/2021",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like that I can sort and filter very easily, the knowledge base is very helpful and I am able to connect with my account manager very easily.",
    "dislike": "It would be nice to see further filtering based on revenue. It'd be great to target between $100k-$500k and then $500k-1 million.",
    "problems solved": "I don't have to spend time having my setters source leads manually. I can generate a leads list for them to call. This saves time and is very helpful."
  },
  {
    "Review Date": "06/15/2022",
    "Reviewer Role": "Enterprise Account Executive",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Uplead is an intuitive and feature rich platform that enables the user to research companies and people.",
    "dislike": "It would be nice if there was an offering for individual users less than $100 per month.",
    "problems solved": "Researching email addresses and the ability to market to key targets at companies."
  },
  {
    "Review Date": "09/03/2021",
    "Reviewer Role": "CEO & Founder",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "We have tried several solutions, including Zoom info and Lusha; while Zoom has some excellent features, the cost does not justify the accuracy of data and features found with Uplead.  Additionally, when I had questions about enterprise pricing and needed some help, Uplead support team responded almost immediately.  We are a SaaS B2B company with excellent support, so we know it when we see it.  My rep Russel responded to all questions immediately, and I felt they were very transparent with their pricing, indicating they are customer-centric.  I highly recommend them.  Also, in the trial, you didn't need to pay to upgrade to test all functionality, including integrations.",
    "dislike": "Nothing so far that I dislike, I think overall it is great",
    "problems solved": "Being able to create customer lists, prospect for new customers, verify customer data for accuracy, and feed our BDR team with good prospects that are directly integrated with our sales engagement solution."
  },
  {
    "Review Date": "11/24/2021",
    "Reviewer Role": "Lead Manager",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I've tried a number of tools for gathering B2B contact and company data. But nothing was up to the mark like Uplead. This is a super efficient and effective platform for you that gives you the access of various verified business contacts and emails worldwide. This sales intelligence platform works amazingly for you.",
    "dislike": "I didn't find any problems while using this platform. It goes so smoothly and helps me a lot.",
    "problems solved": "Researching and preparing the contact lists obviously needs much time. Plus, you cannot make 100% genuine lists. But Uplead can make it 95% accurate and saves both your time and energy. Yes, also it helps to prosper your business in the long run."
  },
  {
    "Review Date": "02/01/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Being able to search for any job title and have search populate based on the location of the contact and not the businesses. Plus it does not hurt that they direct you straight to the contacts LinkedIn profile.",
    "dislike": "Have not had enough time to find any issues, as of now. However, I do wish the pricing was more flexible when it comes to the month-to-month payments. They are still better than most.",
    "problems solved": "I am getting in touch with the correct decision-makers in manufacturers. It also helps me discover prospects that were not previously on my radar. It also allows an easy method for porting over to my CRM"
  },
  {
    "Review Date": "12/21/2021",
    "Reviewer Role": "Senior Frontend Developer",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like that the search is highly customizable. The dashboard is clear and easy to use. It's easy to save prospects as well.",
    "dislike": "The pagination bar is only present at the top. It would be better to keep it at the bottom of the table as well.\nI would also like to have the option to save somewhere that I have contacted the person. And connect it to my email provider for reminders.",
    "problems solved": "I am generating quality leads for my business quickly and in an organized way."
  },
  {
    "Review Date": "12/07/2021",
    "Reviewer Role": "APAC Channel & Partner Ecosystem Sr. Director",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like following about UpLead:\n>> The user experience of the platform.\n>> The rich content and many contacts the platform has in multiple markets ( we cover more than 15 countries)\n>> The support team and customer success team are doing a lot of great efforts to make us get the best out of the platform",
    "dislike": "Nothing so far, we will make sure to update the review of the dislike once we discover any :)",
    "problems solved": "Completing the dots as we intend to use UpLead with another platform that gives the business process and hub but doesn't give accurate contact details like the quality and the volume that UpLeads gives us.\n\nWe believe that with the support of UpLead team, we might not need to use any other tool."
  },
  {
    "Review Date": "10/20/2021",
    "Reviewer Role": "Owner",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "After using several tools I have started using the powerful Uplead tool. It is something that goes beyond my expectations. This is so user-friendly. Even a person who isn't familiar with this type of tool can use it easily. It has a huge collection of every data, so it'll be helpful for you to reach your ideal clients. Again, if you are stuck somewhere while using it, contact the customer support team. They will help you in every way.",
    "dislike": "I think they are very accurate on their job. Therefore they provide only accurate and trustable contact info. So for that, you'll get limited data.",
    "problems solved": "Actually researching for target audiences or business is so time consuming and painful too. Uplead is accurate to provide the most needed data and information and also makes the job easier. The verified contact info and email addresses especially help me a lot."
  },
  {
    "Review Date": "05/12/2022",
    "Reviewer Role": "founder",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Unlike with LinkedIn's Sales Navigator, we can set the exact revenue range co.s we want to reach.",
    "dislike": "costs a bit more than other solutions but as they say, sometimes you get what you pay for.",
    "problems solved": "we always get a fresh list of leads every month"
  },
  {
    "Review Date": "11/22/2021",
    "Reviewer Role": "Manager",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "You need a tool that can easily integrate and support you for finding the right connection and Uplead is the one that can help you in this regard. There are several parameters here for searching that increase the availability average. Also, it comes in a friendly budget.",
    "dislike": "Some of the information are backdated that needs to be update. Also, some functions are clunky that can be made more user-friendly.",
    "problems solved": "By using Uplead you can save a lot of your time and efforts as it provides you the accurate data and information that you need the most."
  },
  {
    "Review Date": "04/05/2022",
    "Reviewer Role": "Virtual Assistant",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "It helped my get leads for a project I was working on, I love the Url feature most.",
    "dislike": "It served me in so many areas, I didn't find any faults with it. It works just fine.",
    "problems solved": "It's all about leads, I've been able to expand my business because I got the right leads, and my business has become more productive for the first time in years."
  },
  {
    "Review Date": "04/06/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "It has a very professional interface and has updated data of market. If you are in search of Updated platform then choose uplead.",
    "dislike": "Its services automatically renew and charge automatically from your account without any prior notification. This thing is really disgusting.",
    "problems solved": "I have solved my problem of cleaning products using uplead. It's  very efficient."
  },
  {
    "Review Date": "08/24/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Dependable email addresses. Links to company websites.",
    "dislike": "Phone numbers are inaccurate a lot. A small percentage of inaccurate emails. Exclusions aren't saved.",
    "problems solved": "Reaching a lot of prospects quickly."
  },
  {
    "Review Date": "12/07/2021",
    "Reviewer Role": "Territory Sales Manager",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Time savings in finding the right business and contact within the company. Contact information is consistently accurate. It saved a tremendous amount of time in researching and helped me tremendously get new connections to grow my business.",
    "dislike": "It did take me a few tries to figure things out. But support is terrific in helping me (a nontechinal person) in handling their software.",
    "problems solved": "I just needed to find a way to streamline finding the right contact to get past the gatekeepers."
  },
  {
    "Review Date": "02/01/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like the customer support and the ease of being able to connect directly via the chat option online.",
    "dislike": "I wish that I did not have a time limit on my credits and I wish that it was not so expensive. But it is a great product so worth the money.",
    "problems solved": "I can easily prospect future clients and it is an invaluable tool in finding information for leads/."
  },
  {
    "Review Date": "12/10/2021",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like the easy integration with PipeDrive",
    "dislike": "I dislike the deceptiveness of getting users to upgrade from a monthly to yearly subscription without there being a checkout screen to confirm - I was unable to get a refund and have been extremely dissatisfied with the quality of lead data",
    "problems solved": "I have been able to get leads that meet a certain revenue criteria, but am not sure whether all leads that are actually available are contained within their database"
  },
  {
    "Review Date": "04/27/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Ease of use. The simple Contact Search works for company name and contact name.",
    "dislike": "For some of the really large companies, it is tough to find subsidiaries.",
    "problems solved": "Finding better contact information including email addresses and mobile phone numbers."
  },
  {
    "Review Date": "08/24/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Reliable, up-to-date emails, easy to use",
    "dislike": "need to key in my card for payment/trial",
    "problems solved": "Right contacts"
  },
  {
    "Review Date": "06/27/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Easy access and fast lead generation.  Customer service is terrific",
    "dislike": "Could use more leads based on title or position of the contact at companies",
    "problems solved": "None that I know of"
  },
  {
    "Review Date": "07/26/2021",
    "Reviewer Role": "Business Development Manager",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Uplead is a powerful tool that enables users to view contact details per specific region (specific demographic). It gives accurate data of our target market who would be interested in our offer.",
    "dislike": "Limited data, because they only provide reliable and accurate contact info and do not include unverified contact details (which are totally junk or useless anyway).",
    "problems solved": "It helps us gather the exact profile and job titles of the decision makers within those target market companies in Australia"
  },
  {
    "Review Date": "03/16/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "UpLead is an easy-to-use, complete and reliable platform for lead generation activities.  I recommend Uplead for sales/marketing departments",
    "dislike": "It would be great that the tool might \"mark\" all the contacts already unlocked when a new search is done.",
    "problems solved": "In my particular case, UpLead is used for lead generation."
  },
  {
    "Review Date": "10/27/2021",
    "Reviewer Role": "Group Chief Executive Officer",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Compared to another platform we were using, the depth of filtering data is excellent and the user interface is simple and clean which keeps you focussed when searching!",
    "dislike": "Having tested out a couple of different platforms over the last 18 months there really isn't any negatives that I'm finding.",
    "problems solved": "Sourcing quality contact information for a niche market (Interior Design) - UpLead has returned some high quality results which will help us grow our trade sales side of the business."
  },
  {
    "Review Date": "11/05/2021",
    "Reviewer Role": "Partner",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "that the leads are verified, and the platform is straightforward to use",
    "dislike": "the only downfall is that you need to pick more contacts than you have as credits to achieve the credit limit  and you get your hopes high on making contact with that person, and it does not verify for some reason",
    "problems solved": "i have no problems with Uplead and the benefits is the time saved from having bounced emails by having verified emails"
  },
  {
    "Review Date": "01/04/2022",
    "Reviewer Role": "President",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "UpLead allows customers to vet and qualify B2B leads before downloading them, which cuts down email bounce rates.",
    "dislike": "Only a fraction of the leads in their database seem to pass their own qualification process--it would be great if more leads were verified.",
    "problems solved": "We're finding targeted, qualified B2B leads with UpLead."
  },
  {
    "Review Date": "04/27/2022",
    "Reviewer Role": "Marketing and Sales operations",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Dashboard is nice and results pop up fast",
    "dislike": "That I cant preview an email or phone number",
    "problems solved": "email list building for lead gen activities"
  },
  {
    "Review Date": "03/16/2022",
    "Reviewer Role": "sales manager",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like best that you can find email addresses for contacts",
    "dislike": "What I like least is that a lot of emails addresses are not valid and that you can't request a client.",
    "problems solved": "No problem solving -looking for sales leads to generating more revenue"
  },
  {
    "Review Date": "06/24/2021",
    "Reviewer Role": "Program Director",
    "Company Size": "Enterprise(> 1000 emp.)",
    "like": "The platform is straightforward to use. Plus, the site navigation is intuitive for someone who is unfamilar with it. I also liked how the system can verify emails and let you know which contacts can't be validate or are are known not to be up to date so that you do not waste your credits on dead end contacts.",
    "dislike": "Like any B2B business prospecting tool, the accuracy of the data is the most important feature. In my initial searches I have found several good contacts but also a number of companies are missing from the database or are using curent company names such as company names that have been changed a few years ago.",
    "problems solved": "I am using UpLead to track down current contacts at dormant accounts, as well as identify contacts at new potential client organizations."
  },
  {
    "Review Date": "09/11/2022",
    "Reviewer Role": "Self Employed",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Your customers would love to work with this tools. This is very useful to us.",
    "dislike": "More improve the service, delivery, customer experience, support.\n\nBut everthing is okay.",
    "problems solved": "Tried to get help with business leads and get the results at all and on top. Really Satisfied."
  },
  {
    "Review Date": "05/23/2021",
    "Reviewer Role": "Lead Generation Specialist",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Uplead is exceptionally user-friendly, and the availability of data for each lead is highly reliable, which is very impressive. Furthermore, their customer service is outstanding, available via email, and highly attentive. Most importantly, we love the way we can customize our information extraction process as per our needs.",
    "dislike": "The pricing plan is relatively high for small businesses. Instead, they should work on simplifying their pricing plan, focusing on small companies and startups. Also, it sometimes displays outdated leads for which the credits get deducted anyway.",
    "problems solved": "Not all the business information and leads are freely available on the internet. We often require a large volume of business data and information for our marketing campaign. And, Uplead is a tool that helps us extract more precise business information like email addresses, company information, phone numbers, etc., from a single dashboard. It has significantly saved our time and effort for searching business information."
  },
  {
    "Review Date": "10/30/2021",
    "Reviewer Role": "Owner",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Uplead is a platform that is enriched with insightful data for contacts and companies. It helps you to find your target audiences or clients very easily. Plus, all the data are very accurate and were able to meet my search criteria.",
    "dislike": "Basically, till now I like all their features. But the company listing should be increased. It will be better then.",
    "problems solved": "We’ve saved so much time, we were manually researching contacts before on Google. Our sales pipeline started growing quickly about one week after we started using UpLead daily. I highly recommend it."
  },
  {
    "Review Date": "03/16/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Uplead allows you to search in a lot of different ways, by company or name or industry.",
    "dislike": "Uplead should should simplify their design.",
    "problems solved": "We can find emails and numbers for potential prospects fast"
  },
  {
    "Review Date": "01/04/2022",
    "Reviewer Role": "Homicide Detective",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Good and updated information. Quick response from customer service.",
    "dislike": "Have to sometimes refresh the page to get information to load or toggle between tabs.",
    "problems solved": "Spending less time searching for contact information, making more contacts, getting results."
  },
  {
    "Review Date": "08/19/2021",
    "Reviewer Role": "Founder",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "What I like the best about Uplead is the quality of the contacts in the database and also the very powerful way you can search for your ideal kind of clients with precision based on numerous search criteria.",
    "dislike": "What do I dislike about Uplead? This is a tough question, I am yet to find out.",
    "problems solved": "With Uplead I am solving the problems of generating and sorting out high-quality and easily verifiable leads, doing all these and more using one very powerful tool."
  },
  {
    "Review Date": "12/06/2021",
    "Reviewer Role": "CEO",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The tool is cleanly designed and easy to use. Most important, the API works fine and enables anyone to automate processes. Great coverage of US company data.",
    "dislike": "The company logos are in general not available as scalable vector graphics (SVG format).",
    "problems solved": "We are automating marketing campaigns using emails."
  },
  {
    "Review Date": "05/25/2021",
    "Reviewer Role": "Founder",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Love the monthly subscription model, love the team functionality, love the customer support, love the recent addition of mobile numbers, and love the CRM integration.",
    "dislike": "Small critique but would like a \"status check\" button for each lead. Right now, I'll spend about 2-3 minutes researching each lead and each company before \"unlocking\" the email address, and many times the email is invalid or accept all (I am only using verified email at this moment to build my domain reputation). I would love to simply check the email's status (without unlocking and revealing the email address) before investing time into researching the lead before unlocking it.",
    "problems solved": "I'm finding quality leads for my small business search. They make finding emails and verifying them extremely easy. Additionally, their API helped me create a scalable process for my outbound campaign."
  },
  {
    "Review Date": "12/02/2021",
    "Reviewer Role": "VP Business Development & Marketing",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The UI is pretty intuitive, for the most part. It's pretty easy to target lead lists based on specific titles, and other demographic data",
    "dislike": "The data quality is sketch. You generate a lead list of 100 and only 30-40 are verified....so if you have 100 credits, you have to go through the process 10 times to use up your credits.\n\nThe billing, terms are obnoxious. You have to cancel early and lose credits. Avoid the annual term at all costs.",
    "problems solved": "SDR targeting lists for outbound sales"
  },
  {
    "Review Date": "11/28/2023",
    "Reviewer Role": "CEO",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "A user-friendly platform with accurate and updated data. Therefore you don't even need to think about the availability. It will help you to reach the right people you are looking for. Furthermore, it saves your time and keeps you updated always. Support is also amazing by responding quickly.",
    "dislike": "So far they are too good. But their pricing is a bit costly for a startup company. They should decrease their price tag.",
    "problems solved": "I must say this is a money-worth investment. Verified contacts, email, authentic information increase the reliability and performance of your work. Also this prospecting efforts help you to be more efficient."
  },
  {
    "Review Date": "06/01/2021",
    "Reviewer Role": "D",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "It's got a good number of factors you can drill down with. It's nice you can upload a list of business URLs and filer contacts from those companies. I like that my credits roll over into the next month if I don't use them.",
    "dislike": "I wish tools like this could allow you to search based on keywords appearing in their LinkedIn profile. If you are trying to find someone in a company with certain responsibilities, the job title isn't always enough. On LinkedIn you can search by keyword and it seems to search their \"description\" and maybe their job history.",
    "problems solved": "It has helped me find people with a very specific job title in a very specific group of companies. I've been able to invite these people to come to webinars and some have attended."
  },
  {
    "Review Date": "12/08/2021",
    "Reviewer Role": "G",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Being able to target specific companies with the right decision-makers, contact information.",
    "dislike": "There was nothing I disliked about the experience so far.",
    "problems solved": "Being able to market our products and solutions to the correct people."
  },
  {
    "Review Date": "01/05/2022",
    "Reviewer Role": "Marketing Coordinator",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "the combinatorics for the search help a lot",
    "dislike": "little information on the contact center sector",
    "problems solved": "obtain contact information in different companies with a view to leads"
  },
  {
    "Review Date": "03/17/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "We love the versatility of the platform to search for contacts with filters such as type of companies, industries, locations, jobs, etc.",
    "dislike": "we couldn't find all the contact across a company, but it was functional to have at least one.",
    "problems solved": "Finding desition makers  contact details"
  },
  {
    "Review Date": "01/15/2022",
    "Reviewer Role": "Director- Operations & PD",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Uplead provides with most options in the affordable subscription range. It is easy to use, and we can quickly get contacts based on our search criteria.",
    "dislike": "There is nothing that we have come across!",
    "problems solved": "We are searching specific industries using Uplead globally, and we are happy that we could reach some unknown markets."
  },
  {
    "Review Date": "05/18/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Easy to decipher data, able to filter by industry.",
    "dislike": "The Price is a little much. Maybe more creative pricing",
    "problems solved": "data for our email outreach."
  },
  {
    "Review Date": "06/22/2021",
    "Reviewer Role": "Director of Business Development",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "I love how you can search by multiple parameters, including technology. Then being able to take a complete list and integrate them into Outreach, was a huge bonus, and what sold me.",
    "dislike": "There are some quirks to searching where it will tell me there are no results, and I have to log out and back in to reset the query. Also, some of the information is outdated, but only about 10-15%, so not enough to change my mind.",
    "problems solved": "Spending less time defining targeted prospect lists, and administrative work is eliminated by the integration of leads into Outreach."
  },
  {
    "Review Date": "01/05/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like that you can search and select only the leads you want to download.",
    "dislike": "Nothing so far, still navigating through the Uplead",
    "problems solved": "With the Uplead tool, our business is able to strategically plan and advertise our services to targeted interested industries."
  },
  {
    "Review Date": "09/23/2021",
    "Reviewer Role": "Business Development Manager",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The filtering criteria is awesome. You can select exactly who you would like to collect. It is very easy to find, filter, and download just what you need.",
    "dislike": "The price is the only thing I dislike. I know you have to spend money to make money, but I haven't made enough money to make the jump.",
    "problems solved": "It provides me with the necessary contact information to reach the businesses I am looking to target. It gets me past gatekeepers."
  },
  {
    "Review Date": "06/23/2021",
    "Reviewer Role": "Director",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like the user interface, which is easy to handle and understand. The additional information like competitors or used technology is also a great benefit. The support of Uplead is excellent, extremely fast and user-friendly.",
    "dislike": "The change from a URL company search to a personal search could be easier—a minor thing.",
    "problems solved": "Research of prospects before I used Uplead was a real pain and not very accurate. Uplead provides the most important data and information I need. Highly beneficial are the phone number, mobile number and email addresses."
  },
  {
    "Review Date": "08/17/2021",
    "Reviewer Role": "Freight Broker",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The volume of leads is the best part.  It is beneficial to have so many leads with so much info.",
    "dislike": "Some of the functionality is clunky.  It could be more user friendly with the way you navigate in and out of lead sites.",
    "problems solved": "It is beneficial to have so much info on a company in one place."
  },
  {
    "Review Date": "10/27/2021",
    "Reviewer Role": "Aerospace and Defense Industry Consulting",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Quality of the leads and detailed search parameters.",
    "dislike": "Nothing I can think of.  It is the best I've used.",
    "problems solved": "Uplead eliminates a lot of time and frustration found with other platforms by providing current intelligence and account information"
  },
  {
    "Review Date": "01/04/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "It was very easy to get up and running with UpLead, only took moments. Their database seems robust and got us near immediate access to leads!",
    "dislike": "NA - but we have not tested bounce rates and data quality yet.",
    "problems solved": "Lead generation."
  },
  {
    "Review Date": "12/14/2021",
    "Reviewer Role": "Deputy Manager",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Accurate and reliable data. I have got my initial data from their free version.",
    "dislike": "This platform works on a credit basis while unlocking the profiles of different businesses & sometimes the profile is not well managed.",
    "problems solved": "UpLead claims 97% data authenticity. More than 90% is acceptable to me."
  },
  {
    "Review Date": "10/04/2021",
    "Reviewer Role": "Owner",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Pretty easy to learn and start using right away.",
    "dislike": "Would like a geographical search by zip code radius.",
    "problems solved": "The data seems to have a pretty good accuracy rate. I can fairly quickly export the contacts i need to Excel or Hubspot."
  },
  {
    "Review Date": "01/04/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Great leads at a good value! I can always get support Quickly",
    "dislike": "Nothing. This product fulfills all of my small business leads.",
    "problems solved": "I can connect with way more potential clients"
  },
  {
    "Review Date": "07/13/2021",
    "Reviewer Role": "Regional Sales Director",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like how easy it is to look up contact, create searches and how it seamlessly pulls the info we need to our CRM",
    "dislike": "I wish there was buyer intent data but I have heard that is coming soon.",
    "problems solved": "Identifying the right stakeholders to contact regarding our product."
  },
  {
    "Review Date": "08/01/2021",
    "Reviewer Role": "Marketing Manager",
    "Company Size": "Enterprise(> 1000 emp.)",
    "like": "Uplead helped us to reach the right people we are looking for. We loved the filter system of uplead. We can easily narrow down the leads based on different criteria.",
    "dislike": "Some of the data were old, so we had to face some issues there.",
    "problems solved": "We are a real estate group and looking for contact information for a certain title. We use Uplead regularly to get quality leads."
  },
  {
    "Review Date": "11/12/2021",
    "Reviewer Role": "Chief Innovation Advisor",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Contact information is correct to a good extent, the accuracy is good.",
    "dislike": "We have to be very careful with the filters; it is too messy. One tiny error, and the results are horrible.",
    "problems solved": "Lead generation, prospecting."
  },
  {
    "Review Date": "03/26/2021",
    "Reviewer Role": "Chief Financial Officer",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Uplead does have a good leads database/mechanism and the software works well.",
    "dislike": "Fortunately when I signed up I used Privacy.com which allows me to spin up credit cards that I use for specific vendors. It also allows me to pause or turn off a credit card. Without that feature, Uplead would by now, have charged me thousands and thousands of dollars that I would have had to fight to recover. Even after speaking to their customer service folks directly on not once, not twice but three times, who assured me they would turn off billing - even after all that, they still bill me every month and every month I get an email from Privacy.com thankfully declining their attempt. Not only do they try bill me for the current month, they have been adding all the previous months so the number just keeps getting bigger.",
    "problems solved": "They provided contact details for leads using specific filters."
  },
  {
    "Review Date": "08/12/2021",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I love that UpLead has many different search functions - I can search by job title, industry, revenue, etc. Two of the most helpful things when dealing with clients are the URL function and the \"exclude previous downloads\" function.",
    "dislike": "Sometimes it shows more contacts on the website than the amount of contacts that actually get downloaded, but that's not much of a problem :)",
    "problems solved": "UpLead cuts down on time needed to find new leads. It also helps so that we do not have duplicate contacts and therefore do not contact the same person more than once."
  },
  {
    "Review Date": "08/19/2021",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The ease of navigating through the platform and exceptional filtering mechanics.",
    "dislike": "The search results varied each time I have used the platform. The initial results yielded great results, with complete contact info, but other results gave false email addresses that bounced back. Another slight downside is the price, that is a bit heavy on early startups, but for a more established business, it might be worth their buck.",
    "problems solved": "I have managed to find several leads using this platform and established contact with them. This is something that I had been struggling with for the past month and UpLead has helped me with that."
  },
  {
    "Review Date": "05/25/2021",
    "Reviewer Role": "Vice President of Sales",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Uplead is easy to use, and the data is accurate! We use UpLead to identify the appropriate points of contact for our sales efforts and gather contact information.  I've used many tools like UpLead and have found UpLead has the best bang for the buck. Plus, with scalable solutions, anyone can use the product and scale up as they experience positive ROI - and I'm sure they will!",
    "dislike": "I would like to see more contacts available. For some industries, there are not many contacts available.",
    "problems solved": "I am using UpLead to gather contact information for my prospects."
  },
  {
    "Review Date": "08/04/2021",
    "Reviewer Role": "Owner",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "It has all I need to contact potential clients, it makes the process of lead gen so much easier.",
    "dislike": "Honestly, so far I haven't disliked anything",
    "problems solved": "It's hard to find contact information of potential clients for my industry online, using UpLead I can find the contact info of any potential client I would like to work with."
  },
  {
    "Review Date": "07/30/2021",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "UpLeads are extremely accurate and we're getting far better results in email marketing with them than the ones our client bought from SalesGenie.",
    "dislike": "Nothing, it's great and suits our needs.",
    "problems solved": "Our client needed to make up for lost sales during COVID. He came to use with a purchased SalesGenie list that was junk. We needed verified leads with accurate data, and UpLead allows us to generate our own lists.  We know exactly what search criteria we used to filter the leads and know exactly what we're getting."
  },
  {
    "Review Date": "10/15/2021",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "They support all my questions very quickly, and the data is reliable",
    "dislike": "Wish it had more technology sources in the company listing.  The list is good, but more would be better.",
    "problems solved": "Finding contacts at companies with cell phones due to the out of offices work situation.  If a lead is bad, they instantly credit me."
  },
  {
    "Review Date": "06/23/2021",
    "Reviewer Role": "Lead Generation Specialist",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I love how it filters the searches. It gives you specific and accurate information.",
    "dislike": "Nothing so far. Although it has a limited 5 free credits, still it will give you ample ways to explore the database.",
    "problems solved": "I actually have a list of contacts but they have lacking personal emails and phone numbers. Upon working on the free 5 credits, it showed me the data I am looking for. Which is perfect!"
  },
  {
    "Review Date": "07/13/2021",
    "Reviewer Role": "Client Solutions Manager",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "UpLead's filtering tools allow me to drill down in the organization and find the right people. Adding keywords and also being able to exclude keywords is super powerful.",
    "dislike": "Some of the contact information (10-20%) is wrong or out of date.",
    "problems solved": "I'm able to contact the key people at target organizations. That makes my prospecting efforts more efficient."
  },
  {
    "Review Date": "02/18/2021",
    "Reviewer Role": "Founder",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Before Uplead, I used 3 different tools to come up with a good list to start my Outreach. Countless hours in identifying the right people, export them, clean the exported list, getting the Linkedin Profile URLs, finding the professional emails, and verifying them... It was a hassle.\n\nThen Uplead came in! easy-to-use, accurate information, and flexibility.\n\nThe dream of every Sales Person that wants to target the right people.",
    "dislike": "Pricing:\nWith an avg price of 0.5 per lead, running experiments can be a bit expensive.\nThat said, if you know your market well, Uplead is THE way to move fw.\nIf you, however, are in the process of understanding your market and run experiments, then you need t to be prepared to invest.",
    "problems solved": "covered in the previous question"
  },
  {
    "Review Date": "01/05/2021",
    "Reviewer Role": "Business Owner",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The price was reasonable but the contacts were completely out of date for our industry.  The use of SIC codes was useful.",
    "dislike": "The system makes you search cities and surrounding areas. It works on mass downloads to keep the percentages correct.  IF you are doing mass marketing, it may be useful.  It was out of date compared to other sites we used prior and after signing up.  I lost all of the money I paid despite the fact I could show them leads that were completely out of date, unverified and companies that had been bought out years before.  As a resource for my industry, it was useless.",
    "problems solved": "I attempted to work with Uplead but past the apologies, I got nothing.  As stated above, if you are a mass marketer, you can probably get away with this system.  I just gave them a donation for 2020 with no ROI."
  },
  {
    "Review Date": "04/27/2022",
    "Reviewer Role": "Director",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Excellent UI, easy to use at first sight and most importantly for me the pricing is sensible (I'm looking at you Zoom Info!)",
    "dislike": "Fiddly credit sometimes, probably because I'm on a tight budget",
    "problems solved": "Prospecting\nHyper targeting leads\nInsight into marketplaces"
  },
  {
    "Review Date": "09/27/2021",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like the filter searching system used.",
    "dislike": "I wished that you had a phone app to use",
    "problems solved": "I am solving my companies lead generating problems. We did not have a platform in the past. We have realized more closed sales by using your forum."
  },
  {
    "Review Date": "02/02/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Gives you some contact info. But besides that, nothing. Would not recommend",
    "dislike": "Wouldnt recommend. Slimy sales tactics to overcharge you.",
    "problems solved": "Poor customer service"
  },
  {
    "Review Date": "02/03/2022",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "interface and details plus the lead generation accuracy",
    "dislike": "Some invalid contacts and expired number",
    "problems solved": "Lead generation and market research"
  },
  {
    "Review Date": "07/15/2021",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "UpLead gave me exactly what I was looking for to query businesses for different marketing campaigns (by location, by size, by industry).  The cost was one of the better priced services.  The data seems pretty accurate too.  I use SOHO for my CRM and it very easily integrated with SOHO; just a click of a button.",
    "dislike": "I hope they do add a filter feature '# of company locations'.  That would be really helpful if I'm looking for multi office vs single office clients.  But its not a deal breaker at all.  UpLead still gives a lot of options to filter for your campaigns.",
    "problems solved": "I use it for marketing campaigns and its worked brilliantly."
  },
  {
    "Review Date": "07/19/2021",
    "Reviewer Role": "Director Of Business Development",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Tells you if an email is invalid/ accept all",
    "dislike": "Would love to be able to download invoice",
    "problems solved": "Huge # of leads from all over the world, with name, company, function, email address and sometimes even mobile phone #"
  },
  {
    "Review Date": "05/26/2021",
    "Reviewer Role": "Account Manager",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Having the name, face pic, email addresses and social media of most of the accounts is a WIN!",
    "dislike": "That I can't roll over my credits on my current membership",
    "problems solved": "New business and increased revenue.  Developing partnerships with similar industries."
  },
  {
    "Review Date": "12/07/2020",
    "Reviewer Role": "Social Spaces Business Development Specialist",
    "Company Size": "Enterprise(> 1000 emp.)",
    "like": "",
    "dislike": "",
    "problems solved": ""
  },
  {
    "Review Date": "11/26/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Their company filters are amazing and their live chat support have helped immediately when needed.  Having the ability to search by applications and services that companies are utilizing has been amazing.  I would would highly recommend this product and have had nothing but success in utilizing all of it's features in my daily sales / marketing role.",
    "dislike": "Nothing really to dislike, but I would say the only thing would be that I was in love with version 1.0 and getting used to 2.0 was a bit of a learning experience.  That being said the live chat helped me find where things were moved to in the new version immediately.  So really I do not have any real dislikes of the product and would highly recommend.",
    "problems solved": "We need to reach out to a very specific group of individuals and businesses and their company filters (Ex. What systems and technologies are being utilized) have been unbelievably helpful.  We need to reach out to a very specific group of individuals and businesses and their company filters (Ex. What systems and technologies are being utilized) have been unbelievably helpful."
  },
  {
    "Review Date": "08/23/2021",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "As a user of many different database tools, ZoomInfo, Discover.org, Lusha, I found UpLead's user interface and search features easier to navigate and more intuitive to use. I jumped right in and created lists of targeted contacts and companies that fit our ICP for engagement.",
    "dislike": "Pricing could be a bit more flexible.  Realistically,  we run campaigns in the USA with contact lists that are qualified and scrubbed but may have upwards from 600 to 6000 contacts.",
    "problems solved": "Sourcing quality contacts that fit our personas and ICP for marketing and business development campaigns."
  },
  {
    "Review Date": "11/24/2020",
    "Reviewer Role": "Chief Strategy Officer",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "UpLead comes in at a tiny fraction of the cost of the \"big\" data providers out there. Our clients love our ability to deliver lists and contacts in minutes, at minimal cost.\n\nData quality is generally good. I'd say it's something like an 80% hit rate, though that takes into account an absolute TON of \"accept all\" email addresses. For better or worse, though, that's the way of the world.\n\nThe customer service team is great. An intern mistake cost us a TON of credits. They understood and reimbursed, no questions asked.",
    "dislike": "A built-in company name -> URL converter would be extremely useful. We need to use third-party tools now, which adds effort and expense.\n\nIndustry search could be a bit more intuitive. If you have a SIC or NAICS code (or a knowledge of the technical industry title) it's great. If it's a prospect segment that goes across multiple parts of SIC segment, things get trickier. At that point, you're running some pretty draconian negatives.\n\nCompany revenue (as seems to be standard with these types of data systems) is often inflated quite a bit. That's to be expected, but it does take one potentially available filter out of the equation.",
    "problems solved": "Our clients always need specialized lists. UpLead lets us provide them quickly and easily.\n\nThe ability to directly enrich or create records in Nimble is important. We use that CRM, as do several of our clients. Direct integration (without the need for a spreadsheet interstitial) is key. On the spreadsheet side, the completeness is excellent."
  },
  {
    "Review Date": "06/21/2021",
    "Reviewer Role": "Business Development Manager",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Really enjoy the layout of UpLead and I feel good about the larger companies that use it.",
    "dislike": "Wish I had a little more contacts in my metro area.",
    "problems solved": "Lead generation for one. Also, the ability to cross-reference with client competitors to go prospect them as well."
  },
  {
    "Review Date": "11/11/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Uplead makes it very easy to find industries and target companies by use of different technologies. Making a list of companies filtering for size, industry and location is a breeze with the layout. Once you've found your target companies, its very easy to find specific titles and add them to a customized list. Our company has a CRM integration with salesforce dot com so pushing your new leads over to work with them is incredibly seamless.\n\nI really like the fact that once you try to unlock an email it is tested at time of unlock. If the email is found to be invalid you get your credit back. This is way better than the alternative of scraping the email, sending it off into cyberspace and then getting an Undeliverable or worse yet not receiving an mailer daemon & just wondering  where  your outreach sitting.",
    "dislike": "There are a few times  I've ran into some stale information and I don't mean by like a couple of years, I mean like a decade or more. It doesn't happen very often but, its like any other database of information - not necessarily a huge knock.",
    "problems solved": "I am getting a lot more traction having an easy way to sort and find customers that are in our lane of targeting. This is done through all of the information that uplead provides. I find that my combining a targeted approach of choosing who I'm going after AND tailored message has worked best."
  },
  {
    "Review Date": "05/26/2021",
    "Reviewer Role": "Director Of Business Development",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Ease of use, breakdown by company or category.",
    "dislike": "Not all emails are 100%n accurate but success rate is around 90% - 95% so it is worth using.",
    "problems solved": "Between using Uplead and Linked in and can get the direct contact and their email (or at least email format) to reach my desired customer."
  },
  {
    "Review Date": "10/15/2021",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The search by industry code function is what really sold me on the product.",
    "dislike": "I don't like the credit system. The price is comparable affordable, but you can get in the weeds really fast if you have multiple users mining data.",
    "problems solved": "Using uplead to append data has been our primary goal. There are some nice features there."
  },
  {
    "Review Date": "12/07/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Retrieving business email addresses can be time-consuming, especially for LinkedIn contacts.  Finding the appropriate contact also can be a chore with mixed results. Upleads makes these processes simple. They play fair, allowing you to roll over credits from one month to the next and not charging for leads without verified email addresses.  This has been a game-changer for my sales consulting business shaving hours and days from my lead generation work.",
    "dislike": "Absolutely nothing!  Great solution in researching leads and businesses",
    "problems solved": "Obtaining accurate lead information in a short period of time and building confidence with my clients who may be lost at sea buying lists or struggling with other solutions.  I can get on a call with a prospective client and demo the platform.  One has just bought 6,000 credits after my initial demo."
  },
  {
    "Review Date": "04/14/2021",
    "Reviewer Role": "Director Of Sales",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Very user -friendly and we have not had bounce- back emails.  Phone numbers are correct too!  Worth every penny.  I have used other programs and Uplead is miles ahead.  Their support is great too!",
    "dislike": "I do not have any dislikes. Uplead has met our expectations and delivered on its promises.",
    "problems solved": "Uplead is much more accurate with email and phone numbers.  Also, very user-friendly and the support has been great."
  },
  {
    "Review Date": "10/01/2021",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Throughout every aspect of the education and sales process, Uplead.com  has provided consistent, high-quality, and accurate customer service.",
    "dislike": "There is nothing I dislike about uplead.com. Today it's rare to find a company that lives up to its stated mission and goals. I highly recommend it.",
    "problems solved": "Uplead allows for more accurate lead generation, sales, etc....Uplead.com also integrates well with CRM."
  },
  {
    "Review Date": "11/11/2020",
    "Reviewer Role": "Sales Staff",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "My favorite aspect of Uplead is the flexibility it offers as far as integrating with CRM's, different options for using credits to see contact information, and creating custom lists for use later. Not to mention it is vetted regularly and all the information is legit and up to date as far as my experience downloading leads so far!",
    "dislike": "There really isn't much to dislike about Uplead, it is competitively priced, offers a much more user friendly and simple webpage to navigate the database, and it doesn't require much human intervention whatsoever.",
    "problems solved": "We have been able to reach key decision makers much more easily within organizations we have had contact with in our sales pipeline. It helps to have such easy integration with Hubspot so that I can keep track of the leads I am targeting as they evolve over time."
  },
  {
    "Review Date": "08/18/2021",
    "Reviewer Role": "M",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Ease of use!  And the Customer Service its great",
    "dislike": "I have not found anything  yet that I dislike",
    "problems solved": "My marketing is more precise I can get directly to the dept or person I need to contact in the organization"
  },
  {
    "Review Date": "06/24/2021",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I finally figured out how powerful it was.  I did not use the learning information they provided when I purchased  the product .  Watch the video before you start,  once you do you will  find the site easy to use and very pleased with the results.",
    "dislike": "Since I spent more time learning the functionality, there is nothing I do not like.  The frustration I used to have  was my own fault not the product.",
    "problems solved": "Finding contacts, emails, and phone numbers\nThe results give me the contact info I want without the  expensive Linked in subscription"
  },
  {
    "Review Date": "08/02/2021",
    "Reviewer Role": "Vice President - Digital Marketing",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Its valid emails have a low bounce rate and the information is mostly accurate.",
    "dislike": "The data reads like about 35,000 and you get only about 1000 valid emails.",
    "problems solved": "We are trying to build a list and it's been effective. Our subscribers have gone up by 80%."
  },
  {
    "Review Date": "05/26/2021",
    "Reviewer Role": "Director",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Is very fast and intuitive. I was pleasantly surprised that it had a large database of LATAM companies",
    "dislike": "Sometimes you have to clear the previous search, but it is no that bad.",
    "problems solved": "I used UpLead for prospecting telecom companies in LATAM. I found companies that i did not know!"
  },
  {
    "Review Date": "05/26/2021",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "User friendly. Current contact information. Easy to research by title, industry, size of company. Competitively priced.",
    "dislike": "I have had no concerns or issues with Uplead and have recommended it to my entire sales staff.",
    "problems solved": "I quickly solved the challenge of finding an affordable lead generation tool that offered valid email, phone, cell phone, and contact information by title, company size, and location."
  },
  {
    "Review Date": "06/24/2021",
    "Reviewer Role": "Business Developer",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "The best part is using filters, you can reach your exact targeted audience.",
    "dislike": "For now, there is nothing which i dislike",
    "problems solved": "I use uplead for my lead generation, and that platform is really awesome."
  },
  {
    "Review Date": "12/09/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like being able to see 100 contacts at once for larger organizations. It's nice to be able to add people to Hubspot easily. I like being able to filter by Job title",
    "dislike": "No mobile app; the Chrome plugin doesn't always recognize when I'm on someone's Linkedin page, and thinks I'm looking for company info from Linkedin; the Chrome plugin doesn't always show as much info as I need to see (Zoominfo does this pretty well)\n\nZoominfo also has org charts, which is helpful to see by department",
    "problems solved": "I am using UpLead to supplement ZoomInfo which my company pays for. The main benefit is filling in the gaps and sometimes working faster with UpLead"
  },
  {
    "Review Date": "10/29/2021",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "UpLead empowers targeted account market research including buyer intent",
    "dislike": "We would prefer more unlocks for the price.",
    "problems solved": "We are performing targeted account market research including buyer intent"
  },
  {
    "Review Date": "11/11/2020",
    "Reviewer Role": "President",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "We tested a number of sales prospecting tools and chose UpLead for several reasons. The platform is straightforward to navigate, the cost is reasonable, and, unlike all the other platforms, you can cancel your subscription at any time. That makes it ideal for small businesses that need small numbers of prospects -- not thousands every month. We've also found that the email support provided is super-responsive and human!",
    "dislike": "No platform is perfect. As long as they keep adding to their database, I'm sure we'll be content with the platform for a long time.",
    "problems solved": "It helps to demonstrate to clients that there are lots of potential clients in the marketplace for them."
  },
  {
    "Review Date": "04/21/2021",
    "Reviewer Role": "Digital, Streaming Audio, OTT & Sports Marketing Account Executive",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Intuitive.  I like the verifier tool as well.",
    "dislike": "Nothing in particular that I do not like.  It is a solid platform.",
    "problems solved": "I am gaining access to emails for prospects that I am trying to get in touch with."
  },
  {
    "Review Date": "07/13/2021",
    "Reviewer Role": "Executive Vice President",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Completeness of information - easy to use",
    "dislike": "Just getting used to another platform - not a problem",
    "problems solved": "Locating and cross-referencing leads are a problem that is solved with this application."
  },
  {
    "Review Date": "01/08/2021",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I enjoy utilizing the location factor to target specific state industries.",
    "dislike": "I don't appreciate outdated/invalid contacts. I often times find myself unable to download quite a few valid contacts.",
    "problems solved": "We needed an affordable, yet effective platform to obtain contacts in our area for sales. UpLead is incredibly user-friendly and has allowed to gain contacts all over the our state and land sales we would not have obtained otherwise."
  },
  {
    "Review Date": "11/15/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Uplead was one of the simplest tool that provides solutions in sales, which I love because it has allowed me to review emails, contacts, sales supports, through our website in order to provide users with personalized attention and complete sales, I am happy and the team because it makes a very detailed and complete crm, thus allowing us to improve the company's capacity in terms of both sales and traffic.",
    "dislike": "Certain aspects of the system works, however, it can be somewhat obsolete because other tools from other systems can be much more aesthetically pleasing, although the system works correctly, it can improve in that aspect.",
    "problems solved": "The tools where we can connect with marketing software undoubtedly widen the functionality and is pleasant because Uplead allows us to know what we can do to improve our sales, it also has detailed lists with a complete marketing in order to attract new visits and potential customers , We find the system nice and how we can maintain great functionality allowing me a much easier teamwork, in general it is very detailed."
  },
  {
    "Review Date": "11/12/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "UpLead has been vital to the success to the success of my sales efforts. It has provided me with valuable insight to companies and individuals allowing me to make direct connections rather than relying on LinkedIn first. Also the customer support is great and the people are really helpful. The responses are rapid and they always solve the problem in a timely manner.",
    "dislike": "I would like to see a little more on the technologies used page as there seem to to be generic info there. Also a little more information about the companies would be helpful. Before the latest update it was better.",
    "problems solved": "Getting to sales leads faster and allowing me to better understand the businesses I'm targeting. We have had more success getting new business meetings and improving our pipeline of opportunities. I also am able to do research on the organizations and gain valuable intelligence on why I should be selling to them and what I can talk about when I open the conversations. When reading the site I'm able to extract loads of technology knowledge for thier current environment to see how our technology can enhance what they currently use."
  },
  {
    "Review Date": "11/12/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Uplead has several features to narrow or expand business lead searches by type of industry. Designations of leads provide intelligence into operating models of companies, and help channelize inquiries with good precision.  Options of company search and contact search offer convenience and speed.  Within industry, the sub-categories help scale and limit searches without overwhelming the database.  Contact searches are simplified and easy to navigate.",
    "dislike": "Searching by role is sometimes cumbersome. For example, when searching for leadership roles in Engineering (VP, Director, Manager), it is difficult to just search \"Engineering\" and expect those roles to show up. Some of the contacts are not downloadable, indicating that UpLead is not validating and purging them frequently. Sometimes no contacts for a company can be downloaded. Also, sometimes emails sent to the downloaded leads bounce back, indicating the person might no longer be with the company. Before downloading the lead, I often check their LinkedIn status to get confidence in the validity of the lead. Perhaps, UpLead could add the option for users to report invalid leads.",
    "problems solved": "The key challenge for me was to generate industry-wide leads to develop a comprehensive and large audience for advertising business services of my company. UpLead not only made it possible, but also easy and straight-forward."
  },
  {
    "Review Date": "06/22/2021",
    "Reviewer Role": "General Manager",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The option to filter through leads is awesome.  I find the interface easy to use.",
    "dislike": "You have to choose which type of emails you will accept as not all emails are validated.",
    "problems solved": "Biz Dev.  Growing new client base."
  },
  {
    "Review Date": "11/20/2020",
    "Reviewer Role": "Co-Owner",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Ease of use. Searching by industry or person is simple. I have a fairly high rate of success with capturing the right email for the person I am wanting to reach out to.",
    "dislike": "about 5% of the emails or contacts are not valid.",
    "problems solved": "I am generating leads in Uplead and then vetting names via linkedin to make sure I have the right person. I get better responses when I know I have the right person. This really is a great resource."
  },
  {
    "Review Date": "05/14/2021",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The team from Uplead is extremely helpful and supportive.",
    "dislike": "I struggled a bit with the search and filter possibilities.",
    "problems solved": "Getting verified email and phone numbers is a great help to get in touch with the right prospects."
  },
  {
    "Review Date": "04/14/2021",
    "Reviewer Role": "S",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Easy way to search for specific contacts in the industries I prospect into. The data is relevant, accurate, and the integrations to my CRM make it extremely easy to import the data I've pulled!",
    "dislike": "Wish there was more data from SMB / Mid Market sized customers.",
    "problems solved": "Finding direct contact to desision makers, it cuts prospecting time in half when you can go directly to the right contact."
  },
  {
    "Review Date": "06/22/2021",
    "Reviewer Role": "Director of Sales",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Very comprehensive, found almost everyone I searched for",
    "dislike": "I couldn't find anything that I disliked at all",
    "problems solved": "I'm researching companies and locating the proper individuals to prospect"
  },
  {
    "Review Date": "04/21/2021",
    "Reviewer Role": "CEO/Founder",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Easy to use interface, accurate data,  and great company insights.  Emails are verified and accurate. Customer service is very responsive and helpful if an issue arises.",
    "dislike": "Ability to integrate with the CRM I use.",
    "problems solved": "Lead generation, prospecting, lead info,save time in getting information. One platform for insights, email verification, and contact data. The ability to find data quickly and efficiently."
  },
  {
    "Review Date": "08/18/2021",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "All the filters and segmentation options allow you to find what you're looking for quickly.",
    "dislike": "Uplead could have a click to call option.",
    "problems solved": "We are using uplead to put an ease on our lead gen efforts"
  },
  {
    "Review Date": "06/23/2021",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like the ability the quickly export into an excel file",
    "dislike": "I wish there were more verifiable email addresses.",
    "problems solved": "I can find the right point of contact."
  },
  {
    "Review Date": "10/14/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The Uplead system is much more than attracting new customers with marketing, it allows it to broaden this objective and to bring traffic and sales, however it is a system that is coupled to automate sales that is what Uplead offers to me, it seems great because it offers great changes in the sales and presentation of the company a more complete support and in addition to allowing solutions to be provided to our clients in the sense of making such sales is detailed and complete.",
    "dislike": "It has definitely allowed us to achieve viable solutions in the sense of being able to expand our sales for this reason I do not have a negative point regarding the operation of Uplead I think it is great that this software can make an additional automation system to the sales system for me it has been very complete detailed and I like how it worked.",
    "problems solved": "The Uplead and marketing system is necessary in the company and the functionality to expand both the traffic and new customers but in turn manage the sales to automate in order to offer support, help, offers, promotions allowing to bring the customer and Specify, for me it is a reliable platform that ensures a massive sale allowing to achieve trust and automation objectives. I am very happy."
  },
  {
    "Review Date": "11/11/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like the detailed filters more than any of the other tools that I have used in the past. We work with a lot of wholesalers/distributors, and that filter did not exist on some of the other tools that I have used.",
    "dislike": "Everything works well. Some of the data is not completely accurate, but that is to understandable with these tools.",
    "problems solved": "I am finding companies and contact information that I did not already have."
  },
  {
    "Review Date": "11/26/2020",
    "Reviewer Role": "Corporate Account Manager",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I really liked how user friendly is it to use. I've used other services like zoominfo and seamless.ai. Uplead is the most cost effective and gives me correct information for me to pursue the companies I want to.",
    "dislike": "Nothing really other than maybe more contacts. I do like how they're able to fix broken email addresses and phone numbers.",
    "problems solved": "I'm able to reach out to decision makers without having to call and bounce around to different departments. It's beneficial to use for bigger companies. This changes my follow up from 8-15 touches to 5-10 as I have the right person to connect with each time."
  },
  {
    "Review Date": "02/17/2021",
    "Reviewer Role": "Founder/CEO",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "They collect the information from many resources and bring it to one place with advanced search.",
    "dislike": "They still need to add more functions like contact with the leads and integration with other platforms.\nAlso if they can offer some information about the leads' needs that will be great.",
    "problems solved": "Searching for qualified leads."
  },
  {
    "Review Date": "11/05/2020",
    "Reviewer Role": "Owner (WOSB)",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Uplead allows me to provide credits immediately to my team.  Or set a monthly amount that they receive without me going into the system.",
    "dislike": "The price.  It is spendy.  But i believe our ROI of needing only to land 5 accounts over $2k for the year is worth the investment.",
    "problems solved": "Finding new prospects in a territory that is brand new where we can no longer knock on doors due to Covid!"
  },
  {
    "Review Date": "09/22/2020",
    "Reviewer Role": "E",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Data is super reliable.  If they do not have it, they tell you before spending any credits.  I have been reviewing tools like UpLead for a couple months now and have found that they have provided the most consistent approach to attaining their data and have had few, if any discrepancies.  Their pricing is fantastic for what you receive.",
    "dislike": "The only thing I dislike is the use of credits, however, I find that the credits we will sign up to use is more than enough for myself to use.  Since I have not supplied any data to a CRM tool yet, I cannot speak to the ease of this transfer.",
    "problems solved": "The problems I have been able to solve with Uplead is having the most up to date email addresses and phone numbers possible.  I had a tool that was not as up to date as I would have liked and found myself calling and emailing to prospective clients, only to find that the email addresses were bad or the people no longer worked there.  Uplead has been able to help me prospect with much more reliable information and get in front of more people, faster."
  },
  {
    "Review Date": "11/11/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "As a B2B Lead generation agency, we've used UpLead for both ourselves and our clients. It's a fantastic database of relevant contacts that helps you target your outreach more efficiently. The best thing about UpLead is its user-friendly interface, which is very helpful when clients access it as they often want a simple experience.",
    "dislike": "There's really nothing we dislike about UpLead. It's been a great tool.",
    "problems solved": "With UpLead, we're able to target our outreach better and ensure maximum ROI. It's also been a fantastic way for clients to gain a better understanding of how lead generation works, and what it entails. They can see where their leads are coming from, and this helps them adjust their marketing accordingly."
  },
  {
    "Review Date": "06/22/2021",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I can find contact info from the company name and see the list of employees and titles.   I like that emails and direct dials & sometimes cell numbers are available.",
    "dislike": "Contact information is not always accurate",
    "problems solved": "Getting additional contact info for remote workers."
  },
  {
    "Review Date": "08/30/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "It is a platform that provides data from companies and high-quality B2B contacts, you can also obtain with the tools that a verification of emails in real time, technology monitoring, marketing based on accounts, associated profile links among others. It has great integrations with SalesForce, Zapier, and more. This way you can create a filtered view of potential clients. In general it is very complete, it has a good interface that allows you to navigate without problems.",
    "dislike": "Our results obtained with Uplead are good, however it is not so intuitive when carrying out massive email campaigns, this does not mean that it is a bad platform, on the contrary our experience has been satisfactory.",
    "problems solved": "We use UpLead for lead generation, optimal marketing performance such as social media posts, email postings, and to retrieve company details and contact information such as phone number, email address, and name. We create massive email campaigns for greater customer acquisition, this has generated that our work team has a work flow and saves valuable time that we now channel in other areas. Our sales department allows us to target prospecting and business development projects. We are happy with the results and the productivity achieved, we increased our sales and we have higher income."
  },
  {
    "Review Date": "12/10/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "I like a reasonable cost to find new prospects with up to date information and direct email.",
    "dislike": "Some of the titles and spelling are incorrect, the monitoring and editing could use some improvement.",
    "problems solved": "I have more leads and prospects in my funnel without having to spend $8,000.00 per year that I will never use, and they are just as reliable as D&B!"
  },
  {
    "Review Date": "11/13/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "Uplead is easy to use and a well built tool. Finding leads in B2B space is a very difficult task. Before using Uplead, we had to manually search for leads. The process was very daunting and time-consuming. Uplead has made prospecting and lead generation very easy for us. Not only we can now connect with our potential clients, the tool has also helped us save hundred of hours in productivity value.\nThe contact information is accurate.",
    "dislike": "The one thing I dislike about Uplead is the credit costs. They are bit expensive as compared to their competitors. Being a small business, it is hard for us to spend thousands of dollars on marketing and this is they only issue I've had with Uplead.",
    "problems solved": "Finding the potential clients in a B2B centered business is always a difficult job. With very few people attached to this mode of business, we previously had to scrap the data by google searches. At the end of they day, we used to end up with 15-20 leads. With the power of Uplead, we have access to tens of thousands of leads without having to search them on Google. Have made our life easier."
  },
  {
    "Review Date": "07/30/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Our team did the same exact search in UpLead and 4 of their competitors. Then we tried 3 more searches, just to be sure and every time UpLead returned the most companies, as well as, contacts with the data we were looking for. It was super easy to connect with the other sales tools we are using. The search functionality is intuitive and easy to use. Plus, their Support and responses have been outstanding.",
    "dislike": "There haven't been any dislikes yet, so far our experience has been really good and I would recommend trying them out.",
    "problems solved": "UpLead is solving our data issue because we are looking for more targeted prospects. The benefits are that it's fast and easy to find the data you are looking for."
  },
  {
    "Review Date": "06/09/2020",
    "Reviewer Role": "Keynote Speaker and Bestselling Author",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The UI is cleaner and more intuitive. I like how the search functions and keywords are similar to Google Ads, which I'm already used to. I like how quickly I can find my target prospects compared to LI Sales Navigator.",
    "dislike": "I don't like the fact that you can't tell which emails are verified until you try to use a credit to reveal them. I wish you could display search results only by verified emails.",
    "problems solved": "The tool saves me time and adds speed to creating micro, high-targeted campaigns. And it does a lot things that you used to need multiple tools for all in one platform. I also like the month-to-month billing option because I'm a smaller sole proprietor business and I am sporadic with my use of this kind of tool."
  },
  {
    "Review Date": "07/13/2021",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "helps with research, and makes easier to make new conatcts",
    "dislike": "I honestly can not find anything that i dislike about UpLead",
    "problems solved": "getting mobile numbers or new business numbers"
  },
  {
    "Review Date": "04/07/2021",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Mid-Market(51-1000 emp.)",
    "like": "Finding email addresses and building lists",
    "dislike": "not enough emails addresses and companies found in Canada",
    "problems solved": "Using Uplead to build a list of find an email saves me so much time and effort!"
  },
  {
    "Review Date": "09/15/2020",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "The user interface is clean and intuitive and I can locate specific, targeted contacts in seconds. It's incredibly effective and easy to use.",
    "dislike": "The only challenge is actually a positive attribute of the platform and its functionality: there are so many ways to filter that it can seem overwhelming and I'm rarely sure that I am using the optimal set of filters.",
    "problems solved": "Finding contact info for my very specific list of sales targets, either finding the emails associated with the names we've already found or finding roles/names/contact info within specific companies we want to target."
  },
  {
    "Review Date": "04/22/2021",
    "Reviewer Role": "NOT GIVEN",
    "Company Size": "Small-Business(50 or fewer emp.)",
    "like": "No commitment , data accuracy , great after sales support",
    "dislike": "maybe the portal interface and user experience",
    "problems solved": "we are getting good traction on sales"
  }
]
